{
    "ranked_movies": [
        {
            "rank": 1,
            "title": "Coming to America",
            "reason": "Most frequently recommended comedy in the discussions, praised for its humor, memorable scenes, and status as a perfect romcom."
        },
        {
            "rank": 2,
            "title": "Dumb and Dumber",
            "reason": "Highly quoted and beloved for its iconic scenes and absurd humor, frequently mentioned as a top comedy choice."
        },
        {
            "rank": 3,
            "title": "The Death of Stalin",
            "reason": "Praised as a brilliant, unique dark comedy with perfect performances and historical absurdity, generating significant discussion."
        },
        {
            "rank": 4,
            "title": "Tropic Thunder",
            "reason": "Cited as a great, edgy comedy with a fantastic cast and memorable performances, including Tom Cruise's cameo."
        },
        {
            "rank": 5,
            "title": "Game Night",
            "reason": "Highlighted as an unexpectedly great modern mystery-comedy with witty writing and strong performances, especially from Rachel McAdams."
        },
        {
            "rank": 6,
            "title": "The Other Guys",
            "reason": "Frequently mentioned as a favorite comedy with genius cast and hilarious writing, including memorable scenes like the bribery gag."
        },
        {
            "rank": 7,
            "title": "Hot Fuzz",
            "reason": "Recommended for its great script, callbacks, and jokes, often cited as a top-tier comedy with clever writing."
        },
        {
            "rank": 8,
            "title": "Superbad",
            "reason": "Consistently mentioned as a favorite comedy, beloved for its humor and relatable teenage antics."
        },
        {
            "rank": 9,
            "title": "Anchorman",
            "reason": "Noted for its iconic comedy scenes and ensemble cast, including memorable cameos in the sequel."
        },
        {
            "rank": 10,
            "title": "Borat",
            "reason": "Recommended for its shock humor and satirical comedy, often highlighted as a standout choice."
        },
        {
            "rank": 11,
            "title": "This Is the End",
            "reason": "Praised for its meta-humor and celebrity cameos, including Channing Tatum's unexpected role."
        },
        {
            "rank": 12,
            "title": "Zombieland",
            "reason": "Mentioned for Bill Murray's memorable cameo, which steals the movie and adds to its comedic appeal."
        },
        {
            "rank": 13,
            "title": "The Princess Bride",
            "reason": "Recommended as an iconic lighthearted comedy with timeless humor and charm."
        },
        {
            "rank": 14,
            "title": "Bad Santa",
            "reason": "Highlighted for its dark humor and memorable performances, particularly Billy Bob Thornton's role."
        },
        {
            "rank": 15,
            "title": "True Lies",
            "reason": "Cited as a perfect action-comedy with Arnold Schwarzenegger, blending humor and excitement seamlessly."
        },
        {
            "rank": 16,
            "title": "Kindergarten Cop",
            "reason": "Frequently mentioned as Arnold Schwarzenegger's best comedy, loved for its quotable lines and humor."
        },
        {
            "rank": 17,
            "title": "Dirty Rotten Scoundrels",
            "reason": "Praised as comedic perfection with no wasted scenes or dialogue, often listed as a top favorite."
        },
        {
            "rank": 18,
            "title": "The Nice Guys",
            "reason": "Recommended as an underrated comedy with hilarious performances from Ryan Gosling and Russell Crowe."
        },
        {
            "rank": 19,
            "title": "Clueless",
            "reason": "Suggested as an iconic lighthearted comedy, especially for those new to Western films."
        },
        {
            "rank": 20,
            "title": "Pink Flamingos",
            "reason": "Mentioned as a disturbing yet hilarious comedy with shock value, fitting requests for twisted humor."
        }
    ]
}