{"content": "## 1. If you could only recommend one of these comedy movies to someone which one would it be? (from r/whatsyourchoice)\n\n**Score:** 98\n**URL:** https://i.redd.it/ko5668lf77mf1.jpeg\n\n### Top 14 comments and their replies (up to depth 25)\n\n1. Coming to America.\n  - \"Good morning, my neighbors!\"\n\n\"Hey, fuck you!\"\n\n\"Yes,yes!  Fuck you too! ☺️\"\n  - Fr. It perfectly plays it's role as a romcom\n2. Dumb and Dumber!\n\n“So you’re telling me I have a chance…”\n  - Pull over! \n\nNo, it's a cardigan but thanks for noticing\n    - “Wanna hear the most annoying sound in the world?”\n\n“Eeeeeyaaaaaaa!”\n      - Im due for a rewatch\n  - I’m from Austria. \nWell GDAY mate\n3. Out of those - Coming To America.\n4. Coming to America\n5. Ugghh…….Coming to America I guess\n6. My vote Borat!\n7. Coming To America. \n\n🎶 She's your queeeeeeeeen tooooo beeeee🎶\n  - \"Bark like dog.\" Arf are\n\n\"Bark like a big dog.\" Woof. Woof.\n\n\"Hop on one leg.\"\n\nYeah this scene and many others.\n8. Grown ups \n9. Bad Boys is a comedy? That’s a stretch.\n10. It’s between Coming to America and Bad Boys\n11. Coming to America. It’s hilarious\n12. Coming to America\n13. 1\n\n## 2. Comedy cameos that steal the whole movie (from r/Letterboxd)\n\n**Score:** 271\n**URL:** https://i.redd.it/b7ue3j5n1ulf1.jpeg\n**Body:** Will Ferrell’s only in Wedding Crashers for five minutes, but his scenes are probably some of the most memorable (and quoted) bits in the movie.\n\nWhat other comedy movie cameos can you think of, that pretty much run away with the movie?  It might be down to a great actor, character, line, or all three. \n\n### Top 12 comments and their replies (up to depth 25)\n\n1. Bill Murray in Zombieland\n2. MA??!!!!! THE MEATLOAF!!!! FUCCKK!!!\n  - He’s getting married?? What an IDIOT!!\n3. Doesn’t steal all of it but Mcconaughey’s part in Wolf of Wall street is the most memorable part of the movie\n  - ![gif](giphy|gdwJdym3VuXQr5OfAc|downsized)\n  - You gotta pump those numbers up\n4. Neil Patrick Harris in Harold &amp; Kumar go to White Castle. Not just stole the movie but reignited his career in a huge way.\n  - Forget White Castle, let’s go get some pussy!\n  - This might be the best answer\n5. Michael Cera, This is the End\n6. Matt Damon in Eurotrip can't believe there's not a gif of that screaming Scotty Doesn't Know repeatedly....\n  - Matt Damon in Team America\n\n![gif](giphy|nzZAwMWi5Muac)\n    - Matt Damon in Thor: Ragnarok\n\n![gif](giphy|P7E2vxvQw4R2q0OoFI)\n      - Matt Damon and Brad Pitt as dating show contestants not picked (Sam Rockwell/Chuck Barris wants to kill the fat talkety mf she does pick) in Confessions of a Dangerous Mind.\n\nhttps://preview.redd.it/ahpcq5x9iulf1.jpeg?width=600&amp;format=pjpg&amp;auto=webp&amp;s=f650b59e69757d2a430e82e5b2eff9a8e146ff8e\n7. I'm not sure it steals the whole movie but Johnny Depp in 21 Jump Street gets some of the biggest reactions.\n8. Channing Tatum in This is the End. The other cameos were very much featured in the marketing leading up to its release, but his cameo came out of nowhere. It was also hilarious.\n9. Tom Cruise in Tropic Thunder, quite unlike any other performance I’ve seen from him.\n  - He was nominated for Best Supporting Actor at the Golden Globes. That’s not a cameo, in my opinion.\n10. Anchorman 2. Pretty much everyone involved in the big Anchorman fight near the end of the film including: Jim Carrey, Tina Fey, Amy Poehler, Liam Neeson, Will Smith, Sacha Baron Cohen, John C Reilly, Vince Vaughn, Kanye West, Kirsten Dunst and Marion Cotillard.\n11. Stiller in Happy Gilmore\n\n## 3. What are the best Swedish comedy movies and TV series from the 90s and 2000s? (from r/sweden)\n\n**Score:** 32\n**URL:** https://www.reddit.com/r/sweden/comments/1n313st/what_are_the_best_swedish_comedy_movies_and_tv/\n**Body:** Good morgon!\nI’m learning Swedish and I’m in love with both the language and Swedish music.\nI want to take a step forward and learn the language through things I enjoy. Since I’ve already done what I could with Molly Sandén, Veronica Maggio, and Benjamin Ingrosso, I’d love to move on to TV series and movies! I usually enjoy light comedies from the 90s and 00s (like Desperate Housewives, Will &amp; Grace, Dharma &amp; Greg in that style!). \nCould you suggest some good Swedish-made ones? Tack! ✨\n\nEdit: THANK YOU ALL! &lt;3 I'll be a mother tongue when I finish all of these xD\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. Movies: Yrrol, Torsk på Tallin, Yalla Yalla\n2. Smala Sussie is the best Swedish movie ever made.\n3. Nile City\n  - JAAAAAAAAAAAAA GOMORRON GOMORRON GOMORRON, NILE CITY 105,6, WEYRON I OTTAN, VEM É DET JAG TJÖTAR MED?\n4. KOPPS\n5. Hipp Hipp?\n6. 'Tomten är far till alla barn' is a cult classic.\n  - -Är du bög? När kom du på det?\n-När jag såg dig i bastun.\n7. Fucking Åmål och Tillsammans\n8. [Kvarteret Skatan](https://www.imdb.com/title/tt0367358/)\n9. Varan-TV\n10. BERT (1994) serien som svt vill radera från allas minne.\n11. I think Varan TV is in a league of its own. Other great ones are Torsk på Tallinn and Nile City.\n\n\nSimilar absurd nonsensical humor as Monty python in a way but done in the characteristically Swedish way.\n12. Rena rama rolf, Svensson svensson and maby en fyra för tre. All are tv series.\n13. Man kan inte gå igenom 27 kommentarer på detta ämne utan att se någon nämna Sunes Sommar. Idag gjorde jag det, idag skäms jag över mitt folk.\n14. Yrrol\n15. I'll add another vote for Pistvakt.\n16. Grotesko\n  - *Grotesco\n17. Its a christmas movie but also a massive classic\n\nTomten är far till alla barnen\n\n## 4. Over the top disturbing movies with a twisted sense of humor. Looking for shock value to the max for a movie night. Movies that balance pitch black comedy, with disturbing scenarios. (from r/MovieSuggestions)\n\n**Score:** 28\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n1wgyp/over_the_top_disturbing_movies_with_a_twisted/\n**Body:** We are a huge fan of Happiness (1998), The House That Jack Built, The Greasy Strangler, Gummo. Just something super different, offensive, with a very weird hilarious sense of humor. I know a lot of people don't find The House That Jack Built funny, but I thought it was oddly hilarious.\n\n### Top 17 comments and their replies (up to depth 25)\n\n1. The Coffee Table. (Go in completely blind)\n  - Exactly. This is what I was going to say. I'll never be the same but it absolutely fits the request\n2. Battle Royale\n\nFunny Games (original '97 is the best)\n\nBlue Velvet\n3. Dead Alive  1992\n\nOriginal title: Braindead\n\nActually saw it uncut (unrated) in the theatre.\n\nDo NOT watch an R rated version\n  - I kick ass for the Lord!\n  - Meet the Feebles (1989)\n4. Very Bad Things.\n5. Ravenous\n6. Pink Flamingos directed by John Waters. One of my all time favorites.\n7. A Clockwork Orange\n8. [deleted]\n9. Blood Diner (1987)\n10. Dogtooth \n\nI laughed through Eraserhead\n11. Boxing Helena\n12. Talk to Me (2022)\n13. Eraserhead *(1977)*\n\nInfection *(2004) - Japanese*\n\nSick Nurses *(2007) - Thai*\n\nUzumaki *(2000) - Japanese*\n14. Grindhouse- Planet terror\n15. Welcome to Woop Woop\n\nLake Placid\n\nRazorback\n\nMan Bites Dog\n\nBloodsucking Freaks\n16. Guns Akimbo.\n  - Also Swiss Army Man\n\n## 5. What’s one of your favorite comedy movies? (from r/movies)\n\n**Score:** 10\n**URL:** https://www.reddit.com/r/movies/comments/1n1op6d/whats_one_of_your_favorite_comedy_movies/\n**Body:** I absolutely love ‘The Other Guys’, the cast is genius and the writing is just incredibly hilarious. Michael Keaton’s character is perfect and just adds to the pot! I can never get over the scene with the hot dog vendor offering free hot dogs for life but no drinks. The crowd going from cheering to disappointment is just too good for me! Also the scene when they’re wrestling at the wake and loud whispering always has me laughing. \n\nWhat’s one of your favorite comedy movies? And what scenes are most memorable to you? \n\n### Top 17 comments and their replies (up to depth 25)\n\n1. Dirty Rotten Scoundrels\n\nNot a single wasted scene or line of dialogue. Absolute comedic perfection.\n2. The Death of Stalin. Pure brilliance in every aspect. And so goddamn funny.\n3. Black Dynamite\n  - You threw that shit before comin' in the room!\n4. Tropic Thunder. A great, edgy comedy with a great cast that would never be made today.\n5. Superbad always\n6. When I'm with my peers, Fish Called Wanda\n\nSecretly, Dude Where's My Car\n7. Loved Bad Santa.  The scenes with John Ritter with Billy and Tony were great.  Also his scenes with Bernie Mac. Octavia Spencer also has a small role, before she hit it big.  I watch it every December, or any time its on and I am flipping channels.\n  - In Bad Santa when he asks the kid “were you dropped on your head?” And the kid goes “MY head?”\n\n“No someone else’s head…goddammit are you fucking with me?!?” is so funny\n8. The Other Guys is so good. \n\nMine would be Popstar: Never Stop Never Stopping, Macgruber, and Adams Family Values. \n\nIn Macgruber when he blows up the van with his entire team in it and goes “Fuuuuccccckkkkkkkk. Omg! Are you guys ok? Somebody call 911” makes me die laughing just thinking about it. The way he says it and the fact that he blew the van up with an obnoxious amount of dynamite and asks if they’re ok is ridiculous. \n\nOr in Addams Family Values when Amanda goes “I’ll be victim!” And Wednesday mumbles “all your life” is gold.\n9. I may have missed it but didn’t see it listed.\n\nThe Nice Guys is absolutely hilarious!\n  - I scrolled and scrolled to find this. This is my answer, also. I cried laughing more than a few times.\n10. I think they still haven’t made a movie funnier than Life of Brian\n11. To many times list, but the first one that popped into my head is Hotrod.   If you are a fan or in the mood for a 'dumb' comedy its a great choice.\n  - I love hotrod! The plot to save his step dad so he can fight him, win, and show he’s a man is downright ridiculous and hilarious.\n12. One of my favorite comedies is \"Coming To America\" (the original, not the similarly-named sequel).\n\nMy favorite scene is any of the barbershop scenes.  The banter is totally outrageous and hilarious.\n13. Hot Fuzz.  \n\nSo many callbacks and jokes.  Great script.\n14. For me, Paul Thomas Anderson's **Inherent Vice** has climbed into the upper echelon.\n15. White Chicks. The dance scene, \"you wanna talk about mother\", the dressing room scene, and of course \"A Thousand Miles\" scene\n16. Dumb And Dumber\n\nSuperbad \n\nOld School\n\n## 6. Great movies you went into with zero expectations? (from r/moviecritic)\n\n**Score:** 2028\n**URL:** https://i.redd.it/2zyw9cuzrrlf1.jpeg\n**Body:** Game Night (2018) is a standout answer for me. Went into it expecting your typical, cliche comedy flick. Turns out, it’s one of the best modern mystery movies with great writing, witty comedy and a genuinely thought provoking plot.\n\nhttps://filmwaffle.com/post/great-movies-you-went-into-with-zero-expectations\n\n### Top 14 comments and their replies (up to depth 25)\n\n1. How can that be profitable for Frito-Lay?\n  - Jesse Plemons NEEDS to take more comedic roles.\n    - Jesse plemons is fucking amazing.\n2. Cabin in the Woods. I expected a typical predictable horror. Ended up being one of the most original films i have seen.\n  - The marketing campaign keeping a lot of the movie a secret was a great choice\n    - Nothing more annoying than watching a preview that tells you everything.\n\nAbigale is a great example.  I saw the preview, my wife did not.  She did not expect the things that happened at all.  So movie was ok for me and was awesome for her.  I try to avoid previews all together now.\n3. Wind River had me thinking about it for weeks.\n  - Why you flanking me? How did you not see it?\n    - I've re-watched that scene so many times. It perfectly captures that tense feeling as as conversation shifts into confrontation\n4. Palm Springs\n\nIt's Andy Samberg's and Christin Milioti's best work and it ain't even close. I've watched it like 5 times and thought \"Damn I wish this was 1h longer\" every time.\n\n  \nAlso didn't expect to like the Lego Movie but it was cute.\n5. Office Space. Had nothing to do and it was the only one playing at the time.\n6. Tucker &amp; Dale vs Evil\n\nYou’re welcome\n7. Staying with Jason Bateman, This is Where I Leave You is a great movie. Had zero idea what it was about, just liked the cast.\n  - Jason Bateman is just fantastic. Have you seen \"Bad Words?\"\n8. Those guys who made Game Night also made Dungeons and Dragons: Honor Among Thieves which I was happy with both\n9. Good Will Hunting. It was Xmas Day and we couldn't get into Jackie Brown. \n10. Recently; The Naked Gun (2025)\n\nCould not believe how funny it was and creative. It really does feel like a peak Leslie film, and Liam is so funny in it. Great movie\n11. Guns Akimbo was a blast.\n12. Game Night is so wildly underrated/underseen. \n\nTag was another one from right around there that I had no expectations and left the movie crying. \n\nPuss in Boots Last Wish we took the kids to. I havent* ever seen the other ones. That movie gutted me.\n13. Game Night is so effing good. Rachel McAdams is so underappreciated as a comedic actress. Her timing is incredible. \n\n## 7. What if Priyadarshan directs a fun filled comedy movie with these guys along with Basil. (from r/MalayalamCinema)\n\n**Score:** 191\n**URL:** https://i.redd.it/yw9u4xbnhkmf1.jpeg\n**Body:** With Lokah and Hridayapoorvam recieving good reports and comedy scenes that's working for audiences, it's clear that these guys can pull of comedy genre. Mathew maybe an exception 🥴\n\n### Top 14 comments and their replies (up to depth 25)\n\n1. A buddy road trip comedy with these guys would be fun!!\nMollywood seriously lacks road comedies.\n  - Yeah Falimy had some road trip elements which were fun\n  - True. It will be fun\n  - We need a road trip comedy drama film frrr\n2. dope could add thomas mathew or the antagonist of premalu\n3. Imagining \"In Harihar Nagar\"( directed by Siddique Lal) starring these 4.\n4. വേണ്ട പരിഗണയിൽ ഇടുക്കാം. ഇനി അടുത്ത വിഷയം പോരട്ടെ\n5. I am not sure. It would be tough for him to make a magic from new gen actors I feel. But I would love to see a road trip movie or bachelor vacation movie like Hangover. May be directed by jeethu madhavan or Girish A D.🔥🔥\n  - Agree! Just commented on another reply with Jithu as the next option.\n6. Horror comedy might be fun. Something like Go Goa Gone in Hindi\n7. Sadly Priyadarshan only cares about Akshay Kumar\n8. Priyan seems to be out of touch with comedy, even that comedy scene in Oppam worked bcz of nostalgia.\n  - If not Priyan then I think only Jithu Madhavan can pull off\n9. I don't think he can. For almost all his career in Malayalam film industry, he has stuck to a certain set of actors. Unfortunately almost all of them is no longer with us, so their is no point in expecting the priyadarshan magic of old.\n10. I dont think priyadarshan would be comfortable with the  type of comedy these 4 present. These people are gonna struggle with his vision.\n11. Basil could direct it, instead of priydarshan\n12. Yes!!!! Priyadarshan is master of comedy movies!\n13. Maybe without a romance track, like In Hari har nagar.\n\n## 8. Name an action movie that has a better plot, comedy, satire, suspense, cleverness... I'll wait (from r/moviecritic)\n\n**Score:** 87\n**URL:** https://i.redd.it/oietd7tedtlf1.jpeg\n**Body:** I am so amazed with this movie, after so many years it still holds up so well.. The fact that you can interpret it 2 different ways from the opening till the end is mind blowing, haven't seen anything like it\n\n### Top 15 comments and their replies (up to depth 25)\n\n1. Hahahahahahaha! Hahahahaha! You think this is the real Quaid!? It is!!!\n2. Starship Troopers comes to mind. Which is just more Paul Verhoeven...\n  - \"Would you like to know more?\"\n    - Are you doing your part?\n3. Goddamn yes. Total Recall, Robocop, Starship Troopers: the ultimate Verhoeven Trilogy.\n  - “SEE YOU AT THE PAHTEE RIKTUH!”\n4. Hot Fuzz\n5. In a certain sense there's nothing better than Total Recall.\n6. Fight Club\n7. Running man\n8. District 9\n9. Idk, True Lies is pretty strong in all those categories and has Arnie too.\n10. Robocop\n  - This would be the obvious answer and not surprising given it's the same director. But i agree. From a straight \"holy shit this is fun\" perspective Robocop &gt; Total Recall. Though Total Recall adds a very solid sci-fi element along with the \"was any of this real\" element.\n11. The Game \n\nI was just thinking about this movie too, cause of some other topics here just now\n  - Such an under rated film\n    - Good movie but I don’t see the comedy.\n12. The Princess Bride.\n13. Aliens\n14. \"...last action hero\" he said timidly not knowing the publics opinion on that film.\n\n## 9. Iconic lighthearted or comedy movies to show my wife (from r/movies)\n\n**Score:** 17\n**URL:** https://www.reddit.com/r/movies/comments/1n586sp/iconic_lighthearted_or_comedy_movies_to_show_my/\n**Body:** My partner is from east Asia and as a result hasnt seen a lot of the non-animated movies that most people have.\n\nI recently showed her Mean Girls and she LOVED IT.\n\nother movies we've watched that were a hit:\nMrs. Doubtfire\nDaddy Daycare\nParent Trap\nFreaky Friday\n\nIf people have suggestions for me to add to our watch list please let me know!\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. School of Rock\n  - Oh good one! Didn't even cross my mind\n2. I have a thing I do occasionally called the \"Blonde Triple Feature\". Clueless, Legally Blonde, and Romy and Michele's High School Reunion.\n\nedit to add: Also, The Birdcage. Not a part of the triple feature, just an iconic comedy.\n  - I was just going to suggest these. Especially Legally Blonde.\n3. Office Space, Weekend at Bernie's, Princess Bride, and Airplane!\n4. The Princess Bride and Robin Hood: Men in Tights.\n5. Clueless\n6. \"There's Something About Mary\"\n7. Wayne’s World.\n8. Back to the Future, all 3\n9. She’s the Man\n\nMy Big Fat Greek Wedding\n\n17 Again\n\nBring It On\n\nMiss Congeniality \n\nPitch Perfect\n10. Who's That Girl and That Thing You Do\n11. The Princess Bride\n\nFerris Bueller's Day Off\n\nThe Big Lebowski\n\nGroundhog Day\n\nSweet Home Alabama\n\nMrs. Doubtfire\n\n13 Going on 30\n\nRaising Arizona\n\nElf (Christmas movie)\n\nSpaceballs\n\nBig Business\n\nMen in Black (1 and 2)\n\nWitches of Eastwick\n\nThe Hangover\n\nLegally Blonde (1 and 2)\n\nBig\n\nKate and Leopold\n\nBend It Like Beckham\n\nBride and Prejudice\n12. Now and Then. The Beverly Hillbillies. Troop Beverly Hills. Overboard. Sister Act 1 &amp; 2. Empire Records.\n13. Forrest Gump if she has a decent understanding of 60s-90s America. \n14. - Nacho Libre\n- Barb &amp; Star Go to Vista del Mar \n- Due Date\n- They Came Together \n- Liar Liar\n- Ace Venura\n- The Lost City\n- Game Night\n  - Nacho Libre is such an underrated movie, and also surprisingly based on a [true story](https://en.m.wikipedia.org/wiki/Fray_Tormenta).\n15. Galaxy Quest \n\nPrincess Bride\n\nOlder films Topper  Bringing up Baby, Charade,\n16. Napoleon Dynamite so you can see how absurd you can get with it\n\nFor some adventure comedies Princess Bride and Stardust\n17. Clue!\n\n## 10. Can I request for underrated action movie/comedy? (from r/MovieSuggestions)\n\n**Score:** 14\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n5ob9x/can_i_request_for_underrated_action_moviecomedy/\n**Body:** Can you give some movie recommendations for a sci-fi,action/adventure movies or funny movies to watch? Got bored on some series and need refresher. Thank you !\n\n### Top 14 comments and their replies (up to depth 25)\n\n1. Guns Akimbo\n2. Don’t know that either are underrated, but if you haven’t seen either, you should- Big Trouble in Little China and The Adventures of Buckaroo Banzai Across the Eighth Dimension.\n  - Already watch big trouble in little china and its a good movie ! Anyways thank for recommending mate !  Ill try the other one\n3. Knight and Day with Tom Cruise and Cameron Diaz is considered to be a box office bomb but it's a fun movie\n  - Totally agree. The dialogue is pretty great in this movie too.\n4. The Other Guys, made by Adam McKay w/ Will Ferrell, Mark Wahlberg, Eva Mende.\n\ndidn’t do well at the time but it’s hilarious &amp; highly rated… Premise is that the actual action “heros”are indisposed so the “extras” are forced to take on the big bad\n  - Aim for the bushes\n5. Shoot Em Up\n6. Jackie Chan movies\n\nPolice Story 1-3\n\nWheels on Meals\n\nArmor of God\n\nOperation Condor\n\nRush Hour 1-3\n  - If you're gonna suggest Jackie Chan films you gotta put Drunken Master in there\n    - Yeah I haven’t seen that one in a while. I only saw it once. He made so many funny action movies it’s hard to remember. I know one of my favorites will always be Wheels on Meals. A quirky truck, Jackie Chan skateboarding, a beautiful woman, the villains are more skilled than the leads, a great car chase…\n7. Remo Williams: The Adventure Begins\n8. The Last Boy Scout (1991) or The Negotiator (1998) are good action movie watches.\n  - The Last Boy Scout has more funny oneliners than any other action movie. And then some. Love it.\n9. Bullet Train\n\nBoss Level\n\nHonor Among Thieves\n\nGalaxy Quest\n\nThe Fifth Element\n10. I suggest The Nice Guys\n  - yup, this is one of the most underrated. One of Blacks best and he has some greats\n11. Romancing the Stone\n\nKiss Kiss Bang Bang\n\nGame Night\n\nTremors\n\nThis is the End\n12. The Rundown\n13. Galaxy Quest!\n\n## 11. Which movie would be 10x better if it was turned into a comedy? (from r/Productivitycafe)\n\n**Score:** 3\n**URL:** https://www.reddit.com/r/Productivitycafe/comments/1n6axsw/which_movie_would_be_10x_better_if_it_was_turned/\n\n### Top 13 comments and their replies (up to depth 25)\n\n1. If you spot any brews (posts) that don't blend well with our menu (rules) or seem out of place in our cozy café (subreddit), kindly flag them for the baristas (moderators') attention. Please refrain from brewing any self-promotion in our café-themed posts. Let's keep our discussions rich and aromatic with genuine content! Thanks for helping keep our café ambiance perfect! \n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Productivitycafe) if you have any questions or concerns.*\n2. The Number 23 with Jim Carey\n3. Happy Gilmore 2\n4. Philidelphia\n  - ![gif](giphy|xUA7biZUmYM8oJBZPa)\n5. Oppenheimer\n  - I already watched it and honestly, it’s not just about the atomic bomb. For me, the movie was more about ambition, guilt, and the weight of responsibility. The way it showed how one man’s brilliance could change the world forever  but also destroy his own peace of mind was intense.\n  - “I am struggling with the guilt of developing the bomb. I th-“\n\n“THINK AGAIN EGGHEAD!”\n  - ![gif](giphy|2DBQmYHJUKIpi)\n6. Avatar.  It begs for it.\n7. Schindler's List\n  - \"Springtime for Hitler in Germany\"\n  - Nah. It's more of a makeout movie.\n8. Roots\n9. J. Edgar\n10. Sophie's Choice\n  - Eenie… meeny…\n11. Dumb &amp; Dumber\n12. Alien\n  - ![gif](giphy|hDFyKdd2XBqU)\n\n## 12. What's your favourite Arnold Schwarzenegger comedy or kid's movie? (from r/CasualConversation)\n\n**Score:** 22\n**URL:** https://www.reddit.com/r/CasualConversation/comments/1n2i5gk/whats_your_favourite_arnold_schwarzenegger_comedy/\n**Body:** What's your favourite Arnold Schwarzenegger comedy or kid's movie?\n\nMine is Kindergarten Cop.\n\n\"It's not a tumor!\"\n\nThe rest here is just to fill in so I don't get removed for not enough text. Meanwhile, tell us more about your favourite Arnie moments. \n\n Yay! It only took me three tries to get enough text in here!  lol\n\n### Top 17 comments and their replies (up to depth 25)\n\n1. True Lies. \n\n\nThat movie really is perfect on the action-comedy front. \n\n\nRIP Bill Paxton. \n2. Who is your daddy, and what does he do??\n3. Jingle all The Way for me followed by Last Action Hero.\n  - Seconding “Jingle All The Way”\n    - PUT THAT COOKIE DOWN. NOW!\n4. same - my daughter and I say \"it's not a tumor\" a lot\n\nWe come up with different versions of it.  In marvel comics the Submariner has an enemy named Attuma - so we will say \"It's not Attuma\" - any place we can fit \"It's not a....\" in we try\n5. I always have fun watching Jingle All The Way, though I understand why some people don't like that Arnie movie :-)\n6. Without a doubt, my favorite was Last Action Hero. It's a spoof of many action movies and is wonderfully tongue-in-cheek.\n7. Jingle All the Way.  Watch it every Christmas season\n8. Kindergarten Cop.\n  - “dey’re horrible !”\n9. Twins.\n10. Kindergarten Cop is probably #1, followed by Twins. Watched them again after a long time recently, still awesome and fun\n11. Kindergarten Cop by MILES!\n12. Last Action Hero my fave\n13. Last action hero\n\nWay ahead of its time. Perfect satire of 80s action and a banger of a soundtrack\n14. I have time a hard re-watch lately and I'm going with Last Action Hero or Kindergarten Cop\n15. Junior\n16. Kindergarten Cop\n\n## 13. Darren Aronofsky's 'Caught Stealing' Review Thread (from r/movies)\n\n**Score:** 1378\n**URL:** https://www.reddit.com/r/movies/comments/1n1l5m7/darren_aronofskys_caught_stealing_review_thread/\n**Body:** [Rotten Tomatoes](https://www.rottentomatoes.com/m/caught_stealing): 84% (from 67 reviews) with 6.70 average rating\n\n[Metacritic](https://www.metacritic.com/movie/caught-stealing/): 69/100 (19 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; Despite all the bloody violence, there is a buoyant feel to the film. Matthew Libatique, Aronofsky’s constant and brilliant cinematographer, makes the city glittery bright outside and the look is vibrant even in the dingy bar. Caught Stealing is an anomaly, a dark soap bubble of an entertainment. And that weirdness makes this unlikely film sparkle.\n\n-[Caryn James, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/caught-stealing-review-austin-butler-darren-aronofsky-1236353041/)\n\n&gt; Mostly, the tension between the film’s increasingly dark story and its love of rudimentary gags — wouldn’t it be so funny if this guy who mostly subsists on booze physically couldn’t drink anymore? — doesn’t abate until the film’s final act. That’s when things click into place, when the big swings come together, and “Caught Stealing” nearly finds its way to (insert your favorite positive baseball metaphor here). A wild card? Not wild enough, really.\n\n-[Kate Erbland, IndieWire](https://www.indiewire.com/criticism/movies/caught-stealing-review-darren-aronofsky-austin-butler-1235147500/): C+\n\n&gt; “Caught Stealing” might feel like a break from the “Pi” director’s intensely subjective character portraits, which range from “The Wrestler” to “The Whale,” but in fact, Aronofsky brings us as close to Hank as he has to any of his other characters. For Butler, it’s not as flashy a role as the ones he played in “Elvis” or “Dune,” and yet, seeing the actor stripped down to his heather gray undies, his stardom is all but undeniable.\n\n-[Peter Debruge, Variety](https://variety.com/2025/film/reviews/caught-stealing-review-austin-butler-1236496926/)\n\n&gt; At one stage, Hank hits a few balls and instantly a crowd of people gather round, awed – and an old-timer tells him he has “one hell of a swing”. The film has it too.\n\n-[Peter Bradshaw, The Guardian](https://www.theguardian.com/film/2025/aug/27/caught-stealing-review-darren-aronofsky-mother-the-whale-baseball): 4/5\n\n&gt; Some part of Aronofsky may want to evoke the darkly funny mishaps of a vintage crime comedy, but something else keeps coaxing him halfway down dark alleyways, before the movie scrambles back into more comic-adjacent urgency. It’s that run-and-stop-short rhythm that makes Caught Stealing feel more like a fraught, imperfect recovery than a Requiem-style spiral into hell, and an unusually balanced New York portrait. The city of Aronofsky’s early career is neither a paradise lost to gentrification nor a metropolis of the damned. It’s just a bustling microcosm of a pitiless world with plenty of places to hide.\n\n-[Jesse Hassenger, The A.V. Club](https://www.avclub.com/caught-stealing-review): B\n\n&gt; For as much good as there is in \"Caught Stealing,\" there's never that moment where it somehow rises from good to great — but hey, that's okay. It's just good and stays good until the credits roll, which is more than enough. Not every new movie needs to be an event. Sometimes, you just want to watch a handsome guy try to get out of trouble while taking care of an ornery, fluffy cat. We could use more modern movies like \"Caught Stealing.\" \n\n-[Ryan Scott, /Film](https://www.slashfilm.com/1944676/caught-stealing-austin-butler-movie-review/): 7.5/10\n\n&gt; The result is a movie that’s very fun, but weirdly unambitious for Aronofsky. If any up-and-coming director made this movie, it’d be seen as a promising breakthrough. For the guy known for Requiem for a Dream, Black Swan, Mother! and The Whale, it feels like he’s slumming a bit. In a way, though, it’s refreshing to see an Aronofsky movie that, for once, isn’t bursting with more ideas than it can reasonably contain. It would still be nice in this instance to have a thematic through-line that wasn’t just based in nostalgia for a bygone New York. It’s doubtful Caught Stealing will make the same impression its director’s other films have. Fortunately, though, its rewatchability factor is just as high.\n\n-[Abby Olcese, Paste](https://www.pastemagazine.com/movies/caught-stealing/caught-stealing-review-darren-aronofsky-austin-butler-matt-smith-crime-plot): 7.5/10\n\n&gt; As much as the film is Aronofsky’s least characteristic to date, with its Guy Ritchie-esque rogues gallery of crooks and killers and Coen-esque bursts of wry violence, it’s Butler’s performance that makes it feel of a piece with the director’s other work. There are few filmmakers more interested in putting their characters in a vice grip, so as to bring them someplace where their physical traumas become a way for them to know themselves beyond the limits of the body.\n\n-[Rocco T. Thompson, Slant](https://www.slantmagazine.com/film/caught-stealing-review-austin-butler-darren-aronofsky/): 2.5/4\n\n&gt; It’s thin material for such an impressive cast to be working with, and even Butler, who’s made all the right choices post-Elvis when it comes to compelling and varied work, can’t really imagine Hank beyond the mould of tender-hearted victim. He takes all the beatings – and there are a lot of them, which is where Aronofsky’s taste for the brutal slips in – with a noble tear in his eye, haunted as he is by a traumatic accident in his youth that put an end to his baseball career.\n\n-[Clarisse Loughrey, The Independent](https://www.the-independent.com/arts-entertainment/films/reviews/caught-stealing-review-austin-butler-b2814868.html): 2/5\n\n&gt; For the most part, Caught Stealing is a riotous, rollicking ride studded with New York’s concrete grit — but its sharper edges prove more difficult to endure.\n\n-[Ben Travis, Empire](https://www.empireonline.com/movies/reviews/caught-stealing/): 3/5\n\n____________________________________________________________________________________________\n\n**PLOT**\n\nHank Thompson was a high-school baseball phenom who can't play anymore, but everything else is going okay. He's got a great girl, tends bar at a New York dive, and his favorite team is making an underdog run at the pennant. When his punk-rock neighbor Russ asks him to take care of his cat for a few days, Hank suddenly finds himself caught in the middle of a motley crew of threatening gangsters.\n\n**DIRECTOR** \n\nDarren Aronofsky\n\n**WRITER**\n\nCharlie Huston (based on his novel)\n\n**MUSIC**\n\nRob Simonsen\n\n**CINEMATOGRAPHY**\n\nMatthew Libatique\n\n**EDITOR**\n\nAndrew Weisblum\n\n**RELEASE DATE** \n\nAugust 29, 2025\n\n**RUNTIME**\n\n107 minutes\n\n**STARRING**\n\n- Austin Butler as Henry \"Hank\" Thompson\n\n- Regina King as Detective Roman\n\n- Zoë Kravitz as Yvonne\n\n- Matt Smith as Russ\n\n- Liev Schreiber as Lipa\n\n- Vincent D'Onofrio as Shmully\n\n- Griffin Dunne as Paul\n\n- Benito A Martínez Ocasio as Colorado\n\n- Carol Kane as Bubbe\n\n### Top 12 comments and their replies (up to depth 25)\n\n1. I caught an early screening of this over the weekend and really enjoyed it. I feel like it's darker than the trailers imply, in a good way. Worth seeing in theaters for sure.\n  - 100%. We went to a preview too and my wife was shocked at how dark it was relative to the trailer. I’d read the book and expect dark from Aronofsky - so for me it was less dark than I expected.\n  - Considering it's setting in 1998 NYC, I hope it really captures the \"dirty\" vibe of action/thrillers set in the city around that time period (especially those that make the city itself feel like a character)\n    - Oh it definitely does this, in spades. You won't be disappointed about that aspect at all.\n2. Saw a sneak preview and had a very fun time\n\nIt’s a “more serious” version of Snatch/Bullet Train/Lock, Stock, and Two Smoking Barrels where a bunch of shady characters are involved in a mix-up. \n\nIt’s honestly the “funnest” film that Darren’s made if you ask me. Seems like everyone was having a good time with this. \n  - No way it’s any funner than requiem\n  - I liked it, but I also felt like Aronofsky doesn’t have a sense of humor. Because the film was way quirkier and funnier than he wanted to go. It was at its best when it was goofy. But you could feel Aronofsky’s seriousness trying to fight through the screwball humor.\n3. The book was recommended to me on this sub when the first images were released and it was a really fun ride. It looks like they only changed some small bits for film, otherwise it’s all here. I’m excited to see it this weekend.\n  - Ya the reviews seem to mention that it’s dark with sudden funny gags and that is exactly how the book reads. In the second book &gt;!in a very tense chase Hank gets clotheslined by a literal clothesline and it is very funny but the chase still had a very gristly end that kept the tone bleak!&lt;\n4. It was a fun movie. Wild, frenetic, and darkly funny at times. I really loved most of the performances too. Not Aronofsky’s very best but well worth the price of the ticket. \n5. This is the most not Aronofsky movie ever and I'm so ready for it. It looks incredible.\n\n\n30 years making movies and he's still has something new to show, what a director.\n  - I haven't seen it yet, but it feels like Aronofsky tried to make an Edgar Wright-type of film.\n\nEdit: I'll just mention Guy Ritchie here too, both because I agree and like 4 replies have already pointed it out.\n    - I did, and it’s kind of like that, but it’s more of “Snatch” where a bunch of people are involved and searching for an item.\n\nIt’s a really fun time, and definitely the most un-Aronofsky film I’ve seen from him \n6. Darren Aronofsky better give that review thread back. Stealing it isn't cool.\n7. I saw it. Solid but not as good as the movies it is emulating.\n\nOne key difference is Caught Stealing is not an ensemble. Having the protagonist in every scene makes it harder to have the same pace and gag opportunities.\n\nOn the plus side, Butler has to carry the movie for this reason and rises to the occasion. Aronofsky, as always, is great at getting performances out of people.\n8. I really liked it. Felt like a weaker Coen Brother’s esque picture (which is still great). Was reminiscent a touch of After Hours by Scorsese in that it has that seedy, mad, old school New York vibe. Austin Butler reminds me of a young Brad Pitt, the blokes just a bonafide movie star. Fantastic cast all round\n9. A lot of people really seem to think Guy Ritchie invented a genre.\n10. Can anyone confirm how big of a role action bronson has in the movie?\n  - He has multiple short scenes throughout, not just a random cameo but actual character who is also part of a plot point\n11. seeing all the early reviews, seems like I’m much higher on it than most. I thought it was one of the best movies I’ve seen this year (watched like 50 so far)\n\n## 14. The Death of Stalin (from r/movies)\n\n**Score:** 1301\n**URL:** https://www.reddit.com/r/movies/comments/1n44xea/the_death_of_stalin/\n**Body:** Last night I discovered that The Death of Stalin is on Tubi, so I finally had the chance to watch a movie that I'd heard good things about. My thoughts: what a bizarre, unique, gem of a movie. Hard to even categorize. Yes it's a comedy, but only because it accurately reflects the absurdity of Stalinist politics. It manages to be over the top while staying basically true to history. The chaos, performative grief, scheming, and backstabbing following Stalin's death is played perfectly by a cast of heavy-hitters who make it all the more farcical by playing it straight. Overall, I really liked this movie, but it's probably not for everyone. Thoughts?\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. The amount of times I go back and watch this movie... its so perfect. All of the gang coming to see Stalin the next morning when he is dying... Everything Jason Issacs says or does as [Zhukov](https://en.wikipedia.org/wiki/Georgy_Zhukov),, Everything Rupert Friend does as Vasily, the funeral movements. Michael Palin saying \"Stalin would have loved this\" multiple times during some horrific thing.   Its so funny and only gets better.\n  - My favorite thing about this movie is every time I watch it I find an interesting one off line or action that a character does and I simply *must* look it up to see if it really happened. An *astonishing* amount of this movie is based on real things that happened and every time I think something might be an exaggeration, im proven dead wrong. Most recently, I was curious about the [plane crash](https://en.m.wikipedia.org/wiki/1950_Sverdlovsk_plane_crash) that Vasily was trying to cover up that killed the entire Soviet ice hockey team and that just... fucking happened lmao.\n    - In some cases they toned things down (like the number of medals Zhukov wore) because the reality seemed _too_ silly.\n      - Jason Isaacs apparently wore a pillow under the uniform to make his chest appear broader and make room for the medals and they still couldn’t fit them all. Zhukov was both ridiculously broad and had an absurd amount of medals. \n\nZhukov also really loved Pepsi, being introduced to it during the war. But the leader of the red army couldn’t be seen drinking a western drink, so Pepsi formulated a version that was clear just for him and packaged it in vodka bottles. The leader of the red army being an extreme alcoholic was apparently a better look.\n    - Or that they killed all the decent doctors in The Doctors Plot. So they could only find a decrepid one for Stalin\n      - \"You're not even a person! *You're* mostly hair!\"\n  - Vasily breaking into Stalin's autopsy and firing a gun into the air. Everyone standing around awkwardly as someone wrestles the gun out of his hand. \"Now, let that be a lesson to you all.\"\n2. I watched it once because someone said it was good. \n\nI watched it the next 20 times because Jason Isaacs.\n  - The slow mo shot when he takes off his coat and the chyron appears is #absolutecinema\n3. Passed uuuuuuuuuuu....nanimously\n4. Also came here to note Isaac’s appearance as Zhukov put this movie into 6th gear. Buschemi as Khrushchev made no sense, and all the sense. One of the better firms I’ve seen in the last 5 years\n  - The absurdity of Buscemi playing Kruschev was brilliant.\n    - I 100% agree. The way he would also be the clearest sanest voice in the entire film was very well done.\n  - Jason Isaacs and Andrea Riseborough did an interview together, and it made me appreciate his Zhukov all the more\n\n\nAndrea Riseborough talked about all the research she did into Svetlana Stalin, and how she tried her best to copy Svetlana's characterisms and personality\n\n\nWhen discussing Zhukov, Jason Isaacs said something like, \"I just decided to play a massive swiggering dick\"\n\nPlus, the Yorkshire accent is just the fuckin cherry on top lol\n5. One of my favorite movies. Hilarious and full of deep meaning at the same time. Amazing performances from the whole cast.\n\nI'm in, I'm in. That fucker thinks he can take on the Red Army? I fucked Germany, I think I can take a flesh lump in a fucking waistcoat.\n\nKhrushchev: I really need your help.\n\nZhukov: To do what? There's bodies fucking piling up in the street, it's a bit late, isn't it?\n\nKhrushchev: What if we blame this on someone...\n\nZhukov: Wait...\n\nKhrushchev: Who's out of control?\n\n Zhukov: Nicky, be very careful what you say next. Who?\n\n Khrushchev: Beria.\n\nZhukov: I'm going to have to report this conversation. Threatening to do harm or obstruct any member of the Presidium in the process of...\n\n\\[grins\\]\n\nZhukov: Look at your fucking face!\n\n\\[bursts out laughing\\]\n6. \" Overall, I really liked this movie, but it's probably not for everyone. \"\n\nI loved it, I can imagine the gallows humour not being to everyone's taste, but it wasn't trying to appeal to everyone.\n\nIsaacs as Zhukov stole the show, and that's saying something in a comedy up against Palin, Whitehouse, Tambor and Buscemi.\n  - I loved the fact that they had to *reduce* the number of medals on movie-Zhukov’s tunic - because the real number would have looked absurdly unrealistic!\n7. The concept is crazy: adaptation of a French bande dessinée retelling the death of Stalin... by the British creator of The Thick of It.   \nAnd yet, it's perfect. Insane casting, incredibly funny. \n\nIt's so quotable it's unreal: \"The army's back, did you miss us?”\n  - \"I'm gonna go represent the entire red army at the buffet\"\n    - “You should have seen your face!”\n\n## 15. Comedy Movie Discussion (from r/movies)\n\n**Score:** 3\n**URL:** https://www.reddit.com/r/movies/comments/1n63vq2/comedy_movie_discussion/\n**Body:** What oddly specific **type** of comedy movie scene gets you laughing really hard? For me it's when a vehicle loses control, putting them in a frightening situation where they have to dodge obstacles and try to get the vehicle to a halt. Off the top of my head, there's only two comedy movies I can think of that feature that, but they're both funny as hell.\n\nScene 1: *The Little Rascals Save The Day.* In this movie, the brakes fail on their homemade taxi cab and they go rolling down the road screaming.\n\nScene 2: *Mr Lampoon's Christmas Vacation.* I'm not entirely sure if this is the movie but I think it is. In this one, Mr Lampoon goes sledding on a trash can lid and something makes it slippery, making him go way further than expected.\n\nSo that's my take. What oddly specific type of comedy scene do you find really funny? Add an example of it if you can.\n\n### Top 13 comments and their replies (up to depth 25)\n\n1. I could barely breathe I was laughing so hard, when Jim Carrey is trying to get out of the rhino in Ace Ventura: When Nature Calls.\n2. The greatest set piece in comedic movie history: \n\nLlyod and Harry driving through the Rockies &gt; Harry standing around the barrel fire complaining that his hands are freezing &gt; Lloyd telling him he can use his extra set of gloves &gt; Harry attacking Llyod for keeping the gloves to himself throughout their drive &gt; Llyod screaming at Harry because of his hands are cold.\n  - Omg, that sounds fucking hilarious. What movie is that? I gotta watch that ASAP!\n    - Dumb and Dumber.\n  - A couple months ago I was at a \"brand meeting\" for the Marriot property I work for and at one point they put up a slide show with a collage of pictures with brands that you know by just looking at them. Tesla, Gucci, Starbucks, etc, you get the picture (pun intended). One person asks what the picture of the luggage was and presenter says \"Samsonite.\" To which I boisterously reply without skipping a beat, \"SAMSONITE!!? I WAS WAY OFF!!!\"... no one laughed, no one got it, I stood up and left the meeting. As I walked out, a guy from another group across the hall, alledgedly coming from the bathroom, was laughing his ass off, looked at me and said \"Samsonite?!!?\" We now drink at the same bar on Thursdays.\n3. The Naked Gun (1988) has a great chase scene like that\n4. Another one for you is rat race\n\n\n&gt;!You should have bought a squirrel!!&lt;\n  - It’s a race! I hope I win. \n\nI’m getting goosepimples\n5. The bribery scene in \"The Other Guys\" is one of my all-time favorite gags.\n6. It took me years to notice but I call it **grinding to a halt**.   This is when the story is moving along and all of a sudden nothing is happening.  It's usually a dialog exchange that serves almost no point.\n\nMONTY PYTHON AND THE HOLY GRAIL -- When King Arthur wants to ask an 'old woman' in the field who lives in nearby castles, and the man he is talking to explains he's a man, not a woman, and 37, not old.  It's the type of thing that would be cut from any other movie but is hilarious here.\n\nAUSTIN POWERS -- like Python, Myers does this all the time.  In the first feature he's having trouble turning a cart around in a too narrow passageway.   In the sequel, Dr. Evil stops a meeting to accuse Scotty of not liking chocolate, which absolutely positively doesn't contribute to the plot in any way.\n  - Similarly, when Zoot/Dingo/Carol Cleveland stops the scene, turns to the camera and asks if we think this scene should have been cut and other characters from other parts of the movie join in. \n\nAt least ours was committed and wasn’t just a string of pussy jokes.\n\nThere’s a moment in the television show, during the Dead Parrot Sketch, when Mr. Praline arrives at ‘Similar Pet Shops Inc.’ and then holds the birdcage up to the camera with an exasperated look on his face - it’s the same set as the first pet shop and the cage is still where he left it. And behind the counter, the shopkeeper is scrambling to put on a fake moustache.\n7. ivebeenthrushit, if you haven't yet watched Bob Zemeckis' rollicking comedy **Used Cars**, *do.*\n8. The scene in Anchorman 2, when the guys are driving in the RV has me laughing out loud!\n  - Hey Ron, why do you have this bag of bowling balls and this terrarium full of scorpions???\n9. Channing Tatum's accent in Deadpool 3 (and pretty much the whole movie for that matter)\n  - The fight in the mini van where they keep kicking the stereo and then, for a split second, it plays \"The Greatest Show\" and I ERUPTED in my seat for significantly longer than I should have. That movie was like 98% Easter eggs.\n10. Robert Downey Jr in Due Date. Looks right at the Dog and says ,\" You fat little piece of shit,\" then spits in the dog's face. Shocking ,but my god did I laugh.\n11. There is such a scene in National Lampoons Vacation where Clark falls asleep at the wheel.\n12. All of the performances by clearly non-actors in The Greasy Strangler. The hot dog salesman had me crying laughing. Mindboggling line delivery.\n\n---\n\n"}