{
    "ranked_movies": [
        {
            "rank": 1,
            "title": "The Thing",
            "reason": "Frequently cited as a masterpiece of practical effects and paranoia, with multiple users praising its enduring quality and status as a top-tier horror film."
        },
        {
            "rank": 2,
            "title": "Alien",
            "reason": "Hailed for its franchise longevity, quality, and being an untouchable sci-fi horror classic."
        },
        {
            "rank": 3,
            "title": "Jaws",
            "reason": "Described as a foundational and influential horror film, with a recent 50th-anniversary re-release highlighting its lasting impact."
        },
        {
            "rank": 4,
            "title": "Halloween",
            "reason": "The original film is noted for its cultural impact and is mentioned as a cozy, rewatchable classic."
        },
        {
            "rank": 5,
            "title": "Hereditary",
            "reason": "Discussed as a prime example of horror used as a lens for deeper storytelling, specifically about generational trauma."
        },
        {
            "rank": 6,
            "title": "The Shining",
            "reason": "Praised as a complex work of art from a great filmmaker, disturbing on multiple levels."
        },
        {
            "rank": 7,
            "title": "The Cabin in the Woods",
            "reason": "Recommended multiple times as a fun, meta-horror comedy that is engaging and hilarious."
        },
        {
            "rank": 8,
            "title": "Scream",
            "reason": "Listed as a top cozy horror movie and a fun, rewatchable slasher classic."
        },
        {
            "rank": 9,
            "title": "Get Out",
            "reason": "Mentioned in the allegory discussion, recognized for its social commentary within the horror genre."
        },
        {
            "rank": 10,
            "title": "Rosemary's Baby",
            "reason": "Brought up for its despicable villain, Guy Woodhouse, and its status as a classic psychological horror."
        },
        {
            "rank": 11,
            "title": "The Exorcist",
            "reason": "Cited as a genre-defining classic that is scary without relying heavily on gore."
        },
        {
            "rank": 12,
            "title": "Tremors",
            "reason": "Frequently mentioned as a fun, cozy, and comforting horror-comedy."
        },
        {
            "rank": 13,
            "title": "The Mist",
            "reason": "Noted for its intensely hated character, Mrs. Carmody, making it a memorable viewing experience."
        },
        {
            "rank": 14,
            "title": "Psycho",
            "reason": "The original film is referenced in a post about Anthony Perkins' iconic performance."
        },
        {
            "rank": 15,
            "title": "An American Werewolf in London",
            "reason": "Praised for its special effects, humor, and status as a cozy, classic horror film."
        },
        {
            "rank": 16,
            "title": "Event Horizon",
            "reason": "Listed as a personal favorite by several users for its sci-fi horror elements."
        },
        {
            "rank": 17,
            "title": "It Follows",
            "reason": "Described as having a uniquely unsettling, nightmarish atmosphere that creates lasting fear."
        },
        {
            "rank": 18,
            "title": "Ready or Not",
            "reason": "Highly recommended as a fun, thrilling, and blast of a horror-comedy."
        },
        {
            "rank": 19,
            "title": "The Babysitter",
            "reason": "Suggested as a fun horror comedy, with its sequel also being well-regarded."
        },
        {
            "rank": 20,
            "title": "Tucker & Dale vs Evil",
            "reason": "Recommended multiple times as a hilarious and fun horror-comedy staple."
        }
    ]
}