{"content": "## 1. Leigh Whannel responds to claims that 'Sinners' isn't a horror movie on Bluesky. (from r/horror)\n\n**Score:** 2595\n**URL:** https://bsky.app/profile/conanthecontrarian.bsky.social/post/3lxdqu3pvq22o\n**Body:** Reposting with more clarity and context for those that were confused. The original post on Bluesky read:\n\n&gt;The reason Sinners is so good is that it's not a horror movie. It is a film about the Black experience, and the immigrant experience in America. It tells the story of marginalized peoples and uses vampires as allegory to tell that story. It is SO much more than a \"vampire movie.\"\n\nLeigh's response:\n\n&gt;Doesn't matter how many great horror movies get made, doesn't matter how many times they've saved the theatrical movie business since Covid... the genre still can't get any respect. The \"it's not a horror movie\" crowd is always there. This includes filmmakers who can't admit they made a horror\nmovie.\n\n### Top 9 comments and their replies (up to depth 25)\n\n1. This isn't even some new concept. Horror has been used as allegory for literally centuries now. You can trace all of it back to ancient mythologies, cultural traditions, and religious doctrines.\n  - Frankly, it's hard for horror not to be allegorical. \n\nIt's based in fear and dread and so much of that draws from how we interact with society.\n\nLike, I bet they think Dracula is just a monster who drinks blood, and isn't about scary foreigners, the fall of tradition, and the growing prominence of female sexuality. Or Frankestein being a scary monster, rather than musings on what it means to be human and what narrow definitions of humanity fail to capture.\n  - What's a film like Candyman if not an allegory? What's almost any horror if not an allegory for *something*? Horror is almost never just about what it's about. \n\nUsing vampires to as the inroad to tell a story about the black experience is about as horror as it gets\n2. Somehow you can make a film about a vampire hivemind tearing people to shreds and you'll **still** have folks going \"yeah, but that's not a horror movie\"\n\nLike I get the message the original post is trying to convey, but the movie can absolutely be both a portrayal of black experience during Jim Crow **AND** a banger action horror. No one ever said you have to choose one\n  - Ari Aster said something in an interview that really stuck with me about hereditary. I’m going to paraphrase here, but the general idea was this.\n\nHorror is a genre, just like any other genre, and a genre is a lens that we choose to tell our stories. If a director has something they want to say, a story they want to convey, you can tell similar stories using multiple types of lenses. What separates good horror from mediocre horror is when the story is “hey, I’m a horror movie” that’s usually not going to feel very compelling, vs, “the horror movie is a lens for this story I am telling”\n\nNow, to apply that to this topic, I think a lot of people get confused for some reason when a director tells a REALLY good story using the horror lens. Suddenly they say “well that’s not horror, it’s this type of story” but the fact is that it’s both. \n\nSinners is so obviously using a horror lens, to tell a compelling story. That makes it a horror movie.\n    - What would you say are examples of \"Hey, I'm a horror movie\" movies? \n\nFor some reason, (though I do like them) the Friday the 13th movies were the first that came to my mind lol\n  - Are you telling me that art can be multiple things at once?\n\n![gif](giphy|gBpY4p7bbhsiI)\n\n/s\n  - Portraying the Black experience in Jim Crow America IS a horror movie, no matter the genre.\n3. He's so right. I get so sick of the genre getting downplayed or erased because people like something in it, but are too stuck up to admit they like horror. That always seems to be what it boils down to. Or people just trying to sound more \"in the know\" than they are, and they come off as elitist and pretensious. Just let the movie be what it is: a horror story about the realities of being black AND an immigrant in this country.\n  - Thank you! I feel like a lot of people still look down on horror. This is like when things were “elevated horror“ all of a sudden. Nope you snobs don’t get to reclassify something just because you can’t admit that you like horror.\n4. This is how we got the term “elevated horror”\n\nFuck anyone actually using it\n5. Why can't these snobs just admit they liked a horror movie?\n  - Because just like animation, the snobs dont consider it \"art\". Which is ironic, because a lot of big name actors, like Johnny Depp, George Clooney, Hilary Swank, Leonardo DiCaprio, and more, have either started in horror or played a significant role in a horror movie.\n    - Where would Jennifer Aniston be without Leprechaun?\n6. Using vampires or other monsters as an allegory for a human experience is exactly what horror movies do. That’s what makes horror great, it’s a vehicle for telling a story about the human condition. Dude basically said it’s not a horror movie and then described it as exactly what a horror movie is.\n7. “Hereditary isn’t a horror movie you guys, its just about generational trauma and the fear of following your parents abusive footsteps and how horrifying that is”\n8. And Get Out is a dark comedy, Weapons is a mystery, 28 Years Later is a sci-fi allegory, Silence of the Lambs is a police procedural, etc., etc., etc.  You're correct.\n  - The Thing is about Christmas with the boys and the cool dog they found outside\n  - I have a friend who tried to tell me 28 days later is a drama not horror…..and yes the original one not the new one\n    - It's weird but I think some people only deem something a horror movie if it scares them. If they don't get scared then it must not be a horror. It's stupid and they're incorrect but I genuinely think that's the reason for these insane takes\n\n## 2. Who is the most despicable person in any horror movie? (from r/horror)\n\n**Score:** 1270\n**URL:** https://www.reddit.com/r/horror/comments/1n1u4bc/who_is_the_most_despicable_person_in_any_horror/\n**Body:** I nominate Guy Woodhouse , Rosemary's husband in Rosemary's baby. \n\nConceited and Vain, Guy let's the Devil rape his wife and carry the antichrist to term, all for a career boost. Like he probably could have asked for anything.. but apparently a few decent acting parts was enough to convince him\n\nJohn Cassavetes was so incredibly well cast in the role. His every very smirk and smile has that little flicker of malice and self-loathing In it..  so oily.  You could always tell that he knew more about what was happening to Rosemary than he let on. What gets me so much about him is how incredibly relatable his moral failings are as he reflects what so many people are willing to do  to stay in the good graces of power, and what they're willing to sacrifice for a miniscule advantage\n\nWe see these people parade across the stage all day and there's nothing we can do to stop them.\n\n### Top 16 comments and their replies (up to depth 25)\n\n1. All the little cunts in Eden lake.\n2. Marcia gay hardens character in The Mist (I forgot her name). I’ve never been so happy to see someone die.\n  - Mrs. Carmody. Marcia always delivers.\n3. The old man in Barbarian\n  - Frank got too easy of a death. It would've been ideal if he got torn apart by the Mother\n    - She was scared of him, she backed away from his room\n  - Pretty upsetting that he’s loosely based on a real person. Josef Fritzel, if you want to google it, but it’s pretty freaking horrifying.\n\nThat movie’s great though, I just rewatched it for like the 3rd time\n4. The grandma from Hereditary has got to be up there. Offers her entire bloodline up for sacrifice to a demon in the hopes of riches.\n5. First thought was the religious fanatic from The Mist, Mrs. Carmody. She really got in my nerves in the movie adaptation.\n6. The guy from human centipede 2.\n7. The guys in funny games\n8. I don’t know if I’ve hated a character more than Sally Hawkins in Bring Her Back\n9. The fuckin' aunt from The Girl Next Door. I have watched hundreds of horror movies in my life. I have never hated a character more in all of fiction, and knowing she was based on a real person just made it worse. Watched that movie once -- got it for like 2 bucks from an HMV on a whim while I was buying a bunch of other movies and CDs -- and could never bring myself to watch it again.\n  - That's definitely one you don't want to accidentally watch when you were expecting a lighthearted comedy starring Elisha Cuthbert.\n10. Vidal in Pan's Labyrinth.\n\nI know he's everything you're supposed to hate about fascism and tyranny embodied in a single person but del Toro did an amazing job of making me almost palpably despise a fictional character.\n11. The organization or cult or whatever they are in Martyrs. They're all terrible\n12. That fucking bitch Bev in Midnight Mass.\n13. The soldiers in 28 Days Later were planning on raping an underage girl.\n14. Chris in Carrie. Carrie’s mom is also a vile monster but also clearly has severe mental issues and trauma which likely warped her view on people and her daughter. Chris was just a sociopath who found joy in tormenting Carrie for no reason other than for her own joy and power.\n15. bev's dad in IT\n\n## 3. Horror Movie Basement (from r/miniatures)\n\n**Score:** 2702\n**URL:** https://www.reddit.com/gallery/1n3i8cj\n**Body:** Worked on this on and off most of the summer. The majority is painted/upholstered cardboard (rental shelves, purple chair and pizza box) paper (soda cans, chips, VHS/DVD covers and plants) or polymer (pizza slices, popcorn and tapes inside the VHS covers). The floor is stained coffee stirrers and pillow and clothes are from scrap fabric. \n\nTv is from Grime City. MK2 cabinet is a kit I customized, blue and white sofa, washer/dryer and detergents, brick wallpaper/ceiling paper, rug, NES, gameboy, and stained glass lamp from Miniature Crush. I’m so pleased with how it turned out!\n\n### Top 15 comments and their replies (up to depth 25)\n\n1. I didn’t realise this was the miniatures community and thought it’s ur actual basement and took inspo SS ITS AMAZING ID LOVE TO ACTUALLY Be TGERE WIW . HATS OFF TO UR TALENTS\n  - I also thought, \"damn fine basement setup! I had that same road rug!!!\n\n\nLooks so fucking real!\n\n\nDo you sell these or something?\n    - Honestly OP could start a business. This is the coolest thing I’ve seen today and I’ll be using this miniature as a blue print for my future basement haha.\n  - Thank you so much!\n2. This came out amazing.  All the little details and references really make it while not looking cartoonish or too much like a silly \"themed\" space.  It really looks like a lived in area that would've blown my mind in the 90s and still blow me away now.  Love the resourcefulness of the floors, they look fantastic and like a lot of parquet flooring I've seen in friends' basements as a kid.  The lamp choices are great and it's such a great little diorama.\n  - Thank you, the little details were the most fun parts! I was definitely going for 80’s/90’s vibes\n3. 10 out of 10. Would hang out here.\n4. Full of nice lil details. Nice job!\n  - Thanks!\n5. Incredible work! My favorite part (besides your great taste and craftsmanship, of course) is the casual disarray that makes it look lived in. It is SO convincing.\n6. Sincerely thought this was a real basement until I scrolled. This rules and I would spend so much time here!\n7. i’m obsessed\n8. Winner of the week right here!! \n9. Incredible!!! How did you do the popcorn? How did you do EVERYTHING!! Do you have a blog or something?\n  - I don’t have a blog or anything, this is mostly just for my own fun. For the popcorn I stuck a smaller ball of clay onto a slightly larger one and pinched the small one with tweezers, then painted the bottoms after I baked them.\n10. OMG, I love this so much. The little Gameboy is so cool too.\n11. SO DETAILED!\n12. It's awesome !!! congrats !\n13. Did you DIY or were some items store-bought? \nI'm amazed at your creativity and detail. Love it!!\n14. I love the little popcorns! So cute!\n\n## 4. I'm looking for a FUN horror movie to watch tonight. Doesn't have to be great, but at least fun &amp; thrilling (from r/horror)\n\n**Score:** 329\n**URL:** https://www.reddit.com/r/horror/comments/1n1q240/im_looking_for_a_fun_horror_movie_to_watch/\n**Body:** I'm thinking of something a long the lines of Halloween 2018 &amp; Halloween Kills \n\nOther movies that fall into this category could be the newer Scream movies, along with Heart Eyes, Thanksgiving, and Until Dawn (which I didn't love but liked the \"fun\" aspect about it \n\nIt doesn't have to be a slasher either, even though I just listed a whole bunch of slashers \n\nI'm just looking for something FUN, and engaging from start to finish. Something that's fun to watch with friends while drunk (which I am right now) \n\nThanks for any suggestions!!\n\nEdit: I've already seen Tucker &amp; Dale VS Evil! Great movie \n\n### Top 14 comments and their replies (up to depth 25)\n\n1. Happy Death Day is good!\n  - Both 1 and 2 are utterly fantastic. They're just absolutely tremendous movies, period.\n2. Ready or Not, The Cabin in the Woods, Nobody Sleeps in the Woods Tonight, Bodies Bodies Bodies, The Monkey, Nope, Upgrade. \n\nTbf, a few of those only have elements of horror. But Ready or Not is a fucking blast. And I adore Upgrade for its sci-fi/action-y horror vibe. But it’s very different from the others. Still absolutely worth a watch.\n  - Ready or Not is fantastic!\n3. The Babysitter.  The Babysitter 2 is even better.  Im also watching The Monkey right now and it's cursed-object+Final Destination in a fun and comedic way.\n  - The Monkey is so stupid but just so much fun.\n  - my favorite thing in those movies is that one jock dude who is so genuinely thrilled for the kid fucking them up\n4. The Cabin in the Woods\n  - I never thought I could laugh so hard at a simple 'ding' sound effect. When you hear it, you'll know.\n5. I thought Barbarian was a blast, especially the last act.\n\nA lesser known one is Anything for Jackson. Definitely has some heavy scenes but it’s so unhinged that you’ll probably have a good time. Some real “what the fuck” moments in that one.\n6. Return of the Living Dead\n  - Send... more... paramedics...\n7. Final Destination: Bloodlines \n8. Late Night with the Devil is what I would consider a very fun horror movie. The late night show vibes are excellent, and all the actors are giving it 100%. It jumps into the premise quickly, and it didn't feel like it overstayed it's welcome!\n9. DEADSTREAM!!!\n10. Haunt is so fun and the movie takes place during Halloween\n11. Tucker &amp; Dale vs. Evil\n  - ![gif](giphy|8jt53DWrQbJMA|downsized)\n12. Malignant - just don’t read anything about it.\n13. Housebound\n\n## 5. A colorized image of actor Anthony Perkins as Norman Bates in the classic 1960 horror movie, “Psycho”. (from r/fakehistoryporn)\n\n**Score:** 974\n**URL:** https://i.redd.it/ujm0apc4cvlf1.jpeg\n\n### Top 16 comments and their replies (up to depth 25)\n\n1. There is no way that Charlie Kirk is an actual human being, I mean come on...\n  - He's like one of Dall-Es creations from their beta testing days.\n  - Yeah I totally think the people that believe in reptoids are Nutters but f***, seeing people like Kirk make me wonder if I'm wrong.\n\nI know everybody has Asymmetry to their face but I don't see any kind of symmetry in his. Upper jaw width doesn't match teeth or lips. It's like somebody took two large bolts and put them under his skin for his cheekbones. My theory is he's been punched quite a few times and those are dents. Everyone has slightly uneven eyes but holy s***. I know this is a picture of him when he was much younger, but man he's already got those fake smile dead eyes too.\n2. Fuck that's creepy.\n3. He’s got tic tac teeth.\n  - ...got dolphin teeth.\n    - When he busts, he actually makes sounds like a dolphin, too. \n\nHe can't control it.\n\nA Walmart change room attendee lost hearing in her left ear because of it, I've heard.\n4. Is that a real picture unedited????\n\nChrist almighty I hope not\n  - Believe it or not yes. Conservative political commentator, Charlie Kirk. 🤢🤮😆\n5. I did not know he looked like that and now that I do it's the funniest thing ever.\n\nHe got uppercase gums and lowercase teeth.\n6. That is the grossest smile\n7. scrub the gums with sandpaper toothbrush\n8. Take that title back!! Mr Perkins is just a great actor who can play a psycho really well.\n9. A real psycho.\n10. God he looks like a LaBuBu that was microwaved on the defrost setting\n11. Does that set of jaws extend and widen while another set takes its place? Just wondering.\n12. It's only gums.\n13. The Incelerator\n14. This is who chuds look up to.\n15. People with tall gums never warn you before they smile and show you the second story of their townhouse mouth\n\n## 6. Favorite cozy horror movie? (from r/horror)\n\n**Score:** 258\n**URL:** https://www.reddit.com/r/horror/comments/1n3j9o9/favorite_cozy_horror_movie/\n**Body:** What are the horror movies that you’ve just seen so many times that they’ve become cozy to you. Something you can turn on, not because you want to be scared but just because you want a fun, comforting experience? My top picks would probably be Scream (1996) and American Werewolf in London (1981).\n\n\n### Top 19 comments and their replies (up to depth 25)\n\n1. The Thing and Jaws are both up there for me\n  - One for the summer, one for the winter!\n2. Tremors and Silver Bullet\n3. Silence of the lambs\n4. The Shining\n5. Misery\n6. Halloween.\n  - This, yes, but on AMC with commercials for maximum cozy. Halloween 4 or 5 on TV are also cozy as hell.\n7. Tremors and Lost Boys\n\n![gif](giphy|l41JKgW7xQ9T2bA9q)\n8. It Follows is peak comfy\n9. Scream, easily.\n10. The Thing.\nAliens.\nEvent Horizon. \nThe Blob remake.\n11. The Thing. Before everything kicks off. It’s a bunch of guys enjoying Stevie Wonder, playing games, smoking a bit of pot and enjoying a spot of flame throwing haha\n12. Sleepy Hallow\n13. The Gate\n14. The Conjuring, Tremors\n15. 1408 for me! Also Dawn of the Dead (2004)\n16. The cabin in the woods. And any Stephen king mini series. A lot of which are free on YouTube\n17. This list is the best thing that’s happened to me this month\n18. Creepshow\n\nThe Lost Boys\n\nShaun of the Dead\n\n## 7. Girl scratches her back and it looks like a horror movie (from r/SmilesDaily)\n\n**Score:** 830\n**URL:** https://i.redd.it/7i5e7bn7rolf1.png\n\n### Top 20 comments and their replies (up to depth 25)\n\n1. Thing got extended\n2. hahaha hilarious and creepy\n3. What’s wrong with her arm and hand?\n4. The hand coming from that old man butt\n5. I’m more worried about that guy’s bloody shirt.\n6. I can do this too, but i also found out a week ago that i have hyperflexability(?) in my elbows lol\n7. I can do the same\n8. I can do that too. But then the scapula shape comes out on that side. So that's not her hand.\n9. It’s great to have that kind of dexterity for when you need to scratch your ass.\n10. Oh i can do that too\n11. I can do that, but I don't know if it really looks like that, since I obviously can't see myself in third person from behind. It looks very strange 😳\n12. AI is annoying\n13. Not her hand. Her thumb would be pointing the other way and palm would be out.  Try it.\n14. Is it even possible\n15. Wow, that’s creepy as heck\n16. Lol tht looks like a man hand\n17. Wednesday Adams with thing 😂\n18. SCP-(some_number) The scratchy chair\n19. I can do that, but only with my left arm. The right one doesn't have near as much range of motion for some reason.\n20. OP:\n\n![gif](giphy|wrmVCNbpOyqgJ9zQTn)\n\n## 8. Ever regretted watching a horror movie (from r/horror)\n\n**Score:** 114\n**URL:** https://www.reddit.com/r/horror/comments/1n1atrm/ever_regretted_watching_a_horror_movie/\n**Body:** Have any of you seen a movie and then regretted watching it because it was too disturbing or stuck with you for too long after or just hated it soo much that you wished you never saw it\n\n### Top 13 comments and their replies (up to depth 25)\n\n1. Human Centipede 2 is the only movie that made me feel dirty and sad after watching it.\n  - I regretted even hearing about some of the stuff from that movie\n  - I never had the courage to watch this one. But I watched a Serbian film and, to this day, I still feel disgusted.\n2. The girl next door (2007) disturbed me so much. What they did to that girl and knowing it’s a true story and that the true story is even worse haunts me.\n  - I read the book once, never again.\n    - I've never had a book make me cry harder than this one. I read it back in January and still think about it often. It sent me into such a rabbit hole looking up the real case and the whole thing disgusts me from top to bottom. There should have been more severe punishments for this level of abuse and cruelty. Reminds me a lot of the Junko Furuta case because of the lack of justice.\n      - Yes! There’s absolutely no redeemable people in the original case other than her sister, and Junko’s case makes me angry; good examples on how sick humans can be. There were parts of the book that I had to reread over a few times because my brain couldn’t comprehend what it was reading, it was disturbing.\n  - I listened to a podcast episode about Sylvia Likens and knew I wanted NOTHING to do with any kind of film adaptation.\n3. Martyrs.  It had an interesting point in the end (spin on the torture porn genre).  But, I would prefer to just forget what I saw.\n4. Tusk. I was majorly unhappy after seeing that.\n  - I loved Tusk in a ‘what in the tuck am I watching???’ kinda way, my boyfriend on the other hand… he was incredibly disturbed &amp; didn’t let me pick our next half dozen movies 🤣\n5. The original last house on the left and straw dogs had me pretty fucked up don't know if I'll ever watch those again also henry portrait of a serial killer is pretty fucked up\n6. Bring Her Back hit pretty hard. \n\nGerald's Game is just simply heartbreaking\n7. Requiem for a dream\n\nWrecked me so bad I consider it a horror movie. Someone on Reddit told me to watch it going in blind, so I did, on the stairmaster at the gym. \n\nI’ll never forget walking out of the building absolutely traumatized. Never felt that way about a movie before or since\n  - At the gym 💀\n8. Gurotesku or Grotesque (2009) a film I watched once but will never watch again, no real plot just pure sadism for the sake of entertainment.\n9. House that Jack Built.\n\nStrangest experience after watching a film, of being equally divided in REALLY wishing I hadn't seen that and kind of glad I did...\n10. For the latter - 100% \"Dashcam\", which has a lead character so infuriating that I only watched the full thing to see her die - and they couldn't even give me *that*!\n11. Yup, A Serbian film\n12. Come See\n\nOne of the most horrifying depictions of war\n\n## 9. I didn’t watch the trailer, I didn’t know anything before watching Dangerous Animals (2025). I thought it was just a shark movie like Deep Blue Sea but I was so wrong. This is one of the best horror films of 2025. (from r/horror)\n\n**Score:** 510\n**URL:** https://youtu.be/lA7Jm6GdLOU?feature=shared\n**Body:** It's a 9.5/10 horror film for me.\n\n### Top 13 comments and their replies (up to depth 25)\n\n1. Let’s not overhype this. This is a solid 7/10 thriller/horror. It’s got some VERY generic storytelling tropes but the villains performance makes the film really fun and worth a watch. \n  - Thanks for tempering the hyperbole of these kinds of posts.\n    - In the year of Bring Her Back and Weapons, and so many other great horror movies… this one isn’t even making my top 5. But it is adding to a fantastic year for thriller and horror movies.\n  - People love to do this shit. Acting like just because they overlooked a movie then ended up liking it a lot must mean it’s one of the best movies ever/of the year\n2. Best? Idk. It was good though.\n3. It really isn't, but it was perfectly fine.\n4. Do your self a favor and go watch “The Loved Ones”. It was made by the same guy. So good.\n  - Oh damn I didn't even know this was the same director! I definitely gotta check it out\n5. It went on for just a bit too long, but I liked it overall\n6. His monologues drove me insane lol.\n7. Sean Bryne makes great movies\n  - He hasn't missed yet.\n\nAnd Jai Courtney was peak casting in this.  Felt like Mick Taylor(Wolf Creek)'s rowdy seagoing nephew.\n\nAs much as Hollywood tried to position him as a leading man at one point he is much better at playing  assholes and staight-up villains.\n    - He does a good job playing the best friend/supporting role too. He was fantastic in the first season of Spartacus!\n    - Whatever happened to wolf creek 3?\n8. No, it's really not lol.  Im glad you dig it, though.\n9. Ok it was good but holy shit talk about an overhype post. Watches it last week and really only watched it because of Jai. \n\nSolid performances, pretty bad effects, simple script. It’s a fun movie to have playing in the background while you clean or work. \n\n5/10.\n10. It was ok, nothing new tho\n11. Except for the main character being kind of a douche bag in real life, I enjoyed this movie. I just do not like the main actress\n12. I don't agree it's one of the top ones, but it was pretty fun. I think they stretched the concept really thin, though.\n\n## 10. Oda has to make up his mind. He can't just randomly design humans who look straight out of a horror movie, then treat some slightly weird-looking characters as if they were literal devils. (from r/Piratefolk)\n\n**Score:** 821\n**URL:** https://i.redd.it/j1hswdz0gfmf1.jpeg\n\n### Top 9 comments and their replies (up to depth 25)\n\n1. Before you participate in Piratefolk please take a moment to read the rules if you are new here. Please be respectful of the subreddits culture and the users that contribute to that. This place is unique because its one of the few places you can can criticize Onepiece/Oda. If your goal is to come here and change that or make mock those that do, this place isn't for you.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Piratefolk) if you have any questions or concerns.*\n2. I think it's more that Katakuri had been put up on a pedestal and had to be ashamed of his one imperfection as a result. No doubt the other weird looking family members just get treated like that in general\n3. Katakuri is (or was) the most popular of the brothers, the expectations for him were higher. We didn't see her fawning over Opera.\n  - https://preview.redd.it/pqq7a2ltkfmf1.png?width=1272&amp;format=png&amp;auto=webp&amp;s=b29e71e698130f604f27b20b76085fb4aae913c4\n\nThis goes far beyond having high expectations for him. They're literally mocking him right in front of him.\n    - Far or not, that's the explanation. Katakuri was supposed to be perfect, both invincible and good looking. Flampe is a brat, but they are a family of psychopaths, we can't expect her to know better. Also, she is like 15 years old, teens can be this cruel and irrational.\n      - You read people on reddit and you see that, indeed, teens and not so teens can be cruel and irrational.\n        - Yeah, many people can be very cruel when they preconceived idea of a situation turns out to not be true.\n      - Flampe is such a funny Name for me as German. Its Sounds Like the word \"Schlampe\" with means Bitch.\n\nIt really fit her bratty demeanor\n    - Yeah...after all of those years of expectation to be immensely ruined when they finally saw what Katakuri actually looks like...\n\nCome on, similar things to this also happen to irl public figures. Surely you've seen some case of e-celebs getting canceled or having their reputation ruined overnight despite being beloved for years before, right?\n      - Dream literally looked like a regular 20 year old dude and since peoples expectations were so high for some reason it became drama when he did a face reveal\n      - CorpseHusband\n    - Katakuri being mocked for his way of eating/mouth and Pudding being seen as a monster for her 3rd eye in One Piece's setting, even by random kids who knows they're children of Big Mom, and who looked like the ugly noble kids from Goa Kingdom, has to be the worst part of WCI (which I consider solid overall).\n\n\nLike, OP's world is a sandbox of different fantasy races, eccentrics and literal freakshows, with BM's children being the biggest show of that in a single arc, except for Kaido's 100 Bums army for few exceptions. How tf Pudding is somehow considered more monstrous looking than any other of her siblings, to the point BM herself treat her like that ? Makes no sense\n  - https://preview.redd.it/o01in5j7ehmf1.jpeg?width=1232&amp;format=pjpg&amp;auto=webp&amp;s=3ebf26b45c0c433ca2f88967f0100e104da4eb8f\n\nTheir own mother already set the low bar for expectation.\n    - Big Mom is such a hypocrite is funny, like, she calls Pudding a freak. Ma'am, have you looked in the mirror lately?\n4. That’s how it looks if you take away the context of the situation. The only reason she reacted that way is because he was seen as normal and perfect even. Everyone looked up to him. Pudding and others are fair game though.\n5. The same thing also applies to Pudding, Loki, etc.\n  - I’d argue that these two are really unusual even by One Piece standards\n\nLike we normalize all kinds of wacky looks as being the same but no one else has a 3rd eye or demonic eyes\n6. Ugh, don’t make me take up for Oda… but prejudice is always arbitrarily applied. That’s before we even get to the context of how the younger siblings saw him prior to the reveal.\n7. I fucking hated that grape built bitch. Worst character for me. My hatred for her has no limits.\n8. I never understood how big mom’s children like Katakuri, Pudding , Brulee get bullied as if they aren’t pratically Royalty of Totto land.\n\n## 11. Underwater nightmares: bizarre sea creatures that could star in a horror movie. Jaws of a viper shark (from r/nextfuckinglevel)\n\n**Score:** 855\n**URL:** https://v.redd.it/dl02csz0pklf1\n\n### Top 11 comments and their replies (up to depth 25)\n\n1. **This submission may have been posted by a bot**. If you feel like it's the case, please **report** the user `SPAM` → `Harmful Bots`.\n\n---\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/nextfuckinglevel) if you have any questions or concerns.*\n2. When the jaws open wide and there's more jaws inside, that's a moray...\n\nOr a viper shark apparently.\n  - Doesn't the goblin shark do something like this too?\n    - WHEN AN EEL BITES YOUR THIGH AND YOU BLEED OUT AND DIE, THAT'S A MORAY\n      - when you're deep in the see, and there's teeth in your knee, that's a moray\n        - If it lives in the reef and has two sets of teeth, that’s a moray\n          - Put your hand in that crack and you won't get it back, that's a moray\n      - ![gif](giphy|ac7MA7r5IMYda)\n  - This isn't a second jaw, this is just the one set extending outside the \"jaw\" area\n3. ![gif](giphy|3ohzdYjwEQuR1J7dte)\n  - Can I ask you a question?  Does my breath smell bad?\n4. ![gif](giphy|ViGwJOV6EWAKs)\n5. Nah, I’m good. Thank you though\n6. ![gif](giphy|Ax8oJUZFtiAAyr59vJ)\n7. Why tho?\n  - I wouldn't bet on this, but I think they project the jaw forward to catch their prey. Giving them a little advantage, a longer reach.\n8. A sea xenomorph. Great.\n  - a seanomorph?\n9. It’s kinda cute lol. When the jaws are inside\n10. Neo-morph ass bitch\n\n## 12. Looking for truly terrible horror movie recs (from r/horror)\n\n**Score:** 99\n**URL:** https://www.reddit.com/r/horror/comments/1n59o2i/looking_for_truly_terrible_horror_movie_recs/\n**Body:** Hi there. I am a horror movie junkie. I have seen 946 horror and horror-adjacent movies. Out of these, 628 have been \"bad\" (I have an IMDB list of these, I'll DM you if you're interested, but I don't wanna break the self-promo rules). This includes zero-budget student films, Syfy monster schlock, and movies that I just really did not like.\n\nI love all of this trash. It's great, and I would love recommendations for the worst horror movies that you all have seen. Can be horror adjacent too, it just has to have some sort of \"horrifying\" element.\n\nThanks.\n\nEdit: Alright, I looked through a lot of these suggestions, and I plugged 140 of them into a Wheel of Names. Wish me luck.\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. Things (1989)\n  - Yeah, that looks... interesting. Thanks.\n2. Uninvited- A mutant cat inside of a normal looking cat terrorizes young people on a ship. George Kennedy and Clu Gulager \n3. The Suckling! A woman’s aborted fetus transforms into a mutant monster that tries to kill her and her friends. I feel like the Street Trash movies would be a good pick as well, and The Incredible Melting Man.\n4. Zombeavers\n  - That is art.\n5. GingerDead man\n6. Poultrygeist: Night of the Chicken Dead\n7. Birdemic!!\n8. Uwe Boll's House of the Dead (2003).  I believe this may be the worst horror movie I ever saw in my life.\n9. Bloody Muscle Body Builder in Hell is a must-see.\n10. House of the Witch\n\n\n\n\nThe Bye Bye Man\n\n\n\n\nHouse of the Dead (2003)\n\n\n\n\n\nThey/Them (2022)\n11. If you can find a copy, Devil Story. It’s a poorly dubbed French movie. A Nazi zombie/monster chases people and a guy spends much of the movie trying to shoot a horse with a shotgun while yelling at it. I bought a copy from Vinegar Syndrome and it was worth it.\n\nOr\n\nSpookies. An unfinished movie that was haphazardly finished by a completely different director. It’s got cool creatures, terrible acting, and a nonsense plot.\n12. Ax Em is a contender for one of the crappiest slashers ever made. Wikipedia says it had a $400,000 budget, and like The Room, there's no way most of it ended up on screen. You can tell the director only did this one movie, it has every amateur mistake, including botching the audio recording, there's no way they had a boom mic.\n\nFrom MST3K, Monster A-Go-Go and The Beast Of Yucca Flats were the worst horror movies on the show, worse than Manos The Hands Of Fate. Monster was an unfinished Bill Rebane movie that was bought by Hershel Gordon Lewis when he needed a b-feature, so he did some cheap reshoots without the original cast and it just abruptly ends since they didn't have anyone who looked like the monster. The Beast Of Yucca Flats was by Coleman Francis who had 3 movies shown in season 6, all terrible. His first movie had no sound recording, so the audio was added in post, with random narration that has nothing to do with anything in the movie, like out of nowhere, \"flag on the moon. How did it get there?\"\n13. Basket case (1982) horror/comedy. They also made two other films after this haven’t seen them but the first one was just ridiculous\n14. Dead Heat.\n  - This is the best buddy cop zombie movie ever made please delete this.\n15. Popeye the slayer man\n16. *Verotika*\n17. I mean, are you talking the kind of bad that makes people not want to finish? Or the kind of bad that’s just gloriously trashy?\n\n## 13. Celebrities Who are Actual Nerds (from r/TopCharacterTropes)\n\n**Score:** 14074\n**URL:** https://www.reddit.com/gallery/1n5ma99\n**Body:** A lot of celebrities are fairly vapid, even those related to nerdy stuff. And sometimes they're just normal people collecting a paycheck. I don't expect a voice actor to understand every facet of a video game or cartoon they do work for.\n\nHowever, sometimes, a true nerd slips through the cracks. Here are some of my favorites.\n\nPeter Cushing: Respected Shakespearean actor famed for playing Sherlock Holmes and Grand Moff Tarkin (and being in several Hammer Horror Films), Cushing is also a fairly famous war games player, back before even Games Workshop developed Warhammer. \n\nHenry Cavill: (Insert witcher interview here) Cavill is built like a brick house, and yet has some fairly nerdy passions. He builds computers and loves LOTR and Warhammer 40k. It's kinda funny seeing him wasted on stuff like Mission Impossible when his dream gig is a 40k adaptation.\n\nRobin Williams: A gamer back when gaming was still in its infancy, Williams loved Nintendo so much, he named his daughter after Princess Zelda. He was also a bit of an animation nerd, hiding a reference to Evangelion in his movie 1 Hour Photo.\n\nChristopher Lee: More of a classical nerd than a modern nerd, Lee is a lover of history and swords, even having his own. He's also very literary, and when asked to voice the villain Last Unicorn, brought a book with all the passages he wanted adapted highlighted. And one of his last big things was being in a metal music video with some local garage band.\n\nWho are some of your favorite nerds who achieved acclaim?\n\nAnd of course, RIP to all three of the ones listed who are no longer with us. Mad props to all of them.\n\n### Top 11 comments and their replies (up to depth 25)\n\n1. Rod Stewart, it turns out, is *insanely* good at and *insanely* dedicated to building model trains and cities.\n\nhttps://preview.redd.it/1qzihn4nqjmf1.jpeg?width=970&amp;format=pjpg&amp;auto=webp&amp;s=c0c4ec645800570a8a0a9c87739650ed0d102d48\n\nHere he is, pictured with one he built.\n2. David Corensweat is a big Star Wars Fan. There's a video of him quoting \"you may fire when ready\" and of course, he was recently gifted this big Lego set\n\nhttps://preview.redd.it/7tdfq3s9sjmf1.png?width=640&amp;format=png&amp;auto=webp&amp;s=490f24b5c4614d3d098d7c5f298718fa9894fc68\n  - There's also a video where he does the R2-D2 scream. I hope he's able to get cast in a Star Wars movie someday\n3. https://preview.redd.it/r19el5rz0kmf1.png?width=640&amp;format=png&amp;auto=webp&amp;s=72ec68e78b927da67a0dc2c544c9f7e07cbdda7a\n\nKarl Urban is a huge nerd and have most fun playing in fantasy/sci-fi movies. From what I've heard he even refused to take off the helmet backstage when doing Dredd.\n  - ![gif](giphy|CbYJLnm37JMre)\n4. https://preview.redd.it/t88iraigpjmf1.jpeg?width=500&amp;format=pjpg&amp;auto=webp&amp;s=f0a7dead8d38025a957c7c55bf96fba165d9b53c\n\nSamuel L. Jackson likes anime\n  - Hell yeah\n\n![gif](giphy|QySLsQjYxeXlu|downsized)\n    - What’s this anime?\n  - Just this morning I saw a short where he was asked how he got into Star Wars.\n\nApparently he'd said he always wanted to work with George Lucas, and they had a chat. He said he'd even just be a stormtrooper in the background, anything really, and George had a think. Months later, when Episode 1 was filming he got a call to head over to London where the shoot was happening, and he only found out he was a Jedi when he got into costuming. Someone had to explain to him he'd be sitting right next to Yoda, and then he had to pick a lightsaber from a tray of options.\n\nHe was so incredibly giddy while telling this story, it's clear he was really excited about the whole thing. And he got BMF inscribed on the on button of the saber, which is just great.\n5. Keegan Michal Key\n\nBelieve it or not, he was a LARPer\n  - Oh so THAT is where he perfected those screams of pain\n6. that interview with robert pattinson explaining final fantasy lore and Cloud's romance and aerith vs tifa was pretty good\n\nhttps://preview.redd.it/am9tzezu6kmf1.jpeg?width=1600&amp;format=pjpg&amp;auto=webp&amp;s=846eaef8191087ee44503b84bc7e86d70fa538c6\n7. https://preview.redd.it/cox457zzljmf1.jpeg?width=780&amp;format=pjpg&amp;auto=webp&amp;s=8a50be9cce2c8cfb0cd74a6e7ee69121e595cc70\n\nDolf Lundgren\n\nLooks like a meathead, has a masters in chemical engineering\n  - https://preview.redd.it/u7nv6ngqojmf1.jpeg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=92be19e195989432d9db5cf391fddcf019b9495a\n    - The geek shall inherit the earth\n8. https://preview.redd.it/ig2qpa9nckmf1.png?width=385&amp;format=png&amp;auto=webp&amp;s=ddb49d008dccf2c70d598a00369a49fc3fdb065e\n\nHere's Mathew Lillard (Most famous as shaggy from the live action scooby doo and Stevo in SLC punk) playing a netrunner named Cereal Killer in the Cyberpunk Red live play. Big TTRPG fan in general.\n9. Christopher Lee didn't just collect swords, he was a genuine swordsman _and a menace for his costars._\n\nAnakin was lucky he didnt lose an arm irl too lol:p\n10. Fun (actually Depressing, but \"Fun\") Fact about Robin Williams: he desperately wanted to play Professor Oak in a live-action Pokemon movie, a passion the Pokemon devs apparently shared. Long after his death, Detective Pikachu wanted to use the character, but The Pokemon Company vetoed it, because they believed Robin was the only person that role belonged to.\n  - rest in peace, williams\n  - Also less known, but Robin Williams also played warhammer 40k.  There are a few stories about him randomly showing up to a game store with his eldar army and narrating the whole game.\n\n## 14. If you had to crown one horror movie as the ultimate GOAT, which one gets your vote? (from r/flicks)\n\n**Score:** 83\n**URL:** https://www.reddit.com/r/flicks/comments/1n32nrb/if_you_had_to_crown_one_horror_movie_as_the/\n**Body:** So, I recently watched The Things 1982 for the first time and… wow. It completely floored me it all holds up so well after 40+ years. Basic pick, I know, but it really earned its reputation for me.\n\nI’m on a mission to dive deeper into the genre, so I’d love to hear your take: what’s your magnum opus of horror? It can be the best, your favorite, or both totally subjective!\n\nYou can add it [here](https://stackl.ist/3VtasSE), just paste links and ill watch them all during my free time!\n\n### Top 14 comments and their replies (up to depth 25)\n\n1. Jaws for me but I’m old. The Thing for practical effects and Alien for franchise longevity/quality.\n  - Just a reminder that Jaws is out in the theaters for it's 50th anniversary now.\n2. The Thing is a solid pick.\n\nI’d go for Alien though.\n  - Either and I’d add American Werewolf in London.\n    - American Werewolf in London was my best horror cinema experience. The special effects were awesome. It had just the right amount of humour. And there were a couple of really good jump scares. It has also aged really well. It’s still good to watch.\n  - The thing genuinely creeps me out every time I watch it\n3. Original Halloween. Lost weeks of sleep in 1978 from that one!\n4. Texas Chainsaw Massacre\n  - Agree here. It's so gritty and had held up very well. I used to think Nightmare on Elm St was the GOAT, but Texas Chainsaw Massacre has aged better imo.\n5. Night of the Living Dead still holds up, and is one of the most influential films of all time.\n6. I think my favourite horror movie is Ring (1998). It's almost entirely creepy vibes. Almost nothing happens on screen. It's all creepy electronic noises and slow-burning tension. It uses weirdness rather than gore or jump scares to ramp up the tension. It's one of the best movies for being unsettling but also enjoyable and watchable.\n7. There's just something deeply, genuinely unsettling about the original 'Nosferatu' even a century+ later. Sure it's old and doesn't have what you'd call jump scares, but even now it has this pervasive sense of \"wrong-ness\", like something that was unearthed from where it shouldn't have been. So that'll always have my vote.\n8. The Shining is a strong contender\n  - The Shining is one of very few examples of a horror movie made by a truly great filmmaker. It is disturbing on many levels and is a complex film that can be interpreted and analyzed many different ways. In other words, it is fantastic art.\n9. It Follows. I enjoyed it more than any other horror film. Everything about it just felt like a film-length nightmare. The scares, the anachronisms, the music, the whole atmosphere of the movie was so well designed. It made me scared for weeks. It can even bear rewatches, even if you know what will happen, I still get scared.\n10. Probably it's the Exorcist, it's scary and shocking without relying too heavily on gore and unexpected loud noises. It's kind of genre defining and has to be a GOAT contender. \n\nBut honestly, The Omen is my horror happy place so I'm changing my mind and voting for that, the film is genius.\n  - I've only seen this movie once like 25 years ago and it still haunts me.\n11. Alien. It’s untouchable.\n12. **Event Horizon** is one of my favorites and hasn't been mentioned.\n13. ORIGINAL version-  DAWN of the Dead\n\n## 15. What would you do with the horror movie death pit (from r/AusRenovation)\n\n**Score:** 155\n**URL:** https://www.reddit.com/gallery/1n33fgh\n**Body:** It's not quite 2m deep, seems like the original owner intended to dig it out more but never finished? \n\nIt also keeps filling with water as the garage isn't well sealed, so that's the first thing to solve, unless I want it to be a swimming pool.\n\nI'm not a car person so no use for a mechanic's pit. I'm sure the safest thing is to just fill it in but that's no fun... \n\n### Top 9 comments and their replies (up to depth 25)\n\n1. Change my cars oil\n  - This is handy. I wouldn't delete this. Even though I have never changed oil myself! \n\nIt's a great garage feature and really useful. I would fortify and waterproof this and keep it. Removing functional extras is a bad choice.\n  - I'd love a pit like this.\n    - You can have mine if you come remove it\n      - The good news is I removed your pit.\n\nThe bad news is you now have a bigger one.\n      - Well.... I have an excavator... Now I just need a truck to load it.. Any offers?\n  - https://preview.redd.it/u515alrsj2mf1.jpeg?width=1080&amp;format=pjpg&amp;auto=webp&amp;s=e6d0fc94f99a77fcdc4d4e4981d3a713c197d623\n2. It rubs the lotion on its skin or else it gets the hose again.\n3. Buy a plastic/laboratory skeleton and some shackles and chain it up like a m*rder victim, then carefully put a new cement slab over the top.\n35-40 years from now, someone will make the grisly discovery and completely freak out, only to find out the hard way it was all a bit of fun.\n  - I think the thought of old bony boy down there by himself would be 2 spooky for me\n    - Really? I would struggle not to dig it up myself for fun. I’d probably sell the house on purpose just so I could see the completion of the joke.\n  - I was hoping you'd suggest covering it in thick perspex so you can look down and admire your little scene\n    - There’s a library I went to in Italy somewhere which had Perspex floors so you could see the ruins and archeological digs underneath. I guess they found a bunch of stuff during a reno and thought that was a cool idea also.\n4. that is just a way to get under the car - no criminal activity\n5. Eel pit for sure\n  - where to obtain eels\n    - I know a guy. You need lube too or got your own?\n6. I would use it to work on my car or as a cellar.\n7. Had one of these growing up. Dad used it to store his home brew.\n8. Trap door and ladder. Maybe a shelf on one side for cool underground storage of wine etc. Or it rubs the lotion on its skin or it fills up and becomes a swimming pool again.\n\n---\n\n"}