{"content": "# Top 5 posts from r/MovieSuggestions month\n\n## 1. Movies that is so insane, it's best watch completely blind\n\n**Score:** 770\n**Body:** Recommend me the most insane, jawdroping, weird and shocking movie you know, and do not tell me anything about it, just type in a title and that's it, I want to be completely surprised by it.\n\nSimilar movies for reference:\n\nDead Alive (1992)\nFreaked (1993)\nHouse Of The Dead (2003)\n\nIt doesn't have to be bloody or bad, just unexpected and out of this world \n\n### Top 8 comments and their replies (up to depth 10)\n\n1. Existenz\n2. Sorry to Bother You is my favorite weird movie. It’s not scary - just weirdly hilarious and strangely deep and satisfying\n\n\nUpdate: thanks to everyone that liked or commented on this movie.  It is so damn good and makes me happy that so many people loved this movie the way I did.\n  - I’ve never been so thrown by a movie’s twists than this one. Kudos to the trailers for not spoiling anything, you have to go in blind\n3. Predestination\n  - Coherence as well.\n4. From Dusk Til Dawn. If you don't know anything about it yet, don't even look at the cover art, just watch it.\n  - I fell asleep the first time I watched it and when I woke up I thought another movie had started 🤣\n5. One Cut of the Dead. Watch it blind. Just trust me.\n6. Cabin in the Woods. I love this movie! Also, Mother (Darren Aronofsky) goes of the rails too, but I didn’t really find it enjoyable.\n7. Parasite\n\n## 2. Most underrated documentary you’ve seen\n\n**Score:** 497\n**Body:** I've been on a documentary binge lately and it made me realize how many amazing ones fly completely under the radar. One that really stuck with me was *Brothers in Blood: The Lions of Sabi Sand*. It's about a coalition of lions in South Africa and their rise to dominance over a huge territory. The way it's filmed and the story it tells honestly felt like something out of a movie and it gave you that adrenaline kick that is rare especially for me where the only thing that gives me that rush is when I play jackpot city. It made me wonder how many other incredible documentaries are out there that don't get the attention they deserve. What's the most underrated documentary you've seen like something you think more people should know about but maybe never got mainstream recognition?\n\nI'm always surprised by how many people haven't heard of some of these smaller productions that are just as compelling as the big Netflix releases. Sometimes the best stories are the ones that don't have huge marketing budgets behind them.\n\nLooking to add a bunch to my watchlist especially anything that completely flew under the radar but deserves way more attention.\n\n### Top 9 comments and their replies (up to depth 10)\n\n1. I changed the flair to the correct one. Make sure to read our [guidelines](https://www.reddit.com/r/MovieSuggestions/comments/8iamsh) before posting :)\n2. Three Identical Strangers.  Just... WOW.\n3. We all know the likes of Grizzly Man, Dear Zachary and Capturing the Freedmans, but here is one many people don't know of: \n\nThe Queen of Versailles\n\nIt was an eye opener! A story of what happens when a business magnate loses his business during a recession and a formerly rich family who never had to worry about money now has no source of income. Mandatory viewing.\n  - So... the plot of Schitt's Creek?\n  - Queen of Versailles is One of my favorite docs, so many life lessons.  Whats cool about it is its filmed in real time as his empire is crumbling so the emotions are real. They’re Not talking about it after the fact.  It’s as its happening.\n4. American Movie is such a perfect documentary that it feels like a mockumentary.\n5. Not underrated, but not nearly enough people know about:\n\nSalesman (1969). One of my favorite films of all time. \n\nErrol Morris’ early films: Vernon, Florida and Gates of Heaven; as well as his later or more well-known work: The Thin Blue Line; A Brief History of Time; Fast, Cheap, &amp; Out of Control; Mr. Death; and The Fog of War.\n6. The Tower about the University of Texas clock tower shooting. It’s incredible. Very suspenseful, even if you know what happened.\n7. Dark days. \nAbout the people that lived in the unused subway tunnels in NYC. \nThe making of it is also just as good.\n8. The Alpinist\n\n## 3. I’m a sucker for movies where society is decaying\n\n**Score:** 436\n**Body:** Not fully apocalyptic, but when it seems like the end times, that the future is very bleak and it starts reflecting on society. People still go on about their lives, but it’s bleak.\n\nSomething like Children of Men.\n\nCan y’all please satisfy my desires ?\n\nEdit : thank you all for the answers, y’all are legends \n\n### Top 9 comments and their replies (up to depth 10)\n\n1. District 9\n  - Good one. I like it because it shows the decline insinuating that corporate influence is part of the problem.\n2. Have you tried the news?\n  - I don't know whether to find this funny or depressing\n3. The hbo interpretation of Station Eleven is beautiful.\n4. Mad Max (1979)\n5. Brazil\n6. Aniara probably fits. A spaceship filled with people moving to a new planet loses its propulsion systems and they realize they will be drifting in space for eternity. Society degrades as a result\n7. They Live\n\nDemolition Man\n8. 1984 with Sir John Hurt.  It's the OG societal rot story.\n\n## 4. What is the absolute WORST movie EVER\n\n**Score:** 376\n**Body:** im really bored and i want to watch the worst movie ever with some friends, and im curious what the absolute worst movie is. not just because certain things were slightly bad or its not as good as something else, a movie that is genuinely agonizing to watch. \n\n### Top 8 comments and their replies (up to depth 10)\n\n1. Apparently the new War of the Worlds on Amazon is beyond redemption. \n  - \"It's Worse Than You Think.\" It's the worst adaptation of H.G. Wells' novel. \n\nThere's literally a scene where the President states and I'm not kidding: \n\n*\"This plan is humanity's last chance. I see no other option but to initiate this **war of the worlds** to save us all.\"*\n  - The Pitch Meeting on this is hilarious. I cannot believe this movie is real\n2. **War of the Worlds**. The new Ice Cube version on Prime. Oof 😖 Your time will be thoroughly wasted.\n3. Rhinestone\n\nDolly Parton has to train Sylvester Stallone to be a C&amp;W singer.  If she does it, she gets out of her contract with her creepy agent.  If not, her agent gets to rape her!\n\nIt's a PG\n4. Highlander 2 (Electric Boogaloo)!\n5. It’s still Cats.\n6. “Kirk Cameron’s Saving Christmas.” Currently streaming on Tubi. It’s got a 1.3 average rating on IMDB. I’ve heard it’s excruciating but I haven’t had the guts to watch it yet.\n  - Best comment from the YouTube trailer, “I watched this on a plane, and people still walked out.”\n7. Birdemic\n\n## 5. Erotic movie suggestions\n\n**Score:** 359\n**Body:** I have a date night with my bf today and I am on a lookout for something very steamy with a good enough plot to get us into the vibe/mood for the deed. \n\nNeither of us have seen much of erotica movies before but have heard that a lot tend to have boring plots or not be very sexual. \n\n### Top 10 comments and their replies (up to depth 10)\n\n1. body heat\n2. The Handmaiden\n3. Y tu mama tambien, unfaithful\n4. [deleted]\n5. Secretary\n6. Rochelle Rochelle\n  - A young girls strange, erotic journey from Milan to Minsk. A classic.\n7. Wild Things\n8. In the realm of the senses\n9. The Dreamers\n\n---\n\n# Top 5 posts from r/moviecritic month\n\n## 1. An actor you had no expectations for but who turned out to be great.\n\n**Score:** 52297\n\n### Top 8 comments and their replies (up to depth 10)\n\n1. Robin Williams and Bryan Cranston are two comedy actors that turned out to be great drama actors too.\n2. Unrelated, but Bautista really fucking pulls of the tiny glasses look\n  - They're actually regular sized classes. He's just that huge.\n3. The thing with Bautista is…he cared. He wanted to get better so he got lessons. Took classes. He sought out acting teachers and advice to get better. \n\nMany actors just do their thing and that’s it.\n  - He's been actively de-bulking so he can get more diverse roles(and health reasons), which I really respect. He doesn't want to be type cast.\n4. Robert Pattinson. The whole Twilight thing really overshadowed the fact he had genuine talent.\n  - What's wild is he actually nailed the character in twilight. The movies were made very poorly, but if you compare him to his book counterpart, you can see he was very close to it.\n5. Honestly, Walton Goggins.\n6. Bill Burr was really good in that one scene in season 2 of the Mandalorian.\n7. John C. Reilly  \n\nMost widely known for some goofy shit like Step Brothers, but he's a wonderfully talented actor who has created some really memorable characters in some very serious, quality films.\n\n## 2. What actor can masterfully play a hero and a villain\n\n**Score:** 16467\n\n### Top 8 comments and their replies (up to depth 10)\n\n1. Willem Dafoe\n  - His performance in American Psycho is a masterclass for this reason. The director got him to record the scenes as a kindly investigator who gives Patrick the benefit of the doubt, and then again as an aggressive sharp eyed investigator who smells blood and is close to capturing Patrick, and then she spliced both performances together. \n\nSo it will cut from aggressive Willem to Patrick, then back to a doe eyes sweetheart Willem. Makes Patrick seem completely insane and as though he’s seeing cues that aren’t there\n\nFantastic idea from Mary, and Willem nails both positive and negative type performances \n    - Jesus, that's fucking genius.\n2. Alan Rickman\n  - Hans Gruber is still of the best villains in film history\n3. Sam jackson....he can even do it in one role...Pulp Fiction.\n4. Gary Oldman.\n5. Mads Mikkelsen\n6. Brian Cranston is the shining example.\n7. Jake Gyllenhaal[](https://www.google.com/search?sca_esv=f4a7a166fe39655a&amp;rlz=1C1VDKB_enUS1148US1149&amp;sxsrf=AE3TifOhx3l4oghNV-8HBZd4K9OVR_WqYg:1755718727128&amp;q=jake+gyllenhaal&amp;si=AMgyJEuYX5Hw7261KZxKc6opSy4gcOF13s4ytdD45FzJ5LMMJnyoUU3SGgH9gHvHjuhQv_0aj5MJETVXIBp17WwPtQTua3hM4sYRGLp2P9leFuDz82sEbeA%3D&amp;sa=X&amp;ved=2ahUKEwj1gbn4kZqPAxWM5ckDHZDLDdgQyNoBKAB6BAgSEAA&amp;ictx=1)\n\n## 3. Non-American actors who nail American accents\n\n**Score:** 13504\n**Body:** Melanie Lynskey can do any American accent. It took me years to find out she's a kiwi \n\n### Top 7 comments and their replies (up to depth 10)\n\n1. Gary Oldman\n  - Gary Oldman said he’s done so many accents he doesn’t remember his original accent.\n2. Hugh Laurie\n\nGuy Pearce\n\nRussell Crowe\n  - Russel Crowe has never been the same since he lost Tugger.\n  - Hugh Laurie blew my mind the first I heard him speak without his American accent.  It is spot on.\n    - hugh laurie spoke in a mock british accent during an episode of House and he made it so perfectly “american pretending to be british”. a british actor doing an american accent doing what americans think a british accent sounds like\n\nthe man is a legend\n3. Has no one said Toni Collette yet?\n4. Matthew Rhys in The Americans\n5. Damian Lewis. Forget his role as major winters in BoB. THIS is his finest work.\n\nhttps://youtu.be/2mjfLecdKVo?si=2vR2kOn1Q87nGJPd\n6. bale holds this title. the number of people surprised he's british cracks me up\n\n## 4. A moment in a movie that genuinely surprised you because it completely went against clichés.\n\n**Score:** 11834\n**Body:** This scene of Christopher walken in Seven psychopaths genuinely surprised me in a good way.Although whole movie was good but this scene made it quite memorable.\n\n### Top 8 comments and their replies (up to depth 10)\n\n1. &gt; 'Do you seriously think I would explain my master stroke to you if there were even the slightest possibility you could affect the outcome? I triggered it 35 minutes ago.’\n\nNever read the Watchmen comic so this was a pleasant surprise watching the movie. The antagonist successfully completes his mission. \n  - Just rewatched this a week ago after 15ish years of seeing it in the theater.  I can see some of the weaker parts of it now, but it’s still a very good movie and this is one of my favorite lines.  Was so good reading it in the graphic novel too.\n2. This always makes me laugh. The film is amazing also. Another that never fails to crack me up is when Donnie’s ashes blow up into The Dudes face. It makes me cry with laughter everytime\n3. Very old, but the scene in Raiders of the Lost Ark when the bad guy is flourishing his scimitar all threatening and Indi just rolls his eyes and shoots him 😂\n4. Underrated film. Martin McDonagh hasn’t missed in my opinion. This is easily the weakest of his films and I still love this movie.\n5. Not so sure about how cliched it was/wasn't but the birthday party scene in Signs was genuinely unsettling for me; a combination of thinking they'd be in the bushes and the realisation of \"this wasn't a hoax\". It's not the best or scariest movie but that was a really well done scene.\n6. “Aim for the bushes.” (The Other Guys)\n  - *there goes my hero*\n    - Honestly, I just loved how the sequence played out. The way the two fell towards the ground in your typical action hero fashion… and then they started to awkwardly fumble through the air before crashing and dying.\n7. Scene after scene in *Big Trouble in Little China*. John Carpenter was playing against clichés for pretty much the whole movie (which is part of what makes it so fun).\n\n## 5. An actor who excels in both serious and comedic roles.\n\n**Score:** 9725\n**Body:** Robin Williams in Mrs. Doubtfire and Good Will Hunting.\n\n### Top 10 comments and their replies (up to depth 10)\n\n1. John Goodman. He’s so funny in Roseanne, terrifying in 10 Cloverfield Lane, and has a nice blend of comedy and dramatic moments in Righteous Gemstones\n2. John Lithgow is probably my favorite.\n  - Also equally effective as a hero and a villain.\n3. Bryan Cranston\n4. Phillip Seymour Hoffman.\n5. Tilda Swinton\n6. Michael Keaton\n7. Alan Rickman in Harry Potter and Galaxy Quest.\n8. Jeff Daniels, Olivia Coleman and Matt Damon\n9. Sam Rockwell\n\n---\n\n# Top 5 posts from r/TrueFilm month\n\n## 1. I am completely bewildered by the recent reception of The Fantastic Four.\n\n**Score:** 3181\n**Body:** Look I understand it's become a cliché topic to bitch and moan about yet another comic book movie on this sub, but i'm speaking from a point of honesty here.\n\nThe Fantastic Four: First Steps has recently hit theatres serving as the second (*or third*) attempt by Hollywood to bring the seminal Marvel Comic to the big screen, a decade after the disastrous Josh Trank iteration, in an attempt to revitalise a now stale MCU franchise.\n\nNow admittedly i've never been a fan of the MCU brand of films, but at the very least I respected them for the purpose they serve, which is to get arses in the cinema. And in the context of a Friday night with a bunch of my mates it was okay it got the job done, but upon leaving the cinema the film nerd section of my brain activated and...here we go.\n\nMost of the time I usually wouldn't care, I went into this film completely blind but I'm still left completely baffled by the recent critical reception, it's currently standing at 87% rating on RT with some touting it as one of the years best, and I just don't get why?\n\nBecause in my honest opinion outside of the unique 60's retro futuristic aesthetic, there's absolutely nothing this film does any better than other more critically reviled entries in it's medium. I went back and watched **Fantastic Four** (2005) a film that was critically panned and rightfully so, but objectively I would argue **First Steps** is about on par if not slightly above than the 2005 film.\n\nBoth are tonally goofy/cheesy films with a moderately dumb plot, poor writing, half assed performances, and the some truly atrocious CGI (*the baby at the end my god*) and in some shots the effects are arguably worse than the 2005 film.I could also pick apart the half baked narrative points like Sue (*Invisible Woman*) choosing to bargain the lives of 8 billion people for her child or how the characters barely use their powers.\n\nBut what really bothers me is that there is a far superior film that it compares unfavourably to in every single metric....**The Incredibles** (2004). A film inspired by the same Fantastic Four comics and despite being an animated children's film released over 20 years ago. it has a far tighter script, the family dynamic is more realised, the characters are more emotional, the action scenes are more creative, the villain actually has an understandable motive and even with the films weird flirtation with Ayn Rand thought it even has a strong thematic core despite being a kids film.\n\nI genuinely can't help but feel that standards inherently drop when it comes to evaluating MCU films, which is whyI don't buy the blind praise of being dumb popcorn fun, when there are clearly better examples out there, even among MCU films.\n\n  \n\n\n  \n\n\n### Top 6 comments and their replies (up to depth 10)\n\n1. I've been alive long enough to see, \"You know, The Incredibles is really the best Fantastic Four movie,\" go from being an exciting shibboleth to a tired cliché to accepted general wisdom. \n  - Never heard the word “shibboleth” before so thank you for teaching me a new word!\n    - Now go find someone who uses it correctly and your day will truly be made!\n2. FWIW I think most people probably agree with you about The Incredibles being a better riff on the same theme \n\nBut the job of a movie critic isn’t to go “hey theres a better version of this movie available to rent,” their job is just to engage with the movie in front of them, hence all the B- / 2.5 star ratings, which I think are fair. It’s sitting at a 65 on metacritic, which isn’t exactly rapturous praise. The Naked Gun got better reviews.\n  - Redditors misunderstands rotten tomatoes is a tale as old as prostitution it seems.\n\nIt seems like everyone, including OP, thinks this movie is like a 6-7/10, better than the previous attempts but not as good as great superhero movies. If \"best of the year\" was a real quote it probably has some dropped context, like best blockbuster or best superhero of the year.\n    - Yeah, RT doesn't mean that it's 88/100, it's that 88% of the critics think the movie is not hot garbage\n3. So you think the second weekend drop should have been harsher?  Because it seems like the viewing public isn't so hot on F4, same as you.  I guess I'm wondering how and in what way you're \"bewildered\" by the tepid reception F4 received.\n4. This is why Rotten Tomatoes scores aren't a good metric. It's already a pass/fail system, and the MCU movies are at a pass/fail point now with both fans and general audiences. Only reason I went to see it was for the serendipity of a Superman and F4 movie releasing in the same month. \n\nI don't think the movie was that bad, it was fun enough and at least inched away from the mess of the MCU. But it wasn't the big swing Marvel needs to take if they expect general audiences to show up. \n\nThat said, I think a lot of outlets have taken a bigger \"with respect to genre\" approach to their reviewers, and that bloats Rotten Tomatoes. Which I personally believe doesn't matter, because Rotten Tomatoes doesn't matter. It just puts more onus on people that want to see a \"great\" movie to have reviewers they trust and actually read reviews. If it get people to the theaters, I can really give a shit if somebody pays to see a mid movie because it's Certified Fresh. That just means more money for great movies...\n  - Yep, this thread wouldn’t exist if OP looked at Metacritic instead (as we should all be doing). Incredibles has a 90, and the new F4 movie has a 65. The 2005 movie has a 50. These are all fair/reasonable IMO: the new F4 movie is better than the 2005 movie, but lags far behind The Incredibles.\n5. Meh. As is frequently pointed out a high rotten tomatoes rating says nothing about HOW good critics think the movie is. It's a binary rating (fresh or not fresh) and fresh just means they like it more than they dislike it. \n\n  \nIt has a metacritic score in the mid 60s, which seems to be closer to your assessment. \n\nThat said I do find myself a bit bewildered that people who like movies enough to discuss them on reddit don't know how RT works. Not trying to be mean but that just seems a little odd to me.\n\n## 2. Weapons (2025) - Am I Missing Something? This Movie Felt Incredibly Overrated\n\n**Score:** 1491\n**Body:** I just finished watching *Weapons* and I'm genuinely struggling to understand the praise it's receiving. While it's maintaining a 95% on Rotten Tomatoes, I found it to be a frustrating example of lazy writing disguised as mysterious storytelling. Here's my breakdown of why this film didn't work for me:\n\n# The Setup vs. The Payoff\n\n**What worked:** Those first 30 minutes to an hour were genuinely intriguing. The mystery surrounding the mass disappearance of children, the unsettling atmosphere, and the gradual buildup of dread had me hooked. I had very high hopes about where this was heading.\n\n**What didn't:** Once you realize the actual plot is just \"dying witch uses life force of children to sustain her own life,\" the entire mystery deflates. The story is painfully simple and bland, but the film tries to mask this by stringing the audience along with vague reveals. It's the cinematic equivalent of dangling keys in front of a baby - lots of movement and noise, but no real substance.   \n  \nNot to mention the absolutely IDIOTIC decisions made in this movie in order for the narrative to continue marching forward, as well as the convenient events.\n\nAlso the movie is not scary AT ALL, other than a few cheap random jump scares here and there, there is really ZERO horror aspect to this film.\n\n# Lazy Narrative Structure\n\nThe most glaring issue is how the film pushes its narrative forward. The segmented structure following different characters was awesome at first, with the switch between Justine and Archer being fantastic, but in the end it feels like a desperate attempt to pad runtime and create artificial complexity. The junkie and cop segments were quite literally only there as rushed exposition to explain what's actually happening, and conveniently get Paul in the house so he can die, since the movie spent so long just... hanging around doing nothing. It's forced to rely on conveniences like the junkie just HAPPENING to find Alex's house - anytime a movie makes me think \"Oh how convenient for the story,\" I'm pretty much checked out.\n\nThis anthology-style approach after the first swap comes across as incredibly lazy storytelling - instead of crafting a coherent narrative, they just jumped between perspectives to slowly dole out basic plot information.\n\n# Idiotic Character Decisions That Break Logic\n\nThis is where the film completely lost me. The characters make absolutely baffling decisions that only serve to keep the plot moving, with no regard for logical behavior:\n\n**Aunt Gladys's Hair-Cutting Scene:** When Gladys comes and cuts Justine's hair to set up an attack later, why didn't she just grab an item from Justine's car instead? She could have immediately used Justine for life force or as a weapon, effectively eliminating her as a problem. Plus, given the hatred towards Justine in the town, the consensus would be that she somehow harmed the kids and fled. Problem solved, but no - we need manufactured drama.\n\n**Keeping Alex Alive:** Why leave Alex alive after he brought home the name tags? This brought SO much attention to this one house and child - he's literally the ONLY one left from his class. Why not just kill him or keep him in the basement and feed off his life force too? that way his case just blends in with the others. He does nothing for Gladys's plot after getting the name tags except serve soup. Is that really worth the exposure and ultimately her downfall? It's another convenient stupid decision that shows little thought went into the plotting.\n\n**Justine Never Calls Paul for Help:** Justine is in a relationship with Paul, who's a cop, but she never once asks him to come check out the place with the only surviving kid from the entire class? The place where she just saw ghost-like figures and where all the windows are covered with newspaper? This is basic logic that any reasonable person would follow.\n\n**The Town's Mob Mentality:** The entire town turns against Justine based on virtually no evidence, but somehow nobody thinks to thoroughly investigate the one house with the sole surviving child? Suddenly Alex's parents are just MIA, his house is covered in newspaper, and NO ONE FINDS THIS SUSPICIOUS? The police work in this movie is embarrassingly incompetent to an unrealistic extent.\n\n# The Mystery Box Problem\n\nThis film suffers from what I call \"mystery box syndrome\" - it thinks that withholding information automatically makes a story compelling, regardless of whether the actual answers are worth the wait. The director even admits he chose a title \"that's opaque\" hoping audiences would \"try and make sense of it,\" which feels like an admission that style was prioritized over substance.\n\nThe film strings the audience along for so long that when Aunt Gladys is revealed and you can start putting the pieces together, all mystery is lost and the payoff is nowhere near what it should have been considering the buildup.\n\n# Final Thoughts\n\nI'm genuinely curious if I missed something here. Critics are calling this \"the scariest movie of the year\" and \"a horror masterpiece,\" but to me it felt like a mediocre supernatural thriller padded out with unnecessary complexity and held together by characters making inexplicably dumb decisions.\n\nThe film had potential in its opening act, but it completely squanders it with lazy writing, illogical character behavior, and a reveal that doesn't justify the journey to get there. Am I alone in feeling this way, or did others find the plotting as frustrating as I did?\n\n### Top 7 comments and their replies (up to depth 10)\n\n1. I, too, was kind of surprised by how \"straightforward\" it all ended up being. But I thought it was super entertaining and I was pretty enthralled for all 2hrs and 8minutes. \n\nOne other small detail that wasn't immediately clear to me: when the spell was broken by Alex ringing the bell, why did Archer (Josh Brolin) snap back to \"normal\", while Alex's parents and all of the children did not? Is that because of how long they were under the \"spell\", or was there some other detail that I missed?\n  - They kind of explain that in the end with the child's narration.  \nAlex's parents (The longest affected) didn't snap out of it, they're living in a mental ward now, and after a looong time some of the kids (under the spell for weeks) started speaking again.  \nArcher was only under the spell for like 2 minutes, and he was still a bit out of it when he snapped back (just stared at Justine for a few seconds, and then wandered outside to follow the destruction path).\n  - Because they were in the hypnotized state longer. Archer was only in that state for minutes. The parents and children were like that for a month and some days\n2. A lot of these criticism to me read as either:\n- Points explained in the movie that you are willingly ignoring \n- Being mad about “manufactured drama” when that’s what fiction is as a whole. \n- Personal opinions of yours propped up as fact\n\nNo offense, but as I was reading this I was hearing the voice of the Cinema Sins guy. It just seems like you didn’t connect with the movie and are trying to prove you are smarter than it now.\n  - I agree. It's perfectly okay to not enjoy a movie, or not connect with the structure or think the dialogue is stilted. However, a lot of what I read came across as a person who didn't connect with a movie, being annoyed that others enjoyed it, and dressing up their opinion as an objective evaluation. \n\n\nDescribing something as \"lazy writing\" because you don't like the choice is ironically a lazy critique. \n\n\nWhy did the mob of angry parents with missing children not think logically about how their rage was unjustified? What sort of criticism is that. The real world has thousands of examples of people doing dumb things or taking out their anger in illogical ways on innocent people. Why are the characters in this movie expected to think like perfect logic seeking robots?\n\n\nAll fiction is manufactured. How convenient that Romeo snuck into Juliet's garden right as she was professing her love for him. How convenient that the trex at the end of Jurassic park, shows up just as the raptors where about to kill the surviving group.\n\n\nAgain, criticism is fine, but I'm with you and didn't find this critique particularly compelling.\n3. Weapons is a surface level horror comedy that is enjoyable on its face. But it’s like a 6/10 at best. I also thought the story structure added nothing and was only there to slow reveals. The structure doesn’t have thematic meaning nor is it used inventively like in other films. (It’s like Magnolia in this way, but that film has better characters.) so the structure is only there to slow pacing. Symbols like the assault rifle and the parasites are referenced to present the illusion of deeper meaning, but there is none outside of very surface level allusions. Reminded me a lot of Oddity—quite competently done but there’s nothing “there” aside from being enjoyable with no major missteps. \n\nThe opening scene also didn’t work for me, I thought the music choice was really distracting. Voiceover is almost always a poor choice too, and it could have been done without it. \n\nMuch worse than The Witch, worse than Hereditary, about as good as Oddity, much better than Longlegs.\n4. 100% agree with you. The writing was just bad in my opinion. \n\nThe fact that so many things were just explained blatantly with nothing being left for the viewer to decipher on their own really rubbed me the wrong way. I feel like the separated acts really contributed to the over explanation. \n\nI will say that the girl sitting next to me and about half the theater were on their phones almost the whole time, so maybe movies with more obscure story telling just can’t be as prevalent nowadays. \n\nThe sick old lady/witch/parasitic entity antagonist thing is so overdone I was not expecting such an obvious plot. I’m sure some will disagree. \n\nI also feel like every other movie I watch features a scene with a smashed in head or a body being ripped apart. It’s like filler violence the doesn’t contribute to strengthening the story at all. \n\nLastly, the ending was half assed and seemed quite thrown together. It was abrupt and didn’t add anything whatsoever. I’m not looking for a heartwarming resolve but there was nothing there. It felt like it just ended and all the sudden the lights were on. \n\nI had many problems with this movie and I’m baffled by the positive reviews I’ve seen. I don’t quite get it. I thought it was fun but wouldn’t call it a good movie at all. I was more impressed with Barbarian and I would still say it was quite mediocre. It’s times like these when I feel like cinema really is dead and people’s inability to sit through a movie without scrolling is really the nail in the coffin.\n5. [deleted]\n6. &gt; Once you realize the actual plot is just \"dying witch uses life force of children to sustain her own life,\" the entire mystery deflates.\n\nWhat would have worked for you? Alien abduction. Secret Government Program. Any other various supernatural force. Someone in town using hypnosis? I think the witch angle was fine – it was a modern take on Grimms Fairy Tales.\n\n&gt; Also the movie is not scary AT ALL, other than a few cheap random jump scares here and there, there is really ZERO horror aspect to this film.\n\nI found the dream segments jarring, especially when the witch figure is present in them; or when she appears in the forest in the the crack-addicts storyline. Also, the scene when Justine is asleep in her vehicle and we see Alex’s mother appear from the dark doorway was effectively creepy. Also the whole scene where the crack-addict is inside the house is freaky.\n\n &gt; Instead of crafting a coherent narrative, they just jumped between perspectives to slowly dole out basic plot information.\n\nI really enjoyed the structure. And yes, movie plots need conveniences, because real life narratives don’t fit into a two hour movie.\n\n &gt; When Gladys comes and cuts Justine's hair to set up an attack later, why didn't she just grab an item from Justine's car instead?\n\nMaybe its not her car and the witch needed something was absolutely “hers” (hair). Also, Justine is the focal point of ire for the townspeople; why would the witch destroy this effective distraction? How does “eliminating her as a problem” fix anything up to this point? It wasn’t until the principle revealed to the witch that it was Justine elevating the investigation to the authorities that she decided it warranted killing her.\n\n&gt; Why leave Alex alive after he brought home the name tags?\n\nThe movie makes it clear that the Witch is on the verge of collapse from her illness, and needs someone to feed her parasitic vessels. It also allows her to shield the house under a facade of normalcy, as she acts as his caretaker during investigator  visits.\n\n&gt; Justine Never Calls Paul for Help: Justine is in a relationship with Paul, who's a cop, but she never once asks him to come check out the place with the only surviving kid from the entire class?\n\nBecause its made clear that the cops already investigated the place, and when she brought up the fact that there’s newspaper all over the windows, the principle rationalizes it as the household residence wanting to keep peering eyes out.\n\n&gt; The entire town turns against Justine based on virtually no evidence, but somehow nobody thinks to thoroughly investigate the one house with the sole surviving child?\n\nAlex’s house is thoroughly investigated by authorities, they literally show and discuss this in the film. Everyone accepts that theres nothing else to be seen there as the cops have said as much and Alex is only a child and perceived as innocent. Justine on the other hand remains suspicious because shes the authority figure residing over the children. And the townspeople aren’t operating on logic, they’re operating on rash-impulse and finger-pointing because they’re in an emotionally-elevated state – they’ve just lost their kids. Did this movie realistically showcase “police work”? Maybe you’re right that they’re shown in too “incompetent” of a light.\n\n&gt; This film suffers from what I call \"mystery box syndrome\" - it thinks that withholding information automatically makes a story compelling, regardless of whether the actual answers are worth the wait. The director even admits he chose a title \"that's opaque\" hoping audiences would \"try and make sense of it,\" which feels like an admission that style was prioritized over substance.\n\nWithholding information and teasing it out literally does make a narrative compelling. As opaque as the title is, “WEAPONS” is appropriate because the subtext is one of “parasitic relationship” and “weaponizing the host”. The witch creates “weapons” out of people, and it turns on her. There’s a massive automatic-rifle in the Brolin’s dream-sequence that lends to the subtext of the title.  \n\n&gt; The film strings the audience along for so long that when Aunt Gladys is revealed and you can start putting the pieces together, all mystery is lost and the payoff is nowhere near what it should have been considering the buildup.\n\nHow long do you believe a mystery should go on in a film? To the very last ten minutes? I liked that the movie give you all the information you needed at the ¾ mark and carried the narrative from thereon. The movie wasn't trying to edge you like so many “elevated horror” movies desperately cling to.\n\n I really enjoyed it. It just wasn’t the movie for you. What are some horror films you consider among the best?\n  - Best part another thing I havent seen discussed: Paul is a recovering alcoholic and Justine is prob an alcoholic. They have history. He’s cheated in the past, with her. The cop’s current wife/gf confronts Justine violently. Paul dismisses Justine’s concerns about the investigation. Justine had nothing to gain by asking Paul to help her. He had ignored her in the past and she risked another beat down from the wife/gf.\n\n## 3. Weapons is a complete waste of a great concept.\n\n**Score:** 1156\n**Body:** For the first 15 minutes, I was completely sold. I was strapped in and could not wait to see where this movie would go. I loved the imagery of the children running in the night. I loved the idea of the town and police grappling with such an incomprehensible mystery/tragedy. I loved the idea of the teacher character who everyone blames and the sole remaining child.\n\nFrom there, I was consistently disappointed with every step that the writing took -- all the way to the, admittedly, very fun ending.\n\nHere is I think why:\n\n1. This movie should have been centered on the community members' reactions and varying perspectives in relation to the tragic event.\n\nInstead, we spend a significant amount of time with characters who have no relation to and *no real perspective on* the core mystery. The junkie, the cop, the principal. How do they feel and respond to the sudden mysterious disappearance of a classroom of children? They don't.\n\nImagine if each one had a unique, different connection to the classroom of children, and we explored how their different personalities reacted in the face of a confounding, senseless tragedy/mystery. Imagine if we could see the interplay between community members with differing perspectives and theories as to what could have happened.\n\nSome would be unable to cope with an event that tears open their worldview, their sense of reality, in such a drastic way. Others would try to rationalize the irrational, and be led to scapegoating and turning on each other. (Something in the vein of the classic Twilight Zone episode \"The Monsters Are Due on Maple Street\", maybe.)\n\nThat's how I thought it was going to go when we started so strong with the teacher character being at odds with the rest of the community, while simultaneously dealing with her own despair at the tragedy.\n\nBut then, nope, that was all quickly abandoned so that we could instead follow the story of a police man cheating on his girlfriend and a junkie doing side quests to try to get money for dope. Only for their stories to *coincidentally* connect to the main mystery, to what end? So that they could be brief physical obstacles for the 2 (main?) characters.\n\n2. Once the witch is revealed, the central mystery loses all intrigue.\n\nI'm not saying a witch aunty infiltrating and wreaking havoc on a suburban family and their community is inherently a bad answer to the mystery.\n\nHowever, in execution, it is handled in such a blatant and straightforward way that it is completely at odds with the eerie and mysterious vibe of the central premise.\n\nI get it, the film wants to turn into kind of a sick, twisted version of something like Roald Dahl's The Witches, or other spooky children's Halloween movies. I love that idea on its own, but the way it was implemented here was such a major tonal mismatch with the excellent setup of the mystery -- to go from uncanny, incomprehensible tragedy to complete over-explaining and over-showing.\n\nAnd again, for what? Not to get too CinemaSins here, but what was even the point of the witch's plan? How were the kids helping her get better? Did I just miss that? And why could she not possess the boy rather than allowing him to act with his own free will which ultimately led to her downfall? And why did she get a strand of the teacher's hair but never possess her? Maybe I just missed these details because I was so bored by the end.\n\n3. There is an excellent thematic core that is left very unexplored.\n\nThere is a clear thematic connection here to school shootings, specifically something like Sandy Hook or Uvalde -- inexplicable acts of violence targeted at children. Something we can never fully wrap our heads around.\n\nThe setup here is so excellent in how it transforms that idea into something mysterious and eerie, but not unapproachably dark and disturbing.\n\nIt could have used that excellent approach as a way to explore *something, anything* deeper about the impact that those types of tragedies have on us.\n\nIt could have maintained its tone, and still gone in a Goosebumps-y direction if it wanted to, if it had only had any interest in exploring this juicy thematic territory that was right on its plate after that great setup.\n\nI'm not saying it needed to be some arthouse, serious drama. I think it could have roughly hit very similar plot beats, but just focused more on characters who were actually emotionally/psychologically impacted by the tragedy and have them unravelling the mystery rather than a random junkie. I would have loved to spend twice as long with Josh Brolin and the teacher snooping around and retracing the events of that night (triangulating the trajectories of the children was hilarious and great).\n\nWe end up spending such little time with the important characters and they end up being so unexplored -- so that we can instead spend time on plot machinations that would have better been left implied or not shown at all. We never should have seen the Witch navigating her predicament, for example. We should have seen the community navigating theirs.\n\nConclusion:\n\nWe ended up with an overly-long, underwritten mess that wasted its great premise. Yes, it has its moments. I love the image of the children ripping the witch to shreds. I found the editing to be slick and the action to be intense.\n\nBut damn, there was so much more potential.\n\n### Top 9 comments and their replies (up to depth 10)\n\n1. I don't really get how people aren't understanding that she was harvesting life force from the kids/Alexs parents. The second I saw \"parasite\" written on the blackboard I knew it was gonna be relevant. Further reinforced when we get to listen to Gandy talk to the kids about tapeworms stealing nutrients from their hosts, and then Marcus and his husband watching a documentary on parasitic fungus that control their hosts bodies followed immediately by a visit from Gladys. Wasn't exactly subtle.\n2. I think you wanted to see Atom Egoyan's “The Sweet Hereafter”, a beautiful sad movie about life in a small town after a school bus of children die.\n\nHowever, this was a different movie, and you should judge the film you SAW, not the film you wanted it to be\n  - 'Picnic at Hanging Rock'\n\n\nAustralian Gem about a class of girls who vanish.\nNo explanation for it similar to Weapons.\n\nStylized horror fantasy air to it.\nHard to call a horror but it feels like existential horror to me.\n\nEdit:\n\nPeter Weirs first and my favorite of his tbh.\n\nTop 5 Cinematography I've ever seen on film.\n\nAtmosphere creation too. Just so entrancing and draws you in.\n3. I completely agree with everything you said brother. Buddy and I just got out of the theater and were extremely disappointed. I was so insanely hooked for the first half of the movie with the parents of the town in shambles, the very intriguing mystery for as to why the children went missing. The movie completely fell off when Gladys was revealed in the principals office. Instead of this being a sort of lovecraftian, incomprehensible being responsible for the children’s disappearance, its a dying old woman using witchcraft. It felt so extremely lazy.\n4. I don't feel like any of the comments so far have really engaged with you in terms of the substance of your issues, so I'll attempt to...\n\nFirstly, I'll say I liked the film. After Barbarian, I was expecting some genre fuckery and it to get increasingly looney, which is exactly what his last film did. And so on some level, I was kind of expecting the third act and how it played out.\n\nHowever, like Barbarian, I thought that it abandoned something quite interesting and genuinely unsettling for a much more arch horror-comedy finale, which I don't think necessarily made either film better than what they could've otherwise been.\n\nLike some of the other commenters, I agree that not every horror film needs to be some kind of social commentary, with the horrific bits being metaphors for something going on in society right now. The whole \"elevated horror\" thing that Neon and A24 have popularised have definitely created some level of expectation for deeper meanings, which not every horror film is trying to buy into and play out. And I don't think either of Cregger's horror films so far have been truly aiming to do that.\n\nBut I do actually like you think it's a huge missed opportunity. When you set up the whole premise of a film to be about missing children and a community in mourning without easy answers, it immediately draws parallels to school shootings (something the film even directly alludes to itself with the gun floating above the house in Josh Brolin's dream). So given the seriousness of the analogy and how much of a problem and tragedy school shootings are in modern America, isn't it a bit cheap for the film to start that way (with the intense tone it requires as well), and then turn to become like a gorier Goosebumps episode?\n\nI think there are two distinct problems - one being a missed opportunity in terms of theme, but the second as you point out spending a long amount of time on side characters, who although I did find marginally amusing/interesting, I ultimately think distracted from the film and made it run too long. Even the finale, where the side characters all come together and things get chaotic, felt drawn out about twice as long as it should've been. I could see all the beats long before they actually happened, which drained some of the surprise/shock factor, but also meant that some of the plot holes became more apparent (like why didn't the witchy aunt take control of Alex, just the parents? Why were the kids just standing in the basement for what must've been a couple of months instead of her \"using\" their life force like she presumably intended?). The film could've easily been 20 mins shorter and that probably would've made it stronger.\n\nI don't think horror films have to be about anything specifically, but I do think when you create a premise for any film, it's your responsibility as the filmmaker to steward the premise well and fulfil its potential. And that's where Weapons fumbles, like I think Barbarian did. That doesn't mean that it's overall a trainwreck, I'm glad I saw it and overall enjoyed it. But I also don't think I'd ever bother watching it again, because I think everything that can be gleaned from the film I've already seen, and it doesn't offer enough that's truly interesting or enjoyable to make me want to see it again.\n  - The witch didn't take control of Alex because she was weak and needed someone who could maintain a veneer of normalcy for her to operate in, and to do the grunt work of feeding her victims. And she *was* feeding off of the kids. She gets progressively younger looking as it goes, and those under her spell the longest have the most trouble coming back.\n\nAll of that aside I think you're bringing your own associations to the setup, which is totally fair (and in part I think by design) but I didn't come away with a specific 'school shooting' connection at all. It feels more broadly about absence itself, and how the nature of such a mystery infects people in different ways. \n\nCregger began writing it as a response to the death of his friend and collaborator Trevor Moore, saying each of the main characters represented the different ways his grief over something so sudden and senseless manifested. I'd argue that Cregger writing from an intuitive place sourced from real pain is what gives it its power and also encourages a wide range of interpretation. I think we've been conditioned to accept this \"the monster is a one-to-one corollary for X\" as the default, but the wild blend of tones here plays more to me as a writer honoring the messiness of grief without ever *wallowing* in it. Nothing shallow here for my money, but horror is a personal thing so I get you.\n5. I agree. In the end, with all its random jump scares and plot threads leading to nowhere, and losing its mysterious tragic identity in blatant yet enjoyable comedy and supernaturalism, it ended up being as emotionally empty and bloodless as the parents faces being randomly stabbed with forks. I still had a decent time, but, there was sooo much potential here that was wasted. Nice review.\n\nFor example, a film that has similar vibes that actually made me have feelings was black phone. I left the theatre slightly changed after that one, with a great payoff. This one was just fun and mildly amusing.\n6. I think have a foregone conclusion of what a film SHOULD be about (in this case, school shootings) and deriding the film when it isn't about that, is a really strange thing. I've seen it a lot with Weapons and I don't know why you would do that honestly.\n7. You watched the trailer. The trailer made you think “this is a film about those missing children and why they went missing specifically” because the trailer made you think that. I went it not knowing a single thing about the movie and that made me watch it entirely differently to you. The moment you should have realised the film would be different than you expected was one of the opening lines; the child narrator (Alex?) says: “the story starts here” AFTER the kids had gone missing. It’s exploring different aspects of parasitism - most of the people are bad in some way; it’s not just the witch who uses others. I also did not want to watch a movie about a town mourning over a school shooting style event for 2 hours. I could see that movie being absolutely brilliant and relevant and so on, but it’s not this movie and it’s clear the director wanted to show some aspect of that but not 120 minutes of characters just showing their life having been destroyed (we got that in the opening scenes and a lot of Josh Brolin’s too, and it was absolutely enough to get that idea across)\n8. It's disappointing to see people in this sub downvote you for having an opinion they disagree with. You've clearly put though into this post, and while I don't feel quite as strongly about certain aspects as you, but I think the thrust of your criticism is spot on. \n\nI loved the first half of the film - not just 15 minutes - but there is absolutely a point where the film goes into EXPLAINER MODE and it really just becomes about accounting for the minutia of the plot contrivances. That seems to be the entire purpose of the Junkie and Cop chapters. So we can see exactly how they ended up in that house...presumably because that's the 'Magnolia' thing to do?\n\nIt overexplains certain plot beats and underexplains others. We spend 15 minutes making sure the audience knows all the events that led up to the Junkie getting into that house, when in the end he's just another screaming zombie. But we spend nearly no time understanding what exactly the witch's plan was with the children. They're 'healing her'...*somehow*? Yet she doesn't seem to be healing.\n\nLike you say, the characters felt undercooked, the themes under-explored and the answer to everything just a bit...obvious? I would've loved this to have taken a turn like you suggest, focusing on 4-5 different characters in the community - I even think the cop can be one of them, if he had any connection to the tragedy. Or seeing two parents have wildly different reactions to the loss. Archer's wife seems to be grieving differently than him, and there's some tension there. Couldn't that be a part of it?\n\nI thought of the HBO series THE OUTSIDER, based on the Stephen King novel. Even though I didn't love the ending of that one, it did a great job of showing how a community was torn apart from multiple perspectives after a tragedy.\n\nI still think Weapons is a pretty good movie, especially because of how it's shot and put together technically. But that second half was a bit of a let-down.\n\n## 4. Weapons (2025) Theme Exploration: It's All About Alcoholism\n\n**Score:** 742\n**Body:** Yes I want to talk about Weapons in r/TrueFilm.  I haven't seen much written about this, so wanted to share my interpretation of the movie's themes.  I believe that the film's story is intentionally written to be **very much** about drug and alcohol addiction.  \n\n* The triangle-circle symbol shown during the credits (and on the bell) is [the logo of many 12-Step recovery groups](http://recoveryshop.com/Engraved-Plastic-AA-Logo-Meeting-Sign-p/ms3.htm?srsltid=AfmBOopeaU5rWf7DISri04FKMG7-HupNSs7_4Rpmu3N1cihOIlEOKGHV). \n* The film repeatedly returns to the topic of alcoholism, especially through Justine and Paul/the cop. Paul’s wife even tells him directly to attend an AA meeting. His response — that he’ll only go if he starts to “feel bad” — is a mindset familiar to many in recovery and often a precursor to relapse.  Then after the run-in with the addict, he is immediately ready to hit the bar with Justine.  \n* Gladys, to me, represents addiction itself. She can make Alex’s parents harm themselves or each other, forcing Alex into a caretaker role — a dynamic many children of addicts will recognize. Zach Cregger has even confirmed that Alex’s story is largely about growing up with alcoholic parents.\n* Gladys' ability to “activate” someone with a ritual mirrors addiction triggers — certain situations, cues, or substances that reignite compulsive behavior.\n* Why do we spend so much time following James/the drug addict character?  He has one goal through the whole movie: get money, score more dope. It drives him to walk through the rain, climb fences, break into houses — even distracting him from the horrifying scene in the house. \n* The addict's single-minded drive mirrors the witch’s spell: a hyper-focus that consumes all else.  When someone is under the spell, all they care about is whatever Gladys compels them to do.  \n* The children disappearing is just a circumstantial impact of the spell on the community.  \n\nI won't argue that it's a perfect metaphor or that I'm 100% dead-on, but I definitely think that a fair amount of this was intentional and I'm curious if anyone else saw the same parallels.  \n\n### Top 5 comments and their replies (up to depth 10)\n\n1. I completely agree with you, OP. I'm the spouse of a sober alcoholic and definitely felt the overall theme of the movie was addiction or obsession. \n\n\nI also feel there were hints throughout the movie that Gladys wasn't necessarily human per se, but a humanoid parasite or fungus. Justine is teaching about parasites in her class before all of the kids go missing, Marcus and his husband watching a nature documentary about bugs being taken over by a fungus, etc.\n2. Cregger's collaborative partner [https://en.wikipedia.org/wiki/Trevor\\_Moore\\_(comedian)](https://en.wikipedia.org/wiki/Trevor_Moore_(comedian)), died by falling off of a balcony while intoxicated, so it is not hard to imagine a lot of ideas around alcoholism and drug use seep into the central tragedy of the story.\n\nThere's a lot going on which makes it fun to speculate.  I think ultimately the six characters are selected both for the story, and for how differently consuming the central plot is to the lives of the characters.  They all have different relationships to missing kids, and James role is just being totally oblivious to all of it, which is what makes him actually finding them work so well.  Through it all, there's a lot about drugs/alcoholism, school shooting symbolism and tropes, a narration and framing that is clearly meant to evoke fairy tales, and more. It's just a good movie with a lot going on that makes it engaging for its runtime and through rewatches.\n  - Cregger speaks directly about the alcoholism theme/metaphor in [this interview with The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-features/weapons-director-zach-cregger-movie-1236340007/), for anyone who is interested.\n  - THE CIA KILLED TREVOR MOORE THE CIA KILLED TREVOR MOORE THE CIA KILLED TREVOR MOORE THE CIA KILLED TREVOR MOORE\n    - Can’t believe the CIA killed Trevor by making him suck his own dick\n3. I think this is strong analysis...but I don't really think it's an allegorical film. I think the main central theme is about the ways in which we feel like we should protect children are, in many ways, harmful and detrimental to their actual wellbeing. Alex and the missing children are the looming thread which occupies every chapter of the film, and the only character who actually seems to know the best way to move forward, especially with Alex, faces a really gruesome and dark fate. Paul, who should have been the hero of the story, is a total; jackass who's self destruction compromises his ability to obtain their location from James, another self destructive addict.\n  - Not a directly allegorical film, but highly thematic. Almost every character is an addict. Alcohol, meth, junk food, grief, human souls...\n    - I actually didn't notice how literally everyone was an addict or had some sort of obsessive behavior that manifested in a similar way.  It seems blatant after thinking about Marco.\n  - It's a statement on child abuse as wel, Alex is told not to tell anyone or his family will get hurt, a lot of abusers work in this way to keep the kids to afraid to speak up. Also shows the cops being negligent, teachers could see something wasn't quite right with his living situation and tried to put steps in place to get it fixed law enforcement took everything at face value. \n\nGladys prepping the house and warning Alex to be on his best behaviour when CPS rock up is another thing abusers do\n4. To me, the most singular element of the movie is how it repudiates the genre convention of the protagonist overcoming their personal/emotional issues through the events of the film.\n\nIt's pretty clear the main characters had poor emotional health and toxic defense mechanisms before any of this happened. Justine's empathy and stubbornness *should* read as heroic, but she seems to bottle up her loneliness and frustration until she falls into self-destructive patterns. She goes from *too* sensitive to barrelling through social situations and other peoples' emotions, then retreats and starts bottling things up again.\n\nAt the end of the film, her part in the resolution has nothing to do with her issues. She and Paul weren't hung up on each other, they were toxic/messy people in a very messy situation. She gets no resolution/vindicating conversation with Alex. Other than confirming she's not seriously hurt, she doesn't really even get a final shot in the film.\n\nI also thought this is why Benedict Wong's character plays so funny. He's bone-tired of the town getting increasingly manic and his defense mechanism is just being stubbornly laid back. He actually comes off as borderline insensitive just for existing like a regular person during this tragedy.\n\n## 5. In Sinners, why was it important to show the Juke Joint was doomed?\n\n**Score:** 681\n**Body:** I was struck by how much time the movie Sinners spent driving home the point that the Juke Joint was never going to be a success, regardless of vampires. \n\nEven if Remmick neve showed up, the KKK was coming, and there's no way Smoke and Stack could kill that many white guys \\*\\*and\\*\\* get away with it.\n\nEven if the KKK didn't show up, the Juke Joint would inevitably go broke because too many customers paid with plantation tokens.\n\nEven if the Juke Joint turned a profit, the Chicago gangs were going to eventually figure out who stole from them and come for revenge.\n\nSo, that's a lot of time spent on multiple dooms coming down the line. Why was that important to the story?\n\n### Top 5 comments and their replies (up to depth 10)\n\n1. On top of being pretty historically accurate (black owned businesses were targeted by racist individuals, racist organizations, and systemic forces), it’s about knowing that what you’re creating is doomed and reveling in the joy of that space and that moment anyways. It’s dancing in the face of destruction, because you don’t know what tomorrow will hold but tonight the music is playing. There’s something really touching about that.\n  - I got choked up by the last words of the post-credit scene, after older Sammie asks Stack if that night had been the best night of his life, and he says, &gt;!\"No doubt about it. Last time I seen my brother. Last time I seen the sun. And just for a few hours, we was free.\"!&lt;\n    - Somebody in a different discussion thread also pointed out this tragic detail: Stack *should* see his brother when he looks at himself because they’re twins. But because he’s a vampire, he has no reflection.\n\nJust adds another layer of heartbreak to the whole thing.\n      - Yes, that's a great observation! 😢\n      - Damn, I never thought of that. That's so tragic\n    - That post credits scene had me bawling\n2. Because it’s a showcase for how the system is rigged against Black folks to fail. If it isn’t some mythical creature, it’s gonna be the racist monsters. If it isn’t some racist monster, then it’s system that’s designed to keep the working class poor (some of the sharecroppers didn’t have actual money to pay to get in the get in the joint) that’ll get them. It’s sad and true\n  - Exactly. It’s a horror movie about racism with some vampires for flavour, not a horror movie about vampires.\n3. I think the point was to show their joy, resilience, and community in the face of that overwhelming doom. It's very much a \"we will persevere\" story. They didn't just give in to the status quo, they pushed for progress and their own place in the world. \n4. It's a tragedy. It shows humanity's resilience in the face of darkness, the ability to still find joy and community together. Everyone knows it's doomed, but they decide it's worth it anyways. That's what it means to be human.\n\n---\n\n"}