{"content": "# Top 5 posts from r/MovieSuggestions day\n\n## 1. A movie that will make me FEEL\n\n**Score:** 94\n**Body:** Looking for movie recommendations about movies that have made you feel, particularly movies that are simply portraying human life. What I mean by this is films that portray everyday life but are nonetheless able to make you feel an immense sense of grief, anger, nostalgia, happiness, etc \n\nSome movies that I have watched that were like this are “Manchester by the Sea,” “Ladybird,” “Under the Same Moon,” “The Florida Project,” “Perks of Being a Sunflower,” “Memories of Murder”\n\nOpen to all suggestions!! I’m just trying to watch something that truly makes me feel (: \n\n### Top 10 comments and their replies (up to depth 10)\n\n1. Big Fish\n\nSimon Birch\n2. Life is beautiful\n3. Dead poets society \n\nMy girl\n4. The Holdovers\n  - “There's nothing new in human experience, Mr. Tully. Each generation thinks it invented debauchery or suffering or rebellion, but man's every impulse and appetite from the disgusting to the sublime is on display right here all around you. So, before you dismiss something as boring or irrelevant, remember, if you truly want to understand the present or yourself, you must begin in the past. You see, history is not simply the study of the past. It is an explanation of the present.\"\n5. The Fountain (2007)\n6. Big Fish\n7. Me before you\n\n\nSecondhand lions\n8. Mr. Holand's Opus broke my shit down. I cried like a baby. I was 25ish when it came out.\n9. About Time\n\n## 2. Movies you love/like that you never get to recommend on here?\n\n**Score:** 34\n**Body:** Maybe it's because it's really weird, or from another decade or language. Maybe because only certain people would like the movie, I don't care the reason.\n\nMovies like Coherence doesn't count, since it is a movie that gets recommended on this site, and it's one I have watched already.\n\nI'm wanting more obscure recommendations.\n\nI don't care the genre, decade, or language.\n\nIf there are certain triggering warnings (mostly rape), please let me know ahead of time.\n\n### Top 10 comments and their replies (up to depth 10)\n\n1. Whale Rider (2002)\n2. Ghost Dog \n\nForest Whitaker in a modern Samurai/Mobster drama . Just watch it! Great soundtrack too ♡\n3. Uproar in Heaven - animated mainland Chinese movie from the 1960s about the Monkey King. I think someone even uploaded it to YouTube.\n4. The Norwegian film Good Boy is a great horror comedy/drama about a man and his best friend-who is a grown man in a dog suit, who constantly acts like a dog. Super weird, creative, and really blew me away.\n5. A Woman Under the Influence. The plot is meandering. The acting is almost improvised. John Cassavetes at his best imo.\n6. Jean de Florette\n1986 ‧ French\n7. Tai-chi Master (1993). If you like kung fu or martial arts this is a treat (prime Jet Li + Michelle Yeoh btw)\n8. Barton Fink  \nBroadcast Signal Intrusion  \nCome True  \nDelicatessen  \nFinal Fantasy The Spirits Within  \nMimic  \nOut of Africa  \nRare Exports A Christmas Tale  \nThe Elephant Man  \nThe Good, the Bad, the Weird  \nThe Wiz  \nVesper  \nWings of Desire\n\nEdit: Prospero's Books\n9. Hedwig and the Angry Inch, the soundtrack is amazing and its definitely not a classic musical. It will surprise you with how emotional it gets\n10. Being There. Harold and Maude. Both directed by Hal Ashby.\n\n## 3. Movies about parents with evil kids\n\n**Score:** 33\n**Body:** I grew up loving the film The Good Son starring Macaulay Culkin and I was wondering if there are any good recommendations of films like that? Even if it’s supernatural in nature in the film I’m interested in it! Documentaries work as well!\n\n### Top 9 comments and their replies (up to depth 10)\n\n1. We need to talk about Kevin. Truly fucked up.\n2. The Bad Seed (1956)\n  - This is still so fun. Man, I miss the Turner Classic Movies channel\n3. The Omen\n4. [Orphan (2009)](https://www.themoviedb.org/movie/21208)\n5. Mikey (1992) \n\n\nBrightburn (2019)\n  - Second “Brightburn”. Underrated gem IMHO.\n6. We Need to Talk About Kevin (2011)\n7. The Lost Boys (1987)\n8. Brightburn (2019)\n\n## 4. Bruce Willis - Death Becomes Her\n\n**Score:** 35\n**Body:** After watching a recent news interview I decided I should get into some Bruce Willis. Having not watch any of his work as an adult I contemplated Die Hard, The Sixth Sense, The Fifth Element. But ultimately decided on Death Becomes Her. Due to it coming up in a lot of reddit discussions.\n\nI really enjoyed it.\n\n I'm not a big fan of action movies. So I'm not sure what I should watch next. \n\n### Top 9 comments and their replies (up to depth 10)\n\n1. 12 Monkeys\n  - Possibly his best work\n2. Pulp Fiction. He’s also great in Quentin Tarantino’s segment in Four Rooms. 👌🏻\n3. Unbreakable is in my top ten films of all time, that's probably Willis' best role.\n4. Some of my favourite bruce willis film are \n\nRed\n\nGlass\n\nUnbreakable\n\nSin city\n\nLucky number slevin\n\nLast man standing \n\nDie hard\n5. The whole nine yards\n\nThe fifth element\n\nHudson hawk\n\nStriking distance\n\nUnbreakable \n\nThe sisth sense\n  - The whole nine yards is an excellent comedic Bruce Willis performance.  I love him in that movie.\n6. I’d suggest his old TV work. Moonlighting.\n7. Die Hard, Pulp Fiction, then the Sixth Sense. Yes, Die Hard is an action movie - but such a good one and Bruce carried it so well.\n8. Blind Date\n\n## 5. Movies I can fall asleep to? I have nights where I need something going in the background or I can’t relax.\n\n**Score:** 27\n**Body:** Unlike most people, I usually need some sort of media going or I won’t turn off the light and go to sleep. It’s usually an audiobook, podcast, documentary, or a TV series I’ve watched a million times. But I’ve been in the mood for a movie lately. I have most streaming services as well as several British-genre ones.\n\nMy wish list:\n\n—Oddly, I like comedies. They entertain and make me smile, distracting me so I can “accidentally” fall asleep.\n\n—No big explosions/stimulating music/etc\n\n—Relies on dialogue more than visuals, so I can close my eyes and listen a lot\n\n—No emotional triggers (the usual: no fatal diseases, dogs dying…)\n\n—No romance genre (including romcom and historical smut LOL)\n\nAll suggestions appreciated!\n\n### Top 9 comments and their replies (up to depth 10)\n\n1. The best things to fall asleep to are things you’ve seen many many times. It keeps your subconscious comfy cause there are no surprises and you can lull.\n  - Very true. Once, during a stressful period before finals I was watching Sleepless Seattle, Mamma Mia, and When Harry Met Sally on repeat. It would help me calm down and focus if I had it on in the background.\n  - Great way to explain it! My go-tos have been The Good Place, Ghosts (BBC version is best, but US is fine too), and HIMYM.\n2. Moonrise Kingdom (2012)\n\nWhat We Do In The Shadows (2014)\n\nDownsizing (2017)\n3. Christopher Guest movies: Waiting for Guffman, Best in Show, A Mighty Wind, etc.\n4. I have to sleep to a movie every night so I completely understand what you may need and have a few suggestions.\n\n1. Almost any Adam Sandler movie.\n\n2. Almost any Disney/Pixar/DreamWorks animated movie.\n\n3. The Princess Bride\n\n4. Hitchhikers Guide to the Galaxy\n\n5. Matilda\n\n6. Secret Life of Walter Mitty\n\n7. My Cousin Vinny\n\n8. Big Fish\n5. I like the Ocean’s trilogy for a comfort background. I’ve seen them dozens of times &amp; while I love George Clooney I can listen and not watch. I’m usually asleep within 30 minutes. \n\nFYI: I read somewhere online several years ago that the BBC shipping report was good to help people fall asleep. I tried it &amp; it works. You can find lots of those videos (no ads) on YT.\n6. Young Frankenstein\n\nGalaxy Quest has been my favorite comfort movie for years. \n\nHeartbreakers (2001) with Sigourney Weaver, Gene Hackman and Jennifer Love Hewitt is a fun anti-romcom.\n7. Captain Ron (1992)\n8. Bigfoot documentaries. It’s 90% people out in the woods whispering into the camera.\n\n---\n\n# Top 5 posts from r/moviecritic day\n\n## 1. Do you think the father was justified in killing the basement man in War of the Worlds (2005)?\n\n**Score:** 1555\n\n### Top 7 comments and their replies (up to depth 10)\n\n1. Id say so. He was definitely compromising their security and secrecy down there, and he was kinda starting to creep on the daughter a little, plus he was just a straight wackjob\n  - Tim Robbins is so great\n2. Guy escapes from Prison only to be killed by Tom Cruise during an alien invasion.\n  - Guy survives Vietnam only to find out the government tested a combat drug on him, only to find out he actually died, only to join the Film Actor’s Guild and get burned to death by Team America at Kim Jong-il’s palace.\n3. The son was an asshat.\n  - Yes but also felt like a perfect portrayal of a teenaged son who is pissed at his legitimately dickish/disinterested father.\n4. One dies or they all die\n5. Justified? Yes.\n\nIt wasn't handled as a throw-away event either. Tom Cruise's acting in this movie is very good. Despite being typically cast as an action hero, here he plays a scared father pushed to the edge in many scenes. He didn't want to kill that guy, and it was hard for him to take.\n\nEdit: typos\n  - I worked in a movie theater when this was out, and people were skeptical of seeing it. \"I'm not really in the mood for an action movie\". I made sure they were aware it was sci-fi horror and that actually got quite a few people interested. A lot of people thought it was another Independence Day.\n6. I don't expect people to act rationally during an alien invasion.\n\n## 2. Can’t wait\n\n**Score:** 463\n\n### Top 7 comments and their replies (up to depth 10)\n\n1. Weird just watched Sideways and wondered whatever happened to Haden Church's career\n  - He's kind of funny in Tires\n    - I liked him a lot in Smart People, and of course Wings.\n  - If you haven't seen it, he's brilliant in the series Divorce opposite Sarah Jessica Parker, that was only a few years ago.\n\n\nTerrific in Killer Joe too.\n2. They facetuned tf out of Jeremy Renner\n  - Can't even find him wtf\n3. I was certain Daniel Craig was Mads Mikkelsen on the poster.\n4. Nice, been loving this series.\n5. Bond and Moriarty? I'm in\n6. I loved both of the other movies - genuinely excited for this.\n\n## 3. Why did I watch this damn movie 😭😭 little Dakota Fanning I still can’t believe what an amazing little actress she was and Sean Penn sir acting was out of this world.\n\n**Score:** 480\n**Body:** I AM SAM 2001\n\n### Top 5 comments and their replies (up to depth 10)\n\n1. She seemed almost weirdly precocious. What kid could be so expressive and emotional so early? Really good actress\n  - Lowkey the best child actress of all time, she acted circles around A listers before middle school. Her sister is the better actress as an adult, though.\n2. Simple Jack belong to us now\n  - THIS IS FLAMING DRAGON\n    - Okay, Flaming Dragon, Fuckface...\n  - You will need a binding resolution from the UN intervento get me to stop raining hell fire upon you\n3. The Academy would not concur.\n  - Went home empty handed…\n    - Violated Kirk Lazarus's first rule.\n4. Mr. Penn looks like Tim Robinson here. Or I guess Tim Robinson looks like 2001 Sean penn\n\n## 4. Have you ever walked out of a movie in the theatre?\n\n**Score:** 380\n**Body:** Went to see “Epic Movie” back in the day when it was in theatres. Made it about 15 mins and couldn’t take any more and walked across the hall to see something else. Don’t remember which movie we watched instead.. but that was the only time I ever walked out of a theatre \n\n### Top 7 comments and their replies (up to depth 10)\n\n1. I'm an in-it-to-win-it kind of guy. Even if the movie sucks, I'm not leaving. I'm still there for the popcorn and perhaps a little nap. I've carved out a couple hours for my day at this point and I'm not rescheduling.\n  - I was like this with video games as a kid. I paid good pocket money to rent my video game and I'm damn well playing it, even if it's terrible \n2. Almost walked out once. I got tickets to see Star Wars Ep. III when it came back to theaters this year. I had the entire theater to myself, which I thought was odd, until the movie started playing in Spanish.\n\nFortunately, I stuck it out, with the half pint of whiskey I had smuggled in, and had one of the funniest times I have ever had at the movies.\n\n\"Eres mi hermano, Anakin!\"\n  - That’s hilarious. Was it at least subbed in English? 😂😂\n    - Nope, I'd seen it so many times before that I really didn't need them, and the Spanish voice actors were superb. \n\nAll in all, 10/10.\n3. I feel like if you go to Epic Movie, you must know what it is before ya walk in.\n  - I agree ... it has the word \"movie\" in the title.. surely this was an indicator that it was going to suck a set of hairy, King Kong sized nuts. Any movie with movie in the title is an automatic no for me for this exact reason.\n4. No, I’m a stay and suffer through every minute kinda girl.\n5. I loved the Max Payne games, and my friend had never played them. We went to see the movie opening weekend. I hated it because it wasn’t faithful to the games, but stuck it out because I thought he was enjoying it on its own merits. He hated it because it was hot garbage, but stuck it out because he thought it must be more enjoyable to a fan of the game. We both wanted to walk out, but stayed for the other person.\n\nThat’s the closest I’ve gotten.\n6. I walk out of a lot of movies.\n\n  \nI try not to, but I always end up having to pee at some point.\n\n## 5. This scene from Battle of the Five Armies, made me lose my mind\n\n**Score:** 368\n**Body:** There are other ridiculous scenes but this one was nuts.\n\n### Top 3 comments and their replies (up to depth 10)\n\n1. I remember being in the theatre watching this and I couldn’t help but laugh I was in such disbelief. Then the romance part on that ice mountain right after was so fucking embarrassing too.\n  - \"Why does it hurt?\" \"Because it was real.\"\n\nFuck me...\n    - “Why does it hurt?”\n\nBecause it wasn’t in the books\n  - Oh no not the bloody awful love plot that got shoehorned in. At first I thought Legolas was just pissed at the writing.\n2. The barrel fight scene in *The Desolation of Smaug* was pretty terrible too.\n  - That was the very moment I stopped caring about the Hobbit Trilogy \n\nAs a lifelong fan of the Ralph Bakshi animated Hobbit movie (ETA: *whoops, Rankin and Bass. It’s been a few decades since I was a kid lol*) and absolutely mad about the LOTR films, it was not a fun realization\n    - The animated Hobbit movie wasn’t Ralph Bakshi. He did the animated Lord of the Rings, not the Hobbit\n      - Shit, you’re absolutely right. I meant Rankin and Bass\n    - It wasn’t when the goblin king got stabbed comically when he was supposed to be scary?\n  - yea the xray feature on amazon prime was all over that scene about how that’s *not* what would happen if a person was going down a river in a barrel like that\n\n---\n\n# Top 5 posts from r/TrueFilm day\n\n## 1. Is Hollywood really dying?\n\n**Score:** 169\n**Body:** I keep seeing people say “hollywood is dying” and honestly I’m starting to wonder if it’s true. It feels like every other week there’s news about box office bombs like endless reboots and sequels nobody asked for and audiences just not showing up like they used to. Streaming has completely changed how people watch movies and a lot of the hype that used to surround big releases just isn’t there anymore. On top of that so many people complain that hollywood has lost its originality. It’s either superhero movies, remakes or giant CGI spectacles that all feel the same. Meanwhile a lot of smaller and more creative projects are either getting buried or ending up on streaming platforms where they don’t get the same attention.\n\nBut then again hollywood has been “dying” in people’s eyes for decades and it always seems to adapt somehow. So is this just another phase or are we actually watching the decline of the hollywood machine as we knew it?\n\n### Top 7 comments and their replies (up to depth 10)\n\n1. I work(ed) in the entertainment industry in LA. Yes, it is. Most of us are out of work when we were working very steadily before. A lot of production is moving out of LA. Staff on tv shows is being cut to an unsustainably small amount of people. Anyone who doesn't live in LA and doesn't have any ties to the entertainment industry doesn't know what they're talking about. Unless you experience it or hear countless tearful stories from your friends, you wouldn't really know what's going on right now.\n2. Depends what 'dying' is defined as?\n\nIn general Hollywood still has a lot of power but it's on the wane, the rise of Asia and tax incentives outside of the USA has made a real impact. We see Asia being a real powerhouse with Manga/Anime from Japan, TV/Films from Korea and China starting to see a real rise in the domestic market for China made films/media.\n\nYou also see a massive cut in work in America, Netflix is pushing more money over to Asia for new productions instead of America. The audience want Asian media &amp; it costs less to make, it's win win for the money men.\n\nStill at the same time Hollywood has a lot of power/money, it's going to be a long time before it's lost relevance.\n  - If you go look at the stuff on Netflix right now, SO MUCH of it is done overseas.\n\nI mean, it used to be 5% of Netflix.  It's got to be closer to 25% now.\n    - Netflix streaming  used to be 95% NBC/FX/AMC content + movie sequels. Then the networks realized they could sell their own catalogs and the remaining cheap content licenses are foreign.\n    - Yeah, and their most successful show is Squid Game from South Korea.\n  - A consequence of streaming further operating as \"global\" companies. Hollywood has long tried to appeal to international markets, but the streaming model &amp; companies that own them have essentially delivered it to its logical end: the U.S is simply a smaller audience than many other parts of the world. The companies here are making more shows for other countries and less for our local audience.\n3. Hollywood isn’t dying. It’s bleeding out under corporate control and cultural change.\n\nStudios have been absorbed by corporations that care only about quarterly returns. That shift siphoned off the artistry. Not gone entirely, but the default mode is product, not film. The aim is to capture dollars, not move people.\n\nCulture shifted too. Theaters used to be the place. Now they’re a luxury. A ticket, popcorn, and soda can run fifty bucks. That’s not inflation alone. Those numbers are baked in by deals between studios and theater chains. On top of that, people are trained to expect the pause button and home setups that look sharper than what a lot of theaters can deliver.\n\nAnd then there’s the theater experience itself. Phones glowing, people talking, constant distractions. Immersion dies in that setting.\n\nAs for superhero movies, they’re not the core issue. Every era had its wave: musicals, westerns, gangster flicks. The real problem is volume without care. When the market floods itself with interchangeable product, audiences check out.\n\nSo no, Hollywood isn’t dying. It’s just stuck in a loop of self-cannibalization, feeding shareholders while training audiences to stay home. The machine still hums , but its pulse is weak.\n4. From an Australian who mostly watches foreign films…. Hollywood seems to make two types of films these days: Superhero films / remakes of older IP like Jurassic World, and auteur Oscar bait biopic stuff. It’s all so boring. I recently watched an independent film called The Mastermind that was deeply flawed and awfully paced and was written, directed and edited by the Auteur Kelly Reinhardt. Seems like you need to reach a certain level before you’re considered a “genius” and then you get Carter Blanche to make whatever you like. Obviously there are exceptions like A24 stuff, but these are not generating the kind of box office money that films like Kill Bill etc were generating 20 years ago. As much as an evil bastard Harvey Weinstein was, there’s a massive void in Hollywood for the type of films Miramax would produce.\n5. I think great things are coming out all time. Post covid the pendulum has seemed to have swung back to the movie side from tv in terms of whats better. Now how much support these movies are getting is a bit of a debate. The big piece of information the public doesnt get is how well these movies do on vod. I suspect better than we think because comments get made. Robert Eggers said The Northman broke even a few months after that hit vod. Soderbergh said this year that Black Bag will eventually be okay. \n\nA24 did Sorry Baby and Eddington poorly this year. I loved both of them but their release dates were horrible. I dont know exactly what the right answer is but I think its better than the doom and gloom articles let on.\n6. It’s not looking good. Ticket sales are at an all time low, which means theaters aren’t making money at the concessions. And if theaters permanently, then Hollywood can’t pay anybody working on their movies and sets. It’s a dark future down the line.\n\n## 2. A revisitation of 3 Women\n\n**Score:** 16\n**Body:** Around 9 years ago, when I first started exploring cinema, I was immediately intrigued by surrealism, both by its propensity to be creative in different ways than just normal expressionism and for the unsettling atmosphere it can create. This came about because the first true “art house” film I ever saw was Eraserhead, it’s very stylized depiction of reality being unlike anything I had ever seen before in any art form, forget cinema. This led me to exploring other surrealist works soon after, including Buñuel, and later, this movie.\n\nPrior to seeing this, I had little knowledge of Altman. In fact, this may have been the first movie of his I ever saw, if only for the fact its similarities to Mulholland Drive and other female focused Lynch movies has been widely noted, which made me more curious to check it out than his more notable classics like Nashville or the Long Goodbye. At the time, I loved it for the way it depicted fusing perspectives and the aforementioned unsettling atmosphere. It made me interested in exploring the rest of Altman’s work and he soon became one of my favorite directors ever. \n\nSince then, I have continually held this film in high regard, often claiming it as my favorite of his works, even without repeat viewings. This especially made me nervous to revisit it, as I was scared my naturally changed perspective from growing older would no longer get much out of a film that had resonated with someone who was basically a different person. But the thing about changing your perspective on life is that you can also come to appreciate something differently from when it first came to you. I’m very glad to say this is what happened this time, as I loved this film just as much as before, but for new reasons.\n\nI think what stuck out to me this time, beyond the fused perspectives and characters of the film, was how it utilized wetness and dryness. Most of the film takes place in dry, arid areas, where life seems to be about snuffed out and people are going through the motions without knowing they’re already halfway to the grave. The most iconic image of the film, outside of the mirrors and doubling reflections, is that of Sissy Spacek gazing into an empty swimming pool that she then enters. It’s easy to say that “something feels missing” at this point, but I think a more accurate assessment would be that there is just a total lack of anything. It’s deserted not just physically, but spiritually and emotionally. I don’t think it’s a mistake that the few depictions of water in the film are associated with rejuvenation and resurrection. The old folks home shows this early on, as they give the clients time to soak in water to feel better in the communal pool. When Spacek’s character attempts suicide in their apartment’s pool, she is reborn a few scenes after with a new personality. Water also ties the women together throughout the film, as Altman often overlays fish tanks on their faces to indicate their connection. \n\nWhat I’m driving at here is that I think Altman is saying that, if Nashville was America’s march into death while we all act like everything is fine, 3 Women is showing that America is already dead. No one seems to have much to live for except for getting up and going to work, which is likely why Spacek latches on so much to Duvall. She’s trying to assimilate to her personality because she lacks one, because the society she lives in lacks one. It’s a depressing notion but isn’t this sort of relationship not a little reminiscent of parasocial relationships in real life? Or really, any kind of obsessive relationship? I hesitate to say codependency, but if you pay attention, the signs of that are there too, especially after the suicide attempt, when Duvall gets so concerned about Spacek that it nearly becomes her entire life. It’s hard not to sympathize with Spacek for this reason; she’s basically been given nothing in life and been expected to make herself something with it.\n\nI still do wonder about the role of the third woman and what her significance is. Given that she doesn’t play too much of a role in these story it’s hard to say what exactly she is supposed to represent, but I think there are two ways you can look at it that aren’t mutually exclusive. 1. She’s sort of a matronly figure that spiritually rebirths both Spacek and Duvall and 2. She’s a goddess of some sort who came to the mortal realm and has no specific meaning other than to create a sense of magic in the film. I think both readings are equally valid, and as I said not mutually exclusive. \n\nSuffice to say, this has remained one of my favorite Altman films, and I highly recommend you see it if you haven’t already. And if you have seen it, watch it again because it rules.\n\n### Top 3 comments and their replies (up to depth 10)\n\n1. What struck me revisiting *3 Women* is how much it feels like Altman made his own version of *Persona*, but filtered through the desolation of small-town America. The shifting identities aren’t just surreal flourishes - they feel like a survival strategy in an environment where individuality has already dried up. The “third woman” then reads less as a literal character and more as the ghost of a role model, the absence that shapes the other two.\n  - Couldn’t agree more.\n2. I love 3 Women. To this day, it feels like the closest a film has come to representing what dreams are actually like (fitting because it literally came to Altman in a dream). There's something so eerie and illogical about it all, but it still captures this full authenticity and truthfulness. There are so many brilliant lenses to view it through.\n\nI may have to disagree with your take on Nashville, though. I've always been of the opinion that the ending of that movie is not wholly pessimistic. Yes, there's obviously a lot of awful things going on, but I never had the feeling that Nashville was really a full-on tragedy. The big death at the end of the film was definitely prophetic about our current celebrity and gun culture, but I also think by having everyone join in and sing, Altman is portraying American Resiliency as much as he's portraying our ignorance and distractibility. To me, painting it as \"America's March to death\" ignores a lot of the positive traits of humanity that are on display in those closing minutes.\n  - That’s a fair take on Nashville, even if I do read it as more negative. He was a humanist after all, and Nashville is maybe the most humanist movie of them all (idk what could be more humanist, at least in America). I think the rest of the movie is better for showcasing the positive traits of humanity tbh\n    - I agree. I definitely think there are many cynical elements to the ending, I just think the \"star is born\" moment of Albuquerque finally getting the microphone and singing It Don't Worry Me can be viewed as the idea of something positive coming out of a tragedy. Similarly, I've always viewed Haven's heroic \"This isn't Dallas\" moment as a hint that the egotistical country star we've watched throughout the movie is actually more of a 'man of the people' than the faceless Hal Phillip Walker broadcasting nonsensical platitudes from a roving van.\n\nIt's my favorite film of all time so I have a lot of feelings on it. As you've said, Altman was a humanist and so I struggle to think he chose to end his magnum opus with something akin to \"look at all these easily mollified sheeple.\"\n3. Just say 3 Women for the first time last month, and it was really fascinating. Definitely feels like required viewing if you're at all a fan of Altman. While it undoubtably echoes Persona, it also reaches forward in influence to things like Mulholland Drive, making a pretty interesting continuum of influence.\n\nI'm looking forward to rewatching again at some point, because the plot and stylistic turns between the acts were pretty hard to process on a first viewing. I kind of wish we just had a whole movie with the hangout vibe of the first act! But still it's worth it to get to the psychological horror and dream states of the later acts.\n\n## 3. Caught Stealing\n\n**Score:** 8\n**Body:** (this started out as me just wanting to hear what people think of it and then it sort of turned into a review? Idk how many people have had a chance to see it yet. An extremely vague spoiler behind spoiler tags)\n\nSaw this last night and had a blast. One of my friends didn't like it so much and compared it to Tarantino; my other friends loved it and compared it to Guy Ritchie, while repeatedly exclaiming over how different this was for Aronofsky. I don't *quite* agree with any of these points, but I think they triangulate toward something I agree with. \n\nThis movie has a very 90s combination of action, crime caper humor and silliness*, and not just \"grit\" but actual harshness and grossness. In that latter part it's still very Aronofsky; I think everyone's just surprised that he's capable of having fun. As a couple of critics have pointed out, some of his consistent themes are addiction, obsession, and performance under pressure (successful or not), and all of those are right in the center of Caught Stealing. What's surprising for him is that the protagonist &gt;!actually escapes those burdens!&lt; by the end.\n\nBut the movie is also very intelligently constructed in how it uses those elements. It starts out relatively serious and sad while it's establishing characters and stakes, and gradually turns into more of an action cartoon/farce as it goes along. The way flashbacks play through the whole movie until the incident they show enters the present at the end really sums up the tonal progression, but I can't really describe what I mean by that without spoiling. I think this gradual tonal shift also helped with the element of freshness and surprise - some twists I saw coming, some I didn't, and it was easier to be surprised when the groundwork had been laid in a different tone than we were in by the time the twist came to fruition.\n\nThis all requires the lead actor to be able to carry a few different tones and moods while keeping the character consistent and helping the audience buy in with his reaction to the situations he's in through the whole series of shifts, and Austin Butler did that pretty seamlessly. (I'd say that as Hank gets less incredulous and confused about his situation and more determined to get through it and sure that he will, the movie gets less grounded, and that balance works.) The performances in general are good (special shout-out to Carol Kane), but he is really showing star power here - tbh that's probably also a big part of what had me feeling the 90s, this type of emotional and physical performance being balanced on presence/charisma. I hope mid-sized movies that allow him to shine like this keep coming.\n\nAll in all, a great time at the movies, definitely recommend.\n\n### Top 4 comments and their replies (up to depth 10)\n\n1. As a fan of Guy Ritchie's style of action-comedies, I was really hyped for this one after watching the trailer, but was really dissapointed after watching it. The plot felt dumb and uninspired and the juggling of serious and silly scenes never clicked and felt really jarring. To it's credit, it's a well shot movie and Idles made a great soundtrack. It had it's funny moments too, but after it ended I was more bored than entertained.\n2. Yeah I saw I last week and really enjoyed it. Are there flaws in the film? Probably, but I don’t really care. It reminded me of After Hours by Scorsese, it had a great cast, Austin Butler is a bonafide movie star. Masterpiece? Obviously not. A well spent, fun two hours at the cinema? 100%. I’d love more films to come out at this sort of level\n3. Pulling off this mixture of extreme violence and comedy is like walking a tightrope. Arguably the film falls off the tightrope with the death of a specific character. It plunges everything else into a darkness that can not be escaped.\n4. Saw it yesterday. It was really good and lots of fun, I thought of Coens and Safdies while watching it. I liked how cruel it was. I wonder if Aronofsky plans to adapt the 2 other books from the trilogy. I would certainly like to see that.\n\n## 4. Save The Green Planet or Bugonia first?\n\n**Score:** 6\n**Body:** Those of you who have seen both 2003’s Save The Green Planet and the recent Bugonia, which one should I watch first? I believe Bugonia is a remake, don’t know how accurate it stays to the original and I dont want to google as I’m very weary of spoilers, as you might have noticed. I’m a fan of weird Japanese cult films as well as Lanthimos, Stone and Plemmons! What should I do? \n\n### Top 4 comments and their replies (up to depth 10)\n\n1. Save The Green Planet is a Korean movie, not Japanese. \n\nAnd I usually watch remakes first, that way I don't have to think \"but that wasn't like that in the original?!\" and take it as is. Then I watch the original, which then becomes a separate experience.\n  - I do this with books if I haven't read them.  There's a better chance of me enjoying a movie, and then enjoying a book more.  \n\nI don't have a lot of situations where I enjoyed a book, and then wasn't bugged by the changes the movie made.\n    - I'm the same way with adaptations. Most of the times I'm annoyed by the changes, so I try to watch the adaptation first. Even the Lord of the Rings movies annoyed me for a while, though I learned to love them in time.\n2. I think it's always good to see the original before seeing the remake. I haven't watched Bugonia, but from the trailer, it looks different. Starting with Emma Stone's character, who in the original is a man. I don't remember if Jesse Plemons' character had an assistant in the original, it's been a while since I saw it and my memory is terrible.\n  - He has an assistant that he manipulates but it's a woman\n  - You think I should watch The Thing (1951) before watching the 1982 classic???\n\nMy point I disagree. In cases where a remake tells a story much better, I think it’s fair to suggest watching the remake first so the twist is not ruined by a lame film. Idk anything about Bugonia though\n    - The 1951 Thing is not lame.\n    - Yes, why not? Before seeing \"Scarface\" from 1983, I saw the original from 1932, which was also by Howard Hawks. They are two different and very good films. \n\nI think that if you are going to watch a film knowing that it is a remake and you have the option of only watching the original beforehand, watch the original first. I don't believe that one film ruins the other. This week I'm going to watch Kurosawa's \"High and Low\" because I really want to see Spike Lee's remake, I'm going to take the opportunity to remove it from the watchlist.\n    - Yes the original is also a classic\n3. It doesn't really matter I guess because it will not change your views on either films big time. Also, it does not matter whatsoever how accurate the remake might be. What matter is the director's vision for his film, wether it's a remake or not. \n\nI'm definitely not a big fan of Lanthimos (I can say that I only moderately like Dogtooth), but I really like Save the Green Planet. So I will definitely watch Bugonia, just to see how this story translates in our actual world. This might be interesting.\n\n## 5. What's the worst Hollywood studio story you know?\n\n**Score:** 13\n**Body:** So I was doing some research in to music record labels and how they conduct business. \n\nBasically there was an artist back in the 2010's, I don't know if you guys know him, his name was Lupe Fiasco. Anyways, he was signed to Atlantic Records and dropped a track that they had nothing to do with but they wanted in on the action because was previously signed with them. Lupe said no. However, the record label then discovered his new song used a sample from a woman's song who lived in the Philippines. So the record executives flew to the Philippines, found the lady, paid her off for her rights, then contacted Lupe and basically told him he had to pay them now.\n\n  \nThis was some Italian mafia shit\n\nAny similar Hollywood stories?\n\n### Top 2 comments and their replies (up to depth 10)\n\n1. Screwing over someone on music rights? Man, that wouldn't even nudge the needle in Golden Age Hollywood.\n\nMost of the Wizard of Oz main cast was sickened, injured, or physically/psychologically tortured in some way, and that was just a single production!\n\nSome actors were subject to having their entire private lives managed by the studios (gay actors required to marry studio-picked \"beard\" wives to more convincingly stay in the closet, pregnant talent pressured into abortions, you name it).\n  - Yeah, “worst” is definitely not the word for this story when Harvey Weinstein exists…that being said, in its own right it’s interesting as hell, so no shade to OP! I’d put it under “impressively petty” more than anything.\n2. The head of Paramount literally concealed a murder [https://www.amazon.com/Tinseltown-Murder-Morphine-Madness-Hollywood/dp/0062242199/ref=tmm\\_pap\\_swatch\\_0](https://www.amazon.com/Tinseltown-Murder-Morphine-Madness-Hollywood/dp/0062242199/ref=tmm_pap_swatch_0)\n\n---\n\n"}