{"content": "## 1. True Romance is a 1993 American romantic crime film directed by Tony Scott and written by Quentin Tarantino. This movie has a all star cast unmatched by most movies.This is one of my all time favorite movies ever made. (from r/FIlm)\n\n**Score:** 205\n**URL:** https://www.reddit.com/gallery/1n200oc\n**Body:** A comic-book nerd and Elvis fanatic Clarence (Christian Slater) and a prostitute named Alabama (Patricia Arquette) fall in love. Clarence breaks the news to her pimp and ends up killing him. He grabs a suitcase of cocaine on his way out thinking it is Alabama's clothing. The two hit the road for California hoping to sell the cocaine, but the mob is soon after them.\n\n### Top 17 comments and their replies (up to depth 25)\n\n1. So great with an absolute all-time duet between Hopper and Walken\n  - Duet is a hilarious way of putting it.\n  - And you’re a cantaloupe\n2. You’re so cool.\n3. He must have thought it was white boy day.\n4. It makes a great double feature with Wild At Heart (1990), btw\n5. That makes you half eggplant 🍆\n  - \"You're a cantaloupe.\"\n6. It’s got one of the best fight scenes ever too with Arquette and a young James Gandolfini. I love showing this to new people since for some reason still a ton of people have never heard of it. Also, this is my first time ever seeing that first poster somehow. \n7. I like how they put Brad Pit on the poster (3rd image) even though he has like two lines total\n  - Don't condescend me, man, I'll fucking kill ya\n8. Absolutely. Brilliant movie\n9. One of my favorites too!\n10. Great movie - awesome cast\n11. After a movie, I like to go have a piece of pie and talk about it.\n12. You're an actor, motherfucker, act!\n13. Bonnie and Clyde &lt; Natural Born Killers &lt; Bout de Souffle &lt; Badlands &lt; True Romance\n\nWhat else we got that fits?  Maybe Buffalo 66?\n14. Just one of the all time best movies ever ever\n15. My favourite love story\n16. Great movie\n\n## 2. Need happy, fun romance movie or show suggestions (from r/romancemovies)\n\n**Score:** 38\n**URL:** https://www.reddit.com/r/romancemovies/comments/1n57tjx/need_happy_fun_romance_movie_or_show_suggestions/\n**Body:** I’ve been watching the summer I turned pretty. But I find it to be too heavy and depressing at times. I need something fun and uplifting. \n\n### Top 17 comments and their replies (up to depth 25)\n\n1. If you haven’t watched it yet, Never have I ever on Netflix :)\n  - I have. It’s really good.\n    - Also the hating game (really good enemies to lovers)\n2. Nobody. Wants This (on Netflix), You’ve Got Mail )on YouTube)\n3. Set It Up (2018), The Holiday (2006), Revenge of the Bridesmaids (2010), Dash and Lily (2020)\n4. Easy A\n\nThe Duff\n\nPushing Daisies - TV show\n\nFrench Kiss\n\nClueless\n  - I loved pushing up daisies\n5. XO Kitty!! Tsitp makes me depressed for days lol. I’m still recovering from the new episode \n6. Imagine you and me 2005 british movie\n  - OMG this is where I first fell in love with Lena Headey!\n7. Down with Love (2003)\n8. North of North, a quick fun binge watch on Netflix.\n9. America's Sweethearts (2001). Billy Crystal alone already makes this movie so fun to watch lol\n10. Desperate housewives!!\n11. Hart of dixie\n12. The kissing booth trilogy!!\n13. Crazy Little Thing Called Love (2010), My Sassy Girl (2001), Cinderella Closet (2025), Shooting Stars (2023), My Love from the Star (2013), The One That Got Away (2018), Meant to Be (2017), Because of You (2015), I Give My First Love to You (2009)  💅 \n14. Along Came Polly (2004), Love Actually (2003)\n15. About Time, French Kiss, Overboard (1987), Moulin Rouge, Flipped (2010), Passengers (2016), Dirty Dancing\n16. A Perfect Story on Netflix\n\n## 3. Ano ang favorite mong romance, family, at horror movies noong 2000s? (from r/pinoypopculture)\n\n**Score:** 51\n**URL:** https://i.redd.it/wmwjqor3yjlf1.png\n\n### Top 20 comments and their replies (up to depth 25)\n\n1. Romance - Because of You, Let the Love Begin, \n\nFamily - Anak\n\nHorror - Sukob\n\nBarkada Movie - Trip and Jologs\n2. family - hating kapatid\n3. Got 2 Believe - Claudine and Rico\n\n\nIn my life - Vilma, JL and Luis\n\n\nFeng Shui - Kris\n4. Family: Mano po 1 saka Tanging Yaman\n5. Horror - Spirit Warriors 1 &amp; 2\n6. Romance: NOW THAT I HAVE YOU\n7. Yughhn🙂🤮🙂🙂🙂🤮🙂🤮🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🙂🫨🙂🙂🫨🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊🌊☺️🫨☺️☺️🌊☺️🌊🌊🫨🫨☺️🌊🌊🌊🌊🌊🌊🌊🌊🥳🫨🥳🌊🥳🥳🥹🌊\n8. Romance - A Very Special Love\n\nFamily - Tanging Yaman\n\nHorror - Feng Shui\n9. Moments of love 🫶🏻\n10. horror - feng shui\n\nsobrang nostalgic. one time kami lang ng kapatid ko sa bahay (7 and 10 yrs old) pinanood namin to tas tumakbo ako palabas, tapos sumunod sya. naiwan yung bahay na nakabukas walang tao. pag uwi ng lola namin pinagpapalo kami pareho.\n11. Romance : Yung Trilogy ng A Very Special Love &amp; Forevermore (nila Kristine H. &amp; Echo)\n\nHorror : Feng Shui &amp; Wag Kang Lilingon\n\nFamily : Four Sisters and A Wedding &amp; Way Back Home\n12. family - Tanging Yaman\n13. Shake Rattle and Roll. Ung Before ha, scary talaga hahahha\n14. Romance - Unofficially Yours\n\nFamily - four sisters and a wedding Shonnet Vuhyag supremacy!\n\nHorror- kwaresma\n\nTo add lol: Comedy - Moron 5! Ewan ko bakit tawang tawa ako jan nakakainis! Merong joke na di ko makalimutan sabi sa moron 5: aba nandito na pala ang grupo ng mga bobo! \n\nSumagot isa sa kanila: hoy ah! Wag na wag mo kaming matawag na GRUPO! 😂😂😂\n15. Spirit Warriors\n16. romance- dahil mahal na mahal kita (1998)\nfamily- tanging yaman (2000)\nhorror- feng shui (2004)\nbarkada movie- pare ko (1995)\n\nhahaha may mga 90’s e\n17. Anak\n18. Romance - A Very Special Love\n\nFamily - Tanging Yaman\n\nHorror - Pa-siyam\n19. Tanging Yaman\n20. Romance - Mula sa puso, My Amnesia Girl\n\n\nFamily - Magnifico\n\n\nHorror - Feng shui hindi ako makapunta ng cr pag madaling araw 😭😭\n\n## 4. Movies with cannibalism + romance (from r/MovieSuggestions)\n\n**Score:** 5\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n57m7g/movies_with_cannibalism_romance/\n**Body:** I known about Bones and All, but I want more movies with this thematic, a love story with cannibalism!\nIf you know a good movie about cannibalism, you may suggest it as well!\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. Raw (2016)\n2. Definitely Fresh (2022)\n3. The cook the thief his wife and her lover\n4. Eating Raoul\n5. 'Trouble Every Day' (2001).\n6. There's a North-East Indian movie called Aamis, also released under the name Ravening (2019), that's literally this. Do yourself a favour and DON'T READ ANYTHING (no trailers) about the movie before watching for maximum enjoyment. I saw it in theatres and people's jaws couldn't close hours after the movie ended.\n7. FRESH\n8. Bones and All\n9. Emanuel and the Last Cannibals\n10. Criminal Lovers (1999)\n11. Cannibal! The Musical (1999) is a must watch cult film IMO. Has Matt Stone and Trey Parker (of South Park) and there’s a love interest (in a funny way) between the MC and his horse.\n12. Fresh  !\n13. Holy shit how are there so many movies that fit this category\n14. Not a movie but please watch “Hannibal” the series\n  - Mods are about to remove this I’m guessing, since it’s a t..v show, but OP yes! Hannibal has such a weird, unique romantic undercurrent to it. Very intimate and strange.\n15. Hills Have Eyes (1977)\n16. Second Eating Raoul.\n17. Ravenous ?\n\n## 5. Give me your BEST romance tv shows/movies with the best chemistry (from r/movies)\n\n**Score:** 3\n**URL:** https://www.reddit.com/r/movies/comments/1n6ubdw/give_me_your_best_romance_tv_showsmovies_with_the/\n**Body:** I'm looking for the best tv shows or movies that you have seen with insane, palpable chemistry. Things that come to mind are: Kate and Anthony in Bridgerton, Daphne and Simon in Bridgerton, Me Before You, Nick and Jess in New Girl, Normal People. A romance that literally gives you butterflies everytime you watch. Thanks in advance!!!!\n\n### Top 17 comments and their replies (up to depth 25)\n\n1. Nobody Wants This has some of the best chemistry I’ve ever seen on screen\n  - I actually despise romcoms but the Seth Cohen fan in me had to give Nobody Wants This a shot and I was OBSESSED.\n  - Agreed!  Veronica and Logan also have incredible chemistry in Veronica Mars so it's definitely a strong suit for Kristen Bell!  (Less so in The Good Place, although that is also a sweet relationship)\n2. The Before Trilogy\n3. Fleabag season two\n4. I mean the Addams family is pretty much the defining movie for a loving couple with great chemistry. But if you wanted to go with something a little less obvious there's always the mummy. The good one. The one we like to talk about compared to that other one we don't like to talk about\n5. Nothing’s quite topped S2 Bridgerton Kate and Anthony for me. Even the 1996 Pride and Prejudice doesn’t do it. I’m still searching for more of that kind of ‘you vex me’ style love/hate attraction thing. \n\nAm following this thread closely!\n6. David and Patrick  from Schitts Creek are my favourite tv couple. \nFlea bag and the hot priest had great chemistry.\n7. Brittany runs a marathon (movie) has surprising chemistry \n\nBusiness Proposal (kdrama) is pretty good\n\nSchitts Creek (season 3 and 4)\n8. Pride and Prejudice, always. \n\nUmm... Enola Holmes, weirdly enough.\n\nI love Along for the Ride. Underrated movie.\n\nI also love Sense and Sensibility. It's my favorite movie, but you have to wait a minute for the payoff you want.\n9. Crash Landing On You (GOAT'd K-drama)  \nSerendipity  \nAtonement  \nA Walk to Remember  \nThe Wedding Singer :)\n10. Chiming in for later Parks and Recreation: first season was nightmare but some great couples later (except Ron, unfortunately, not much chemistry there) \n\nPatrick\n  - LOVE parks and rec!! Ben and Leslie are the cutest\n11. Normal People\n12. Adjustment Bureau\n13. My lady Jane is a bit camp, but the main couple has insane chemistry.\n14. True beauty. Kdrama.\n\nThe romance in that is cute and fluffy.\n15. Interview with the Vampire (AMC)!!!!\n16. Based on your examples, I’m going to go with movies with heterosexual couples (though I think some of the best romances I’ve seen have had queer couples). Here are some of my favorites:\n\n* Titanic\n* In The Mood For Love\n* La La Land\n* The Silver Linings Playbook\n* Together (this one is also a horror lol)\n  - Definitely open to shows that revolve around queer couples!!!\n\n## 6. Suggest some romance movies (from r/TeenIndia)\n\n**Score:** 2\n**URL:** https://www.reddit.com/r/TeenIndia/comments/1n4t2kc/suggest_some_romance_movies/\n**Body:** So, I was about to give up on love after my breakup but I basically live and breathe romance so I'm back to being a lover girl. Tell me some romance movies fellow teens. \n\n### Top 5 comments and their replies (up to depth 25)\n\n1. Lala land dekhlo phirse give up kar doge🙏🙏\n2. Your name\n3. 10 things I hate about you \n\nClassic and a good time\n4. ![gif](giphy|mZQtwECa6v22Ka1yu1)\n\nThis you ?\n  - Yup that's me\n    - Me too\n      - That's great, haven't met a lot of boys who love love\n        - Hopless romantic artist poet icon 🫰🏻\n          - Hehe I don't write but I do love to read\n            - Well isn't that serendipitous\n              - Yes\n                - Someone that loves love might say this is like a movie moment that can lead to  me telling you poems\n                  - Well yeah but we also gotta be careful with our little hearts and who we trust. Loving love makes us sensitive, and then heartbreak feels like our backs broke along with our heart\n5. All The Bright Places\n\n## 7. Married couple romance movies? (from r/tollywood)\n\n**Score:** 3\n**URL:** https://www.reddit.com/r/tollywood/comments/1n4mwyd/married_couple_romance_movies/\n**Body:** Guys I'm looking for movies which deal with a married couple dealing with samsaram, this is my new favorite genre. Please give me list.\n\nThank you.\n\n### Top 15 comments and their replies (up to depth 25)\n\n1. Thanks for posting on r/Tollywood! Don't forget to check that your post abides by our rules!\n\nSimilar Subs to check out:\n\nr/TeluguMusicMelodies : Subreddit to discuss and suggest telugu music \n\nr/tollywoodmovieclips : Subreddit to post all clips from telugu movies.\n\nr/Ni_bondha : Telugu Meme community\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/tollywood) if you have any questions or concerns.*\n2. [deleted]\n  - The only right answer\n3. - Pelli pustakam\n- Mister Pellam\n- Edurinti Mogudu Pakkinti Pellam\n- Bandhuvulostunnaru Jagratha\n- Baama Maata Bangaru Baata\n- Pellaina kothalo\n- Radha Gopalam\n- Kithakithalu\n\nA few I remember. Inka chaala unnaay which I can't remember\n  - I see fellow Rajendra 80-90s fan 👍🏽\n4. Sankranthiki vastunam \n\nEnjoy pandagoo\n5. Pretty much 90s family genre. You can look up soundarya / venky / jagapathi baby movies they did lots of them.\n\n1990s Telugu Family Drama Movies\n\n\t1.\tSubhalagnam (1994)\n\n\t2.\tSuryavamsam (1998)\n\n\t3.\tPelli Chesukundam (1997)\n\n\t4.\tRaja (1999)\n\n\t5.\tAavida Maa Aavide (1998)\n\n\t6.\tAmmoru (1995)\n\n\t7.\tSeetharamaiah Gari Manavaralu (1991)\n\n\t8.\tMaavichiguru (1996)\n\n\t9.\tEduruleni Manishi (2001) (borderline 90s/2000s)\n\n\t10.\tAayanaki Iddaru (1995) (Optional addition if you like serious family drama)\n  - Jagapathi Baby 🥵\n    - Typo but man has aged gracefully !\n6. Check mithunam movie once. I think Mithunam movie has the content you want. It's a sweet and a wholesome movie. Has beautiful conversations between husband and wife characters played by S. P. Balasubrahmanyam garu and Lakshmi garu.\n\nhttps://preview.redd.it/bll8w0wqebmf1.jpeg?width=196&amp;format=pjpg&amp;auto=webp&amp;s=4e9372e736ff276ce1f1d287dd2ea169473f7b1f\n7. Pellaina kotthalo(2006)\n8. Mani Ratnam's Alai Payuthey\n9. Anthaku mundhu aa tarwata\n10. Pushpa 2\n11. To a certain extent, Happy. There is also raja rani and I guess Sakhi.\n12. Pelli pustakam\n\nRadha gopalam\n\nNot telugu but Bangalore Days\n\nMissamma(Bhoomika, Laya, Sivaji)\n\nPellaina Kotthalo\n13. Ammo Okato Tareekhu 💀\n\nFinancials gurinchi manchi lesson istadhi\n14. https://preview.redd.it/po4bkvp0pdmf1.png?width=311&amp;format=png&amp;auto=webp&amp;s=0a0f5980d52ae6877599120237bffb0d5387fa36\n\n## 8. Are there any artsy romance movies about first love between adults? (from r/MovieSuggestions)\n\n**Score:** 4\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n57k3f/are_there_any_artsy_romance_movies_about_first/\n**Body:** Most first love romances are between teenagers, most adult romances are between hot people with previous partners, and most romance films are cheesy collections of cliches. Are there any artistic romance movies between two adults where one or both of the people involved has little to no dating history? Bonus points for scenes of them opening up emotionally. Columbus was close to what I want (and I love it) but it's not a romance. \n\n### Top 20 comments and their replies (up to depth 25)\n\n1. Punch Drunk Love\n2. 40 year-old virgin\n3. Rocky (1976) is a good depiction of this tbh. Sure it’s a boxing movie but it’s also a love story\n4. The 40 Year Old Virgin - Steve Carrel - Lots of vulgarity but great comedy about a title character that has given up on ever being able to have a relationship because of several embarrassing misfires as a younger man.\n5. Tons. By adults do me mean like people in their 20s or people in their 60s?\n  - 20s up to late 30s maybe\n6. Amelie\n7. Harold and Maude\n8. The Wind Rises\n\nBefore Sunrise, maybe - not sure if the characters have never experienced romantic love before, but one of the themes of the film is discovering a deep connection with someone on a philosophical/spiritual level \n9. Safety Not Guaranteed (2012)\n10. I love Elsa &amp; Fred w Shirley Maclaine + Chris Plummer. Recently Kevin Klein in My Old Lady. Harry Connick in the netflix movie Find Me Falling; Nonnas as well.\nStanley &amp; Iris is great too.\n11. Really Love (2020, 2021 larger release) - I get the feeling the girl has never had anyone. The guy might have slept around.\n12. What Happened Was (1994). I won't spoil it but it's pretty much what you're looking for\n13. Joker: Folie à Deux\n14. I'm A Cyborg But That's OK\n15. like crazy\n16. Kajillionaire, if you don’t mind a sapphic romance.\n17. Torch Song Trilogy\n18. A New Leaf directed by Elaine May\n19. Fallen Leaves (2023)\n\nCome As You Are (2019)\n\nSpring (2014) \"romance horror,\" but it has a beautiful love story\n\nStranger Than Fiction (2006)\n\n## 9. If you like gothic romances with vampires, I have something for you: Byzantium Movie (from r/fantasyromance)\n\n**Score:** 90\n**URL:** https://www.reddit.com/gallery/1n4nz7v\n**Body:** A new Dracula movie was recently released, and i was researching the protagonist. (If you liked Dracula 2025, it's the same actor). I discovered he'd already filmed a vampire movie. AND LET ME TELL YOU. What caught my attention was that in this film the protagonist is a female vampire; they're almost always male vampires. So i hoped with all my heart to see a romance between a female vampire and a male human. The protagonist is a melancholic, solitary, and reserved vampire woman. The plot revolves around two vampire women who spend their time running and moving to survive. The romance is strangely calm at first; she doesn't seem interested, but in reality, she's a person who becomes very detached due to the constant need to move. The guy is simply gorgeous. The actress is also very beautiful, it feels like a Role reversal relationship, which pleasantly surprised me. If you're someone who likes very beautiful and feminine men, you should watch the movie. He's very demonstrative, unlike her. I'll just say that in one scene HE ASKS HER TO BITE HIM and in another scene THERE IS A VAMPIRIC KISS WITH BLOOD. KISS.WITH.BLOOD. If you know of any other similar movies or books, please recommend them. \n\n\n\n### Top 7 comments and their replies (up to depth 25)\n\n1. * Please be mindful of our sub rules ([short version](https://www.reddit.com/mod/fantasyromance/wiki/index/rules) or [detailed version](https://www.reddit.com/r/fantasyromance/wiki/index/rules/detailed_rules/)) and treat others with kindness. \n* You can use the [✨Magic Search Button✨](https://www.google.com/search?q=site%3Areddit.com%2Fr%2Ffantasyromance&amp;sca_esv=62677d62e4a19e1b&amp;ei=NcVuaLK6Oo68wPAPqJrSiA0&amp;ved=0ahUKEwjyqMrFw7COAxUOHhAIHSiNFNEQ4dUDCBA&amp;uact=5&amp;oq=site%3Areddit.com%2Fr%2Ffantasyromance&amp;gs_lp=Egxnd3Mtd2l6LXNlcnAiIHNpdGU6cmVkZGl0LmNvbS9yL2ZhbnRhc3lyb21hbmNlSNI8UKYDWME6cAF4AJABAJgBhwKgAacRqgEGMjQuMS4xuAEDyAEA-AEBmAIAoAIAmAMAiAYBkgcAoAeSCbIHALgHAMIHAMgHAA&amp;sclient=gws-wiz-serp) to search for previous posts.\n* Call upon RomanceBot by wrapping a book title and author in curly brackets {} to get a summary from [Romance.io ](www.romance.io)\n* If you get an especially helpful comment, you can pin it by clicking on the comment and selecting \"spotlight.\"\n\nThanks, and happy reading!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/fantasyromance) if you have any questions or concerns.*\n2. ON THE LIST!! This sounds so refreshing and good. I recently saw Dracula (2025) and thought it was amazing. It’s so wacky and doesn’t take itself too seriously, but what shined through most was this actor’s performance. I get that it got some flak because the contrast btw wacky Willy wonka vibes and very serious romantasy vibes was too jarring, but his acting was truly on par with Gary Oldman’s. Highly recommend Dracula 2025 for his performance alone (it screams gothic romantasy longing)\n  - I haven't seen that movie yet (Drácula), but from what I've seen he looks like a pretty dramatic and pompous vampire, so i understand they think he is like Willy Wonka. In this film, he's more ordinary and very open about showing interest in the protagonist. There are scenes where he looks very adorable because he has dreamy eyes.\n3. That sounds amazing, thanks! Saoirse Ronan *and* Gemma Arterton as vampires - I can see why you call them beautiful :)\n\nAlso, I did an image search on Caleb Landry Jones, and it's wild how he can look like several different people.\n  - I was surprised too, from what I've seen he has a great acting range. The film has a gothic aesthetic and rhythm, even though it is not a period film.\n4. Thank you!!\n5. It’s one of my favourite movies. Fantasy mixed with noir.\n  - Me too!!!! It’s such a dark horse, under the radar amazing film. Incredible director and incredible cast, so I honestly don’t see how it doesn’t get more attention.\n6. Im sorry, but he looks like a 14 yo boy in these pictures.\n  - The vampire woman became a vampire at 17, they are college students\n7. Harrrrd yes, thank you!!!\n\n## 10. Any Thriller/Romance Movie recommendations?? (from r/MovieRecommendations)\n\n**Score:** 7\n**URL:** https://www.reddit.com/r/MovieRecommendations/comments/1n5s7hm/any_thrillerromance_movie_recommendations/\n**Body:** Hiii so I just watched Strange Darling; I thought it was good, had some cliche dialogues but overall I enjoyed it.\n\nThe thing is I so desperately was rooting for it to be a love story between the two protagonists. A weird crazy kind of love story line I guess.\n\nSo can anyone recommend any thriller, romance or just romance or just thriller idk but similar to the protagonist in SD but they actually fall in love\n\nAm I making sense?\n\n### Top 12 comments and their replies (up to depth 25)\n\n1. Natural Born Killers\n\nTrue Romance\n\nKalifornia\n  - Three solid choices.\n  - Thank youuuuu \n  - True Romance is a goated movie. Young Brad Pitt, James Gandolfini, and an all time Gary Oldman performance. “I eat the pussy, I eat the butt. I eat every motherfuckin thang”\n    - It’s just one of the best. The epitome of cool.\n2. I'm not sure if it's what your looking for but have you seen The Voyeurs?\n  - I haven’t! Thanks I’ll check it out! \n3. Solaris (2002)\n4. Vanilla Sky\n\nThe Lobster\n\nThe Illusionist\n\nSide Effects\n5. Safe Haven\n\nPerfect Sense\n\nThe Handmaiden\n\nLabor Day\n  - Safe haven is so underrated. The twist 😭\n    - Exactly 💯\n6. Greasy strangler\n7. Mr. &amp; Mrs. Smith\n\nBrad Pitt and Angelina Jolie's chemistry is fantastic in that film.\n\nRomancing the Stone \n\nMichael Douglas, Kathleen Turner, Danny DeVito\n8. Gone Girl \n\nThe Crush \n\nFatal Attraction \n\nThe Boy Next Door \n\nObsessed \n\nSleeping with the Enemy \n\nNatural Born Killers \n\nWild at Heart\n\nBasic Instinct \n\nOriginal Sin \n\nChloe\n\nUnfaithful\n\nThe Loft\n\nAddicted\n\nBound\n9. Mr and Mrs Smith\n10. Shattered is a great thriller romance flik\n11. If you want that intense, “crazy love” vibe like *Strange Darling*, check out *True Romance*, *Mr. &amp; Mrs. Smith*, *Cruel Intentions*, or *Sea of Love*  \nThey mix thriller tension with a dark, passionate romance that actually develops between the characters\n12. Gone girl.. old but really good\nThe girl on the train\n\n## 11. Everyday romance movies from me: A Rainy Day in New York (from r/RomComs)\n\n**Score:** 0\n**URL:** https://i.redd.it/x2t4irok20mf1.jpeg\n**Body:** So, it's almost Fall and I want a movie that suits this season of the year 🍂🍂\n\nBeautiful but naive Ashley grew up in a small town in Arizona. She studies journalism at a prestigious college and comes to New York for the first time to interview a famous director. Her boyfriend Gatsby, who grew up in Manhattan, dreams of showing the girl the most romantic places of his favorite city, but during the trip it constantly rains, and the heroes do not yet realize that this day will change their lives forever. Ashley goes to interview a director who is going through a serious crisis, and inadvertently attracts the attention of the actor and screenwriter of his film. Meanwhile, Gatsby decides to visit his brother and runs into his old friend ...\n\n### Top 5 comments and their replies (up to depth 25)\n\n1. If you are seeing this and don’t know much about Woody Allen, do a little reading before declaring yourself a fan. Please.\n  - I feel like Woody Allen sucking as a person is very evident in the script of this film. Every line of dialogue to, about or by a woman just reeks of a lack of respect for them as people. Unfortunately, I fucking love Midnight In Paris.\n    - [removed]\n      - There are still actresses defending Weinstein, I don't know why you think any of these remarks say anything about Woody Allen\n        - [removed]\n  - [removed]\n    - Well he s*xually assaulted a minor so I feel like that’s reason enough\n    - What all have you read? The part where he sexually molested his adoptive daughter? The part where he started a sexual relationship and married his ex-gf's daughter?\n2. If you liked this, you'll love midnight in paris\n  - One of my favourite films. Fantastic soundtrack and absolutely beautiful locations.\n  - Thank you, i’ll watch it\n3. This is the first time I’ve ever heard of this movie - I thought this was fake lol.\n4. Enjoyed it more than I thought I would!\n5. Where can I watch it?\n  - On prime, apple tv+ and netflix\n\n## 12. The subreddit is #5 in the Romance Movies and Series category (from r/jellyshippers)\n\n**Score:** 35\n**URL:** https://i.redd.it/2wi7yk52rtmf1.jpeg\n\n### Top 5 comments and their replies (up to depth 25)\n\n1. i was surprised to see how high the subreddit is on the ranking! no subreddit is perfect but as someone who has been on reddit for years, this is my favourite subreddit. no matter how it ends, i had a lot of fun here and enjoyed discussing the series with everyone. i was already a fan of belly and jeremiah from the book but it was never a favourite ship of mine, my main memory about the books before the show aired was that jeremiah got done dirty. but i think the show did a great job of improving their dynamic from the book and then a lot of the posts and analyses on this subreddit made jelly into one of my all time favourite ships ;)\n  - This sub is by far one of the nicest places on Reddit. Everyone is so respectful, and the comments are such high quality. I can't believe how insightful everyone here is, plus it's just fun. We must have some awesome mods putting in a lot of work!\n2. We're small but mighty. I'm shocked there's 4k people in here now, I found the sub before it had 50 members lol\n  - Same here. Proud of our little sub ❤️\n  - im not sure when i found this place, i remember lurking for a while before joining and commenting🤔 maybe early 2024\n    - I was busy getting downvoted on the main sub then the user who created this one dropped a comment linking it. I've never looked back. But that was, I think, almost 2yrs ago to the month\n3. Ahhh! I love it!! 😍\n4. The fact that I’m in 3 of the subreddits shown 😂 also yay!!!!\n  - which 3?\n5. That's so strange.\n  - i checked and the ranking is based on how many people visit a subreddit every 3 days. not only is it very active right now but also a lot of lurkers 👀\n\n## 13. Everyday romance movies from me: Sweet November (2001)&amp;Green Card(1990) (from r/RomComs)\n\n**Score:** 24\n**URL:** https://www.reddit.com/gallery/1n2j7xf\n**Body:** Sweet November: \nA workaholic executive, and an unconventional woman agree to a personal relationship for a short period. In this short period she changes his life.\n•I really like this movie, because i love when a person changes when loves🥰🥰\n\nGreen Card:\nJust to obtain a green card to hold onto his job, George, a Frenchman gets into a sham marriage with Bronte, a New Yorker. However, the charade eventually becomes reality.\n•I watched this movie a long time ago and it's still funny to me))\n\n\n### Top 2 comments and their replies (up to depth 25)\n\n1. The ending of Sweet November is heart shattering\n2. TIL that keanu and charlize had a movie together 🤯 OP do you know where I can watch it?\n  - this movie is on netflix, apple tv+, maybe on amazon but i'm not sure\n    - I only have netflix and its unavailable in that platform 🥲\n      - Oh, really? Idk then\n      - I think it is currently only available for rent on Apple TV and prime as opposed to being viewable with your subscription. It is worth renting in my opinion :)\n        - Ok will do thaf thanks for the reply\n          - You’re welcome! Enjoy!\n  - Two movies together. They also play a married couple in the thriller The Devil’s Advocate with Al Pacino.\n    - Great! Will add it to my watchlist as well\n      - This one is free on Tubi too!\n\n## 14. Romance Show/Movie With Confident Leads? (from r/kdramas)\n\n**Score:** 5\n**URL:** https://www.reddit.com/r/kdramas/comments/1n5572v/romance_showmovie_with_confident_leads/\n**Body:** Hey all, like the title suggests I am looking for a watch that does not have the typical overconfident + shy timid characters dynamic, instead they can approach each other from the very beginning!\n  \nHave enjoyed:  \nLove To Hate You   \n25 21  \nMy Dearest Nemesis  \nArthdal Chronicles  \nTouch Your Heart  \n20th century girl  \nDrawing Closer  \n\n  \nDid not enjoy:  \nBrewing Love - shy boring lead  \nLovely Runner - started off so heavy I had to stop  \n(Any love triangle tropes)  \n  \n  \nOpen to series &amp; movies, any streaming platform thanks!\n  \n\n  \n\n  \n\n\n### Top 7 comments and their replies (up to depth 25)\n\n1. Her Private Life\n\n![gif](giphy|Pan6Lp0anEu6DgC5xb|downsized)\n\nAlso:\n\n* Crash Landing on You\n* Dali and the Cocky Prince\n* The Legend of the Blue Sea\n* It’s Okay, That’s Love\n* My Roommate is a Gumiho\n  - I will look, Gumiho suggested multiple times here will probably try its pilot tonight!\n2. Love Scout\n3. **Alchemy of Souls** \\-- The leads butt heads in S1 due to both having strong personalities. While the FL in S2 is a bit timid, she is still very direct in her romantic pursuit. \n\n**Mr. Queen** \\-- The leads have a hilarious dynamic because they are operating from two very different sets of expectations. \n\n**Chicago Typewriter** \\-- The initial dynamic is the ML being rude and the FL refusing to put up with it\n  - Loved naksu &amp; janguk in both seasons but especially 1!\n    - I hate how they made her the damsel-in-distress in p2.\n4. My Roommate is a Gumiho\n5. You might enjoy Business Proposal!  It’s very silly and tropey and isn’t afraid to poke fun at itself, and the meeting of the two leads is as far from shy as you can get 😅\n  - I've seen it. Best pilot episode to possibly any series🤣\n    - A little off piste then but have you seen Healer?  Two confident characters there, although it’s somewhat murkied by various necessary aliases etc due to the plot\n6. I might be biased since I love both So Ji Sub an Shin Mina bit I really love Oh my Venus.\n7. Just finished King the Land and loved the leads, super healthy relationship, confident and badass duo. \n\n## 15. What romance movies / tv shows did you watch this week? Aug 31 (from r/romancemovies)\n\n**Score:** 4\n**URL:** https://www.reddit.com/r/romancemovies/comments/1n4l1vu/what_romance_movies_tv_shows_did_you_watch_this/\n**Body:** **Rate and review what you've recently watched**\n\n### Top 5 comments and their replies (up to depth 25)\n\n1. I watched the last season of Upload. A meh 3 stars.😢\n  - I didn't even know it came out a few days ago. The lack of marketing is surprising.\n    - &gt; The lack of marketing is surprising.\n\nNot so much. a 4 episode season that they took 2 years to release means they just didn't want to have an unfinished show (which would cost future views) in their library rather than indicating commitment IMHO.\n      - It's only 4 episodes?? What!? If it was a good 4 episodes it would have been great. \n  - Disappointing\n    - Yep. I loved the first season and the second season from episode 4 onwards... SIGH (literally🤣).\n2. **Chungking Express** (1994) (*rewatch*)\n\n**Rating :-**  Solid 8/10\n\n*A WKW classic , i loved how WKW portrays 90s hongkong, and how he showcased loneliness in romantic way. And Christopher Doyle is just amazing . Those low frame rate shot were just aesthetic. Now it's just impossible to even think about ' California Dreamin ' without imagining faye wong dancing to it .*\n3. Firelight (1997) : 10/10\n\nI didn't expect such a high-quality film. Everything is almost perfect for me. Probably Sophie Marceau's best performance. The emotion is very present. The story and the music complete the picture. A big thank you.\n  - Love this film!\n4. *Untamed Heart* starring Christian Slater &amp; Marisa Tomei. \n\nSweet; simple tearjerker romance. \n\nI hadn’t seen it since it was in theaters. I was very surprised to see Stanford Blatch in it. It holds up, too. Very 90s.\n5. Finally finished “Fly Me to the Moon” I would give 7/10. It was cute, but sometimes I wasn’t sure that Channing &amp; ScarJo worked as a couple. Still an easy watch.\n\n---\n\n"}