{
    "ranked_movies": [
        {
            "rank": 1,
            "title": "True Romance",
            "reason": "Extensively discussed and highly praised in multiple threads for its all-star cast, iconic scenes, and unique blend of crime and romance. Frequently recommended as a top-tier film."
        },
        {
            "rank": 2,
            "title": "Pride and Prejudice",
            "reason": "Mentioned as a classic with incredible chemistry between leads, often cited as a benchmark for romance films."
        },
        {
            "rank": 3,
            "title": "The Before Trilogy",
            "reason": "Recommended for its deep philosophical and romantic connection between characters, showcasing exceptional on-screen chemistry."
        },
        {
            "rank": 4,
            "title": "Fleabag",
            "reason": "Highlighted for its intense chemistry in Season 2, particularly between Fleabag and the Hot Priest."
        },
        {
            "rank": 5,
            "title": "Normal People",
            "reason": "Praised for its palpable chemistry and emotional depth, frequently mentioned alongside other top romance shows."
        },
        {
            "rank": 6,
            "title": "Crash Landing on You",
            "reason": "Recommended as a top K-drama with strong romantic elements and great chemistry between leads."
        },
        {
            "rank": 7,
            "title": "Set It Up",
            "reason": "Suggested as a fun, uplifting romantic comedy with good chemistry and a modern take on the genre."
        },
        {
            "rank": 8,
            "title": "The Holiday",
            "reason": "Mentioned as a feel-good romance film perfect for uplifting moods, often recommended in fun romance lists."
        },
        {
            "rank": 9,
            "title": "Amelie",
            "reason": "Recommended for its artistic take on romance and unique storytelling, fitting the request for artsy romance films."
        },
        {
            "rank": 10,
            "title": "Byzantium",
            "reason": "Discussed for its gothic romance elements and unique female vampire lead, with strong recommendations from the fantasy romance community."
        },
        {
            "rank": 11,
            "title": "Natural Born Killers",
            "reason": "Suggested alongside True Romance for its dark, thrilling love story, often cited in thriller/romance requests."
        },
        {
            "rank": 12,
            "title": "Mr. & Mrs. Smith",
            "reason": "Recommended for its intense chemistry and action-romance blend, frequently mentioned in thriller/romance discussions."
        },
        {
            "rank": 13,
            "title": "Sweet November",
            "reason": "Highlighted for its emotional impact and transformative love story, with strong nostalgic appeal."
        },
        {
            "rank": 14,
            "title": "Green Card",
            "reason": "Mentioned as a classic rom-com with a unique premise and charming leads, often recalled fondly by viewers."
        },
        {
            "rank": 15,
            "title": "Business Proposal",
            "reason": "Recommended as a confident, fun K-drama with strong leads and minimal shyness, fitting requests for dynamic romances."
        },
        {
            "rank": 16,
            "title": "Alchemy of Souls",
            "reason": "Suggested for its strong-willed leads and romantic dynamic, particularly in Season 1."
        },
        {
            "rank": 17,
            "title": "Punch Drunk Love",
            "reason": "Recommended for its artistic take on an unconventional romance, fitting the request for adult first loves."
        },
        {
            "rank": 18,
            "title": "Feng Shui",
            "reason": "Frequently mentioned in horror-romance discussions, particularly in the context of Filipino cinema."
        },
        {
            "rank": 19,
            "title": "Tanging Yaman",
            "reason": "Highlighted as a top family romance film in Filipino cinema, with multiple recommendations."
        },
        {
            "rank": 20,
            "title": "A Very Special Love",
            "reason": "Mentioned as a beloved romance in Filipino cinema, often recalled for its charming leads and emotional story."
        }
    ]
}