{"content": "## 1. Seriously, this attempted slander actually makes the movie sound like pure '80s Mel Gibson kino. Sadly... I heard the movie in question (Force of Nature) was still pretty lame though (from r/PoliticalCompassMemes)\n\n**Score:** 1317\n**URL:** https://i.redd.it/ghdh2tbr7bmf1.png\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. The Daily Beast basically lives off slander.\n2. An antisemite and a woman-strangler rescue white people from Puerto Rico.\n\nSounds like the beginning of a great joke.\n  - An antisemite and a woman-strangler walk into a bar\n\nBartender says, \"What can I get you, Mr. Piker?\"\n    - HASAAAAN PIKEEEERRRRRRR!!!!!!!!\n  - If I was ever in Puerto Rico, I would like to be rescued by Mel Gibson, too.\n    - [His sheer aura would probably](https://youtu.be/92yjraROF70?si=y9hnWlgpjCyl271t) [be enough to stun lock assailants](https://youtu.be/4z2STZnOpbI?si=bHUYrvP72EXiDH5D)\n      - Holy shit.\n3. Trigger happy cops? What are they shooting? The hurricane?\n  - [They do in Florida](https://www.independent.co.uk/news/world/americas/hurricane-irma-gun-owners-florida-shoot-down-storm-a7937546.html)\n    - Based and completely-ineffective-pilled\n    - At least the guy admitted he did it out of boredom\n4. Is the hurricane also Puerto Rican?\n  - Hurricanes are inherently racist, didn’t you know? \n5. Gibson is better as a director than an actor\n  - He's crazy but he understands story structure\n    - Hey, don’t call Riggs crazy. He’ll prove you right.\n  - Nah - Gibson was superb as Hamlet (directed by Zefferelli). He is definitely a talented director but sometimes flawed. He directed \"Passion Of The Christ\" horror style - interesting choice - sometimes it worked, sometimes it didn't\n    - &gt; Gibson was superb as Hamlet\n\n\nAgreed, but that's pre-scandal Gibson. \n\n\nI like his acting but I'm trying to think of a post scandal role that I really loved him in. Can't think of anything I hated him in, either, though.\n6. https://preview.redd.it/r33jatw4dcmf1.jpeg?width=736&amp;format=pjpg&amp;auto=webp&amp;s=aa2c8bb6264d26cd6423db280507c7c160ee453c\n7. This sounds like the best movie of all time lmao\n\n## 2. Was talking about Sasha Callie with a friend today and I felt a bit sad what happened to her. I think she was actually really good as Supergirl and would have loved to have seen her in more movies. (from r/DC_Cinematic)\n\n**Score:** 836\n**URL:** https://i.redd.it/6vmsp4q9ztmf1.jpeg\n**Body:** All respect to Milly Alcock but Sasha Callie was done dirty. Gassed up and told she had a ten movie deal only for her performance to get buried in a mess of a film and then quietly shuffled off with the majority of the DCEU cast\n\nAs much as I am sick of multiverse nonsense overshadowing superhero movies, I would be open to her returning as Power Girl\n\n### Top 9 comments and their replies (up to depth 25)\n\n1. At least she got into the movie. If you wanna feel bad for someone, there's the girl who was supposed to play Batgirl.\n  - OUCH you are right, at least she can whip out a bluray and rewatch it\n\nthere's an entire batgirl movie thats just mothballed, including Keaton as Batman! wild to think about\n    - Brendan Fraser was even in that movie as the bad guy, Firefly. Crazy.\n    - Not only she can do that, lots of people consider her to be one of the few bright spots in that film. That's something that should help propel a career forward, even if sequels don't happen, and as Marvel keeps showing us, once you multiverse a bit she can still reprise Kara in the new DCU.\n      - She wasn't even really Kara was she? She was just a straight up gender swapped Superman.\n2. I hope she gets another chance in the DCU like how Jason Mamoa is now going to be Lobo.\n  - She might be a fit for Jessica Cruz\n    - Honestly, this is the answer. I think she'd be great as Jessica\n3. I feel like the odd one out a lot on the internet because I just thought she was fine. She didn't standout to me in any way, really, she was just okay. I neither felt like I needed to see more of her in that character, nor did I feel like she wasn't good in the role. She just did a perfectly acceptable job, in my mind, so I don't really understand it when I see a bunch of praise for her on the internet. \n\nI also don't really think she ever should have believed she had anything even approaching a ten picture deal. Who would have even wanted that?\n  - I think a lot of people who have been signed up to superhero movies have been given outlandish promises recently, Kumail Nanjiani was apparently promised a similar thing with Eternals\n  - Pretty much sums up how I feel, Milly Alcock is a better fit because she has the natural charisma to standout even when she shares scenes with the other top DC characters and can also carry her own movies\n  - I get this completely. I can't praise her performance because:\n\n1. She was barely in the movie (screen time and plot-wise) in the grand scheme of things, and\n2. The role wasn't an especially complex one that would showcase her ability as an actor.\n\nShe did a good job with what was given. But what was given... anyone could've done. Which is to act stoic and angry, strike a pose for some fights, and &gt;!repeatedly die on camera!&lt;.\n\nI do hope she gets more opportunities in her career though. Young actor starting out, gets a seemingly sweet gig as Supergirl. It doesn't work out but she got to be in a superhero movie. And now hopefully things look up.\n  - I agree with you. The character was shallow and the performance was alright. I think a lot of people latched on because, besides Keaton, the rest of the movie was mostly terrible.\n    - &gt; I think a lot of people latched on because, besides Keaton, the rest of the movie was mostly terrible.\n\nThat is truly one of the biggest \"How did this get made\" movies I've ever seen. Like who the fuck thought Ezra Miller would ever be a bankable star in a role like this. His performance in that film is one of the most grating performances I've ever seen in a film and I've seen Little Nicky.\n      - Sunk cost fallacy.\n4. She's not exactly amazing but she's the best part of yhat shitshow. Even Keaton seemed really bored.\n5. Right role, wrong film. Sadly she was a victim of bad timing, with plans to transition the DCEU to the DCU already in progress upon the film's release. For what it's worth, I thought she was one of the better elements of The Flash, which is actually a film I quit enjoy (aside from the terrible CGI). Whilst she did a good job, I think James Gunn's decision to recast and reboot Superman was the nail in her coffin. Id have been happy to have seen her play the role again, but it wasn't meant to be.\n6. I will say this movie proved one thing for sure\n\nIf they make a live action invincible movie she should 100 percent play annissa\n7. \"What happened to her\" was that she got paid a lot of money to play an iconic role in a big Hollywood movie. Let's keep things in perspective.\n8. I am gonna be straight with you, was it unfair what happened to Sasha? Yes, it was but she is still being acknowledged as one of the better parts of that film which is better than nothing. That said, Walter Hamada's plan to use her to replace Superman was always a dumb move, same goes with Batgirl semi-replacing Batman. Both of these characters do not have the same strong appeal as Superman and Batman.\n\nBesides, your idea of using her as Powergirl requires using multivers shenanigans, something Gunn is very much aware has oversaturated in most modern medium, Peacemaker Season Two notwithstanding.\n\n## 3. 9 of 10 RSVP’d children/families “no call no showed” to my daughters 5th birthday party. (from r/mildlyinfuriating)\n\n**Score:** 66210\n**URL:** https://i.redd.it/ur5jx0ivggmf1.jpeg\n**Body:** Parents, and future parents, if you RSVP to a child’s party. Show the fuck up.  If you cannot, communicate you are unable to make it.  \n\nBeing asked for an hour straight “when are my friends showing up?” “Oh there’s a white car! Is my friend in there??”\n\nIS FUCKING HEART BREAKING. \n\nI have seen sad stories like this before and I never thought it could happen to us. It did. It’s horrible.  I just ask that anyone reading this will remember this thread, and be better!! ❤️\n\nFortunately our adult friends at least made an appearance, but none of her pre school classmates came **that RSVP** they would be. \n\n9 of the 10 parents didn’t even let us know they couldn’t not make it!\n\nHonestly this is more than mildly infuriating. But oh well. \n\nShe was surrounded by adults who love her, and everyone was aware of what went wrong so she was smothered with love and affection to try and replace any memories of friends not showing up with that of the adults in her life appreciating and loving her! \n\nWe did our best.  She’s doing better than I am if I am being honest. 🤣 im writing this with her waiting for the popcorn as now it’s movie and popcorn night.  And you bet your ass I built the stupid big doll house someone got her for one of her favorite shows :) \n\nI have to admit, I had the strange urge to buy her a pony! 🤣\n\nPicture: Credit to my mom putting together cupcakes and cookies for the Hello kitty theme :) My wife made an outstanding hello kitty themed party as well. But all those photos had people in them. But if she saw this, and I only credit Mimi with her designs. Oof. I don’t wanna sleep on the couch Fam. Mom and grandma did a great job for my daughter’s party!!)\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. My daughter doesn’t have a ton of friends, and her birthday is January 1st so I’m always terrified this will happen.  I usually give her a choice of birthday party, or a special day (salon, nails, a shopping day). She’s always chose to pamper herself. \n\nI’m so sorry she had to go through this :(\n  - See this was my fear a few weeks ago, that we would need to adjust the expectations. \n\nBut with 10 RSVP that would be coming, we let her know certain people she could expect.  She’s in preschool and has been since she was 2 since mom and I both work. She’s a talkative social butterfly.  So she did want people, and confirmed they’d be there just to not be. :(\n\nA few weeks back we didn’t have any RSVP, and I was ready to potentially change the plans to make the day revolve around her - and not a day of expecting friends to play with. \n\nThat’s what is so aggravating. The plans could have changed!! We just set up at a local park/play ground. \n\nThere were so many other things we could have done.\n    - Tell those other parents that at least 1k people demand answers.\n      - Hah I’m not an emotional guy, and I’m genuinely upset. I don’t have any kind words to say to the parents of these kids.\n        - Just send them the link to this thread!  Also, please tell your kiddo happy birthday! 🎂🥳🎈\n2. This happened to my husband when he was a kid. He still doesn't like even the idea of having a birthday party. I never even met these parents but I'm mad at them 30+ years later because that shit stays with you forever. \n  - I feel for your husband. I'm a 50-year-old guy who this happened to at 6 years old, and I wish I could say it goes away.\n3. My grandmother used to keep a mental black list for people like this. Even at the ripe old age of 86 she remembered every single entry. No one ever came off the list.\n4. A bunch of friends and family did this to my daughter last year.  And her bday is in winter so I rented a hall and made tons of food. So now I'm done. She can pick one friend and I'm taking them for an experience instead.\n  - This is more memorable anyway. You can really make it special. Way less stress too!\n5. This happened to me in elementary school. It’s traumatizing. Kudos to all of you for showing her love and distracting her. Shame on the flakes. Sending lots of love to your baby.\n  - Same happened to me right after I finished 5th grade (2005 or 2006) . Literally invited the whole class and friends who were in other classes and only one person showed up\n    - When my son was in 5th he was invited to a party and I really didn't want to go, recovering from foot surgery. But I'm so glad we did, because he was the only friend who showed up!\n\nI was the girl who didn't have people show up, it hurts, man\n      - My son was invited to a birthday party last year, so 2nd grade, and I am also so glad we went because we were the only ones that showed up too. And the boy was somewhat special needs, which is why I’m assuming none of the other kids showed. The parents even combined his party and his sisters so it wouldn’t be as noticeable that none of his classmates showed. My son didn’t care that he was special needs though, he wanted to go. He even hand picked him out a special gift himself, and cheered him on when he was trying to play basketball. The boys family members were even thanking us all night for just being there.\n        - It’s awful. My daughter is 6 and I really encourage her to go to all birthday parties even though I’m super introverted and I find it hard sometimes. And she is very often the only kid who shows up, or it’s basically her and one other kid, two at most. And these parents are paying all the expenses and putting “no gifts” on invitations, so it’s not like it’s going to cost anyone anything but time. She asked to have a birthday party with friends this year so I gave her the choice between having a party with friends or taking a day trip, luckily she chose the day trip because I don’t have much faith in the parents of her friends.\n          - I’ve been hearing that this is like an increasingly common thing?\n6. Happened on my kid's 5th bday, too. Even family that said they'd be there, weren't. Hours of, \"When are we having my real birthday party, when everyone else shows up to celebrate with me?\" It was heartbreaking. Every single person that didn't show up made like it was no big deal. But it was. Just not to them.\n  - &gt;Every single person that didn't show up made like it was no big deal. But it was. Just not to them.\n\nThis sums it up perfectly. \n\n&gt;Hours of, \"When are we having my real birthday party, when everyone else shows up to celebrate with me?\n\nThis is absolutely crushing. I don't even know you or your kid and I still feel horrible for them.\n7. There’s a reason we chose to not do birthday parties with classmates.\n  - My son watched the movie “Yes Day” and asked for that for his birthday that year. He had so much fun that this is our new tradition.\n\n## 4. Benny Safdie's 'The Smashing Machine' - Review Thread (from r/movies)\n\n**Score:** 2790\n**URL:** https://www.reddit.com/r/movies/comments/1n5u723/benny_safdies_the_smashing_machine_review_thread/\n**Body:** *MMA fighter Mark Kerr reaches the peak of his career but faces personal hardships.*\n\nCast: Dwayne Johnson, Emily Blunt\n\n**Rotten Tomatoes:** [94%](https://www.rottentomatoes.com/m/the_smashing_machine_2025)\n\n**Metacritic:** [79/100](https://www.metacritic.com/movie/the-smashing-machine/)\n\nSome Reviews:\n\n[The Independent - Geoffrey Macnab](https://www.the-independent.com/arts-entertainment/films/reviews/the-smashing-machine-review-dwayne-johnson-b2817883.html) \\- 4 / 5\n\n&gt;This, though, is a story in which winning finally begins to seem very hollow. The real way Safdie puts a chokehold on his audience is by examining Mark and Dawn’s physical and emotional weaknesses in such forensic detail. The Smashing Machine may not provide the pay-offs that audiences expect from more conventional sports movies, but this is the most raw and vulnerable that Johnson has ever been on screen. Once you’ve seen him this exposed, you won’t watch his typical action movie stunts in quite the same way ever again.\n\n[Daily Telegraph - Robbie Collin](https://www.telegraph.co.uk/films/0/the-smashing-machine-review-dwayne-johnson/) \\- 4 / 5\n\n&gt;It’s a classical fight movie that innovates subtly. Maceo Bishop’s nimble photography has the sweat and grit of a vintage muscle flick from the Pumping Iron era, but the score by the experimental jazz composer Nala Sinephro is all swirling harps and breathy saxophones; arguably no piece of music has ever sounded less like a punch in the face. Yet as an accompaniment to Kerr’s battles in and out of the ring, it’s oddly perfect, giving this tough story an unexpectedly sweet and even spiritual edge. Smashing stuff has rarely been such smashing stuff.\n\n[Next Best Picture - Cody Dericks](https://nextbestpicture.com/the-smashing-machine/) \\- 7 / 10\n\n&gt;Dwayne Johnson delivers the best performance of his career as the amiable but troubled UFC champion Mark Kerr. Emily Blunt and Ryan Bader are also excellent in their roles. The screenplay is repetitive and frustrating. Blunt's character is so unlikeable and written with such vitriol that it becomes exhausting to watch her, although Blunt's performance is as good as it could possibly be.\n\n[Variety - Owen Glieberman](https://variety.com/2025/film/reviews/the-smashing-machine-review-dwayne-johnson-benny-safdie-1236503546/)\n\n&gt;Johnson, shifting his whole aspect (he seems like a new actor), invests that silent, moody, hidden side of Mark with a quality of mystery. He gives an extraordinary performance, playing Mark Kerr as a gentle giant with demons that will not speak their name, yet the audience can feel them there; we want to see those demons healed. You might think the key word in the movie’s title is “smashing,” but it’s actually “machine.” Mark is a man who reins in his violence by having constructed his entire self — body and personality — as a controlled engine of demolition. The movie is about how this man-machine becomes a human being.\n\n[The Hollywood Reporter - Jordan Mintzer](https://www.hollywoodreporter.com/movies/movie-reviews/the-smashing-machine-review-dwayne-johnson-delivers-the-blows-as-a-tormented-fighter-in-benny-safdies-gritty-and-downbeat-mma-flick-1236358361/)\n\n&gt;Johnson has rarely played a loser, but he’s always been likable, displaying a massive grin to match his massive pecs in action vehicles that never allowed him to showcase much range. He manages to go deep here without overdoing it, killing the audience with kindness as a benign warrior who suffers from one scene to the next, triumphing briefly in the ring before succumbing to addiction and/or romantic grief. Like Mickey Rourke in *The Wrestler* — a film from which Safdie seems to take a few cues — the actor delivers an intoxicating mix of blood, sweat, tears, protein and total helplessness.\n\n[IndieWire - Ryan Lattanzio](https://www.indiewire.com/criticism/movies/the-smashing-machine-review-1235148509/) \\- 'B+'\n\n&gt;Johnson’s performance is out-and-out wonderful, a beady-eyed fusion of body and spirit that osmoses Safdie’s sensibility to deliver what can’t be disputed as the most layered work of the actor’s career. A vividly contradictory Blunt, funny and sad especially in articulating Dawn’s conflicted response to Mark’s post-rehab emotional about-face during a tense argument, is equally sensational.\n\n[Deadline](https://www.rottentomatoes.com/critics/source/2256) \\- [Damon Wise](https://www.rottentomatoes.com/critics/damon-wise)\n\n&gt;Dwayne Johnson owns the whole thing with his truly remarkable work as fighter Mark Kerr, disappearing so fully underneath Kazu Hiru’s astonishing prosthetics that the opening of the film, presented as contemporary footage from an event in Sao Paulo 1997, looks genuinely like the real thing. It’s that rare beast, a biopic that’s light on the bio and resistant to being a pic. It’s a film about a human being, and its effect is strangely haunting, since Dwayne Johnson seems to do everything while doing nothing.\n\n### Top 9 comments and their replies (up to depth 25)\n\n1. That first review is interesting because in one of their interviews, Blunt and Johnson specifically said they watched a documentary about Kerr and took issue with how Dawn was portrayed so they wanted her to be shown in a better light in this movie.\n  - Not « a » documentary, but « the » documentary about Kerr of the same name.\n    - Yup!  Watched it back in like 2000ish, also had a conversation with Bas Rutten some years later where I asked him about that Kerr and the dynamic with Dawn, and he spoke truth to the “way she is portrayed” in so many words as being accurate to reality.\n2. Happy for Mark Kerr.\n\nInteresting fun fact is that The Rock and Mark Kerr are practically the same age. \n\nDwayne is playing a 20-something Mark Kerr and IRL Mark is just a few years older. \n  - I would absolutely kill for a long form open discussion from the pharmacists, doctors &amp; nutritionists keeping the Rock in the shape he's in at 53\n3. The hierarchy of power in A24 is about to change.\n  - &gt; Iron Claw\n\n&gt; The Smashing Machine\n\n\nWhat sort of cinematic universe is A24 building here?\n    - The A24 Athlete Traumaverse\n  - Can’t wait for Hereditary 2 with Black Adam in it\n  - The head of the table\n4. Good reviews. Looks like the kids aren’t going to her sister’s tonight\n  - You’re the real fighta\n5. It seems whenever the Rock’s popularity takes a hit he is able to successfully pivot back into the people’s good graces. I wonder if this is that pivot\n  - It's the Adam Sandler playbook: Once audiences are tired of your shtick, do a serious indie movie every ten years or so to remind them you can actually act when you want to\n    - Worth mentioning that when it comes to Uncut Gems, the Safdie brothers had to beg Sandler for *years* to take the role and it took Sandler’s wife pushing him to finally agree to it.\n6. Shame that title is now taken and can't be used by the next Wallace And Gromit movie.\n7. It would be nice to have something less fundamentally insane than *Southland Tales* to point at and say, yeah, The Rock can act.\n  - I think he’s rather brilliant in Pain&amp;Gain\n    - Underrated role. Played the buffoon up nicely.\n\nHe’s also funny in both Jumanji films\n8. Excited to see Dwayne \"The Rock\" Johnson, Emily \"Smokin\" Blunt, and Ryan \"The Master\" Bader\n\n## 5. It's sad we never got a Spawn and Batman animated movie or series. Could you imagine if we had Keith David AND Kevin Conroy? R.I.P Kevin Conroy 🕊️ (from r/Spawn)\n\n**Score:** 466\n**URL:** https://i.redd.it/iswm0ys3tslf1.jpeg\n\n### Top 10 comments and their replies (up to depth 25)\n\n1. they never had interest or intentions of ever making and animated movie of it\n2. It would be lame and boring. We leave 50 billion Batman crossovers. Ghost Rider makes much more sense.\n3. We did get an animated Batman and TMNT movie\n4. It'd have been like if Freddie Mercury and David Bowie had been able to perform Under Pressure live\n5. A movie would've been amazing.\n  - Don't even hint at Spawn being in it. Have a Batman trailer and dont even elude to the fact that Spawn is in it. Then, when Batman is outnumber.. Spawn just shows up and BOOM... He's just part of the movie from that point on\n6. I heard that in max payne beta Kevin Conroy did voicing a max in one cutscene\n7. I will be sad if Keith David dies 🥺\n  - *when\n\nAnd I agree. But we can appreciate him while he is still here. Only watched \"They Live!\" myself for the first time recently. Great character he plays there. (:\n8. That would be boss, and it's never too late(aside from the obvious RIP). I'm still hoping we get Spawn in the Invincible animated series too!\n9. Can you imagine the legal maze?, Todo would need to agarre tonsign tons of things away, AND that Is image origin story, años, we've never had a good story with these two, who could write it?\n  - well since theres 3 books of these 2 why not get the 2 writers that wrote those? and i dont think there would be a legal maze since they already did this 3 times before.\n    - They are terrible\n    - also how dare you those 3 books had great writing\n      - I should know, I was the ideal age to be reading them when the first two were published, 14-15 years old\n        - well i like them, im currently reading the first 1-100 spawn and the writing is pretty much the same at spawn batman with batman saying Punk to all the villains its great XD\n      - But the books were bad\n10. Would have been legendary\n\n## 6. What movie was the first to make you cry or shed a tear from sadness? (from r/FIlm)\n\n**Score:** 15\n**URL:** https://www.reddit.com/r/FIlm/comments/1n2t060/what_movie_was_the_first_to_make_you_cry_or_shed/\n**Body:** https://preview.redd.it/woz5yhbrqulf1.jpg?width=570&amp;format=pjpg&amp;auto=webp&amp;s=28dc357655a6d43f005b75dbc324375742494753\n\nFor me it was this scene from Artificial Intelligence.\n\nContext (spoilers): &gt;!Monica (the woman in the picture) acquires a robot child named David who is programmed to love her unconditionally and eternally since she has a real boy with her husband who is currently in coma and is not expected to wake up soon. Once Monica and David begin to finally bond and love each other the real boy wakes up and rejoins the family. This eventually leads to David feeling jealous about real Monica´s son who hates David, constantly reminds him that he is not real and makes him do bad things. !&lt;\n\n&gt;!This leads to Monica planning to return David to the fabricant where it will be destroyed or reused, but she changes her mind on the way so she decides to abandon David in the woods. Once he understand whats happening he implores and cries telling Monica to not leave him, that he loves her and that he is sorry if he ever did something bad. Before in the film we can see that David is fascinated by the tale Pinocchio since he was a \"fake\" boy who became real. While Monica is trying to abandon David we can hear sobbing David ask: \"If Pinocchio became a real boy... and i too become a real boy, can i come home?\". Eventually he is abandoned there and Monica returns home, alone. This leads to David begin a journey to try and find the blue fairy from the Pinocchio tale to become a real boy so that Monica can love him again. !&lt;\n\n### Top 17 comments and their replies (up to depth 25)\n\n1. The Neverending Story\n  - same, kids movies in the 80s hit hard\n  - Artax!\n  - Dude, just reading the title took me immediately to the Swamp of Sadness 😔\n2. E.T.\n3. Love Story\n4. ole yeller.  or bambi.  can’t remember which one.\n5. At the end of Terminator 2 when he's being lowered into the molten metal.\n6. A Perfect World with Kevin Costner.  I cried like a baby.\n7. Bambi, when i was very young\n8. Old Yeller.\n9. Bridge to Terabithia. I was 9 when the movie came out and didn’t read the book. Man I did not see that coming. Definitely traumatized me as a child a little bit.\n10. Armageddon\n11. The champ\n12. The Neverending Story\n13. Jack with Robin Williams\n14. Radioflyer. Man as a older brother at the age of 6 it freaking destroyed me\n15. The final scene of “Silent Running” (1972).  7 year old me cried like a baby.\n16. Dead poets society,  the end when everyone says o captain my captain.   I was a hardened 13 year old and that scene broke me.\n\n## 7. AITA for correcting my MIL at a family gathering that she didn't recommend my daughter's name, it was my favorite name? (from r/BestofRedditorUpdates)\n\n**Score:** 2211\n**URL:** https://www.reddit.com/r/BestofRedditorUpdates/comments/1n2mz6f/aita_for_correcting_my_mil_at_a_family_gathering/\n**Body:** **I am NOT OOP, OOP is** [u/Far-Oven-6023](https://www.reddit.com/user/Far-Oven-6023/)\n\n**Originally posted to** [r/AmItheAsshole](https://www.reddit.com/r/AmItheAsshole/)\n\n**AITA for correcting my MIL at a family gathering that she didn't recommend my daughter's name, it was my favorite name??**\n\nTrigger warning:  &gt;!gaslighting!&lt;\n\nMood spoilers: &gt;!mixed!&lt;\n\n[Original Post](https://www.reddit.com/r/AmItheAsshole/comments/1motldn/aita_for_correcting_my_mil_at_a_family_gathering/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button): **August 12, 2025**\n\nI've been married to my husband for almost two years and our daughter is 11 months old. When we found out we were having a girl, one of the names that was immediately top contender was the name of a character I really like in a very popular book/movie franchise. My husband is a huge fan of the franchise too and with time that name just became the only one that I wanted and we landed on it and then told our parents about it. I remember my MIL questioning whether phonetically there would be an alternative spelling that could cause confusion, and I had said no it wouldn't and had explained to her the subtle difference in pronunciation and it was a whole conversation I'd had with her.\n\nLast weekend we were at my in-laws place for a dinner, my BIL and SIL were there too. So we were watching my daughter cruising along the room, using the couches as support and looking at us to see if we were looking and then laughing. My BIL's wife had remarked how radiant she looked and how she'd really taken to her name literally. My SIL then said that it was a really good choice by my MIL.\n\nI was confused I asked what she's talking about and my SIL said that my MIL had been the one to recommend the name right? My MIL then said yeah that she'd said its a good name. I was literally stunned for a second and then made it clear that I'd come up with the name, how I'd known of it, and that my husband also knew of that character, and that we were dead set on the name, there were no recommendations to be had. I asked my husband to corroborate the story which he did, uncomfortably. My MIL said names are a collective family effort, and everyone pitched in, but I still said this name was one that was very dear to me and it was one I'd come up with. (Maybe I shouldn't have pushed on that a second time? That's why I'm here.)\n\nWhen we came home and were in bed, my husband had been getting texts from his mom and sister. He said I was right in my account of what had happened but he also told me I'd been tactless, that we know it was my name, and our daughter has a beautiful name that suits her, why make it into something that causes bitterness. And today he had a phonecall with his mom, just a regular one. I asked if she was still pissed, he said she was. He said that he understood why I did it but it wasn't the time and place. Was I TA?\n\nUpdate: my husband came by this on his reddit feed fml. He wants to let us all know he never said I was an AH.\n\n**Top Comments:**\n\n**Comment 1:**  \n\"He said that he understood why I did it but it wasn't the time and place.\"  \n  \nDid he happen to share with you when would have been a better time to correct your mother in law's revisionist history and why he didn't have a word with her and correct her himself? Big fat, NTA  \n  \n**OP replies:**  \nNo, he didn't say it but he said it shouldn't have been clarified in front of an audience , so I'm assuming he meant when it was just me with MIL. And if she'd said this when we've had moments where its just the two of us, i would've corrected her then, I didn't enjoy saying it in front of others, it's just that's when it was brought up.\n\n**Comment 2:**  \nShe’s pissed that she got called out on a stupid lie? Easy solution to that is she shouldn’t have lied.\n\nNTA.\n\n**Op replies:**  \nThank you. And while I didn't bring it up at the time (because I didn't recall in the moment) I literally have texts of me sending her a link about how that name is in the top 20, that its not a totally out there name.  \n  \n**Comment 3:**  \nMild YTA. Count yourself lucky that MIL isn't like many on here who HATES her grandchild's name and there's a lot of negativity surrounding that. So what if she is taking a little ownership of the name at this late date? It just shows that she loves everything about your daughter.\n\nYou and your husband know the true genesis of the name and that's all that really matters.\n\n**OP replies:**  \nThat's my husband's pov essentially that it was out of love, and now theres bitterness. Which I suppose there is, and if it really was an AH thing to do I'm open to apologizing for doing it with others around.\n\n**Comment 4:**  \nDoes your husband ever stand up to his mother? Call her out when she lies, or if she says / does something unreasonable?  \nTrying to determine if this is a one-off event, or if you have more than one problem on your hands.\n\n**Op replies:**  \nBefore we got married he'd said she can be a bit much and just to sort of not mind her too much. Which is why we've been ok thus far. But just, this was close to my heart, and in the moment I felt I had to claim it.\n\n**Comment 5:**  \nI left you a longer reply elsewhere in the thread, but just consider that her own memory of things may have morphed. Memories are super weird. She might not be lying, per se, she might just honestly believe what she's saying. As a person with a MIL, ask me how I know lol.\n\nDoes it accomplish anything to remind her of the old text messages? What does that accomplish? Will it solve or avoid any future issues? Will it just make you look petty? We here in Reddit don't know you or your MIL, so only you can answer these questions based on your history and personalities. Ultimately, what is the goal of trying to \"win\" this argument? What do you lose by letting it go?\n\nMarriage is a long road. Navigate it wisely. Pick your battles.\n\n**Op replies:**  \nYou're right, I won't push this further. I think I set the record straight on this enough, there's no point in dragging it.  \n  \n[Update](https://www.reddit.com/r/AmItheAsshole/comments/1mt2lye/update_aita_for_correcting_my_mil_at_a_family/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button): **August 17, 2025 (five days later)**\n\nHi, and thanks a lot for all the comments and verdicts in my first post, far more than I had anticipated, enough that my husband came across it too. First, I do want to clarify that my husband never said I was an AH, he said he agreed with the facts, that our daughter's name had had nothing to do with MIL, just the timing of it. But like a lot of the comments had said, perhaps setting the record clear in the moment had been the right thing to do.\n\nMy MIL had been bringing up the encounter to him in passing repeatedly since then, and she was also emphasizing the way and place and time that I corrected her, she was not claiming to have recommended the name any longer.\n\nYesterday, because my husband was having to deal with the bitterness of the situation, I had a call with my MIL. She said she was in shock at the way I had gone about it, that its not what she'd expected of me, how fond she was of my daughter, and that decisions like these are family decisions in spirit, doesn't matter the origin of the thought. I said I understand and deeply regretted the unpleasantness but it was a name close to my heart since I was young and had read the books so that's why this was different to me than any other decision, like the choice of stroller for instance. My MIL brought up that I had sent her a link of how it was a very popular name back when I had told her about it the first time. I said that yes but I'd done that after the fact, just to show it wasn't a completely out there name, and that I didn't even know what the result of the popularity of the name would be when I'd searched for it, but this name was from my heart. She said she understands and again reiterated how much she loves our daughter and I thanked her and told her how much I appreciated it.\n\nI think I've handled the situation well. My husband too seems content after my call. A sincere thank you everyone who took the time out for my issue.\n\n**Comment 1:**  \nBut didn't you have to convince *her* of the name? To then go on and say *she* recommended it isn't just \"making a decision as a family\" even in spirit, that's just a straight-up fabrication. She can go around telling people she \"approved\" the name if she wants, but even that would rankle me, because decisions like a child's names are not \"family decisions in spirit\" to begin with-- they're the parents' decisions.\n\nI'm glad you're okay with how things panned out and I hope this is a one-off. But I'd be on the watch for my in-law (a) in case of further revisionism streaks; and (b) in case she decides *other* decisions that should be mine and my partners suddenly become \"\"\"family decisions\"\"\" in spirit or otherwise.\n\nDo not let her wiggle her way into having veto power over your decisions as a couple or as parents.\n\n**Op replies:**  \nYep, I've made it clear to my husband that when it comes to our daughter, only me and him make decisions.  \n  \n**Comment 2:**  \nFact checking a pushy MIL in real time for the win.  She is a right lively one isn't she? \n\nBTW OP, did anyone  in MILs family help name your SO or your SIL?\n\n**Op replies:**  \nHmm I never asked that. I can ask my husband.\n\nEdit: my husband can't remember, but he says his grandmother (my MIL's mom) makes an appearance in the story about his name. He has no clue about the story of his sister or brother's name.\n\n**Comment 3:**  \nYour MIL is an ah for trying to take credit , then gaslighting you into an apology, and making you think naming a child is a group effort in spirit when there was in reality NO GROUP.  \n  \nYour husband is an AH for saying you were in the wrong for putting his mother in her place for lying, then not telling his mother to touch grass when she bitched about it.  \n  \nYou are an AH to yourself for accepting this and apologizing. You are an AH to your daughter if you allow her to be raised thinking this shit is healthy or acceptable.  \n  \n**Op replies:**  \nI didn't apologize. I just acknowledged that it was sad the way things went down.\n\n**Comment 4:**  \n\"and that decisions like these are family decisions in spirit, doesn't matter the origin of the thought.\"  \n  \nWhat does this mean?  \n  \n**Op replies:**  \nShe was just like , in a family when decisions are made we all own it regardless of who originally came up with it , she was like making claims are not the sign of a loving family. And again thats all well and good for some things sure, but some stuff is just deeply personal.\n\n**DO NOT COMMENT IN LINKED POSTS OR MESSAGE OOPs – BoRU Rule #7**\n\n**THIS IS A REPOST SUB - I AM NOT OOP**\n\n### Top 6 comments and their replies (up to depth 25)\n\n1. #Do not comment on the original posts\n\nPlease read our [**sub rules**](https://www.reddit.com/r/BestofRedditorUpdates/wiki/subrules). Rule-breaking may result in a ban without notice.\n\nIf there is an issue with this post (flair, formatting, quality), reply to this comment or your comment may be removed in general discussion.\n\n**CHECK FLAIR** For concluded-only updates, use the [CONCLUDED](https://www.reddit.com/r/BestofRedditorUpdates/search?sort=new&amp;restrict_sr=on&amp;q=flair%3ACONCLUDED) flair.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BestofRedditorUpdates) if you have any questions or concerns.*\n2. Absolutely insane that OOP had to be the peacemaker here.  MIL straight up lied to take credit,  that should not be coddled just to spare her embarrassment from her own actions.  Really sick of this sentiment to be the \"bigger person\" rather than call shit out.\n  - and on what planet is a child's name a \"family decision in spirit\"? that is the right and responsibility of the parents.\n    - “ she was like making claims are not the sign of a loving family”\n\nOk then stop claiming that you’re responsible for our choice in baby names, MIL. \n\nSimple. \n    - Reminds me of my parents saying that my fiancée and I are selfish for thinking our wedding is about us and not the whole family because we don't want to invite all of their friends\n    - I think that was MIL trying to weasel her way out of her weird lie.\n\nI mean, no, I didn’t *actually* go swimming, but since you did, and recreation is really a couple’s thing in spirit, it’s exactly like I went too, right?\n\nNo, I didn’t pay for the food, but since eating is really a community thing in spirit, do I really need to pay?\n  - The husband really set the stage for that relationship early on: \n\n\n&gt;Comment 4:\nDoes your husband ever stand up to his mother? Call her out when she lies, or if she says / does something unreasonable?\n&gt;Trying to determine if this is a one-off event, or if you have more than one problem on your hands.\n\n\n&gt;Op replies:\n&gt;Before we got married he'd said she can be a bit much and just to sort of not mind her too much. Which is why we've been ok thus far. \n\n\nBasically \"my mother is going to be overbearing and push your boundaries, and it's going to be your responsibility to let each conflict land softly when she decides to be aggressive\". \n\n\nI personally wouldn't put up with that kind of expectation and would make that clear as a boundary before marriage. \n\n\nAlso \n\n\n&gt;Yesterday, because my husband was having to deal with the bitterness of the situation, I had a call with my MIL. She said she was in shock at the way I had gone about it, that its not what she'd expected of me, how fond she was of my daughter, and that decisions like these are family decisions in spirit, **doesn't matter the origin of the thought.**\n\n\nClearly it mattered enough for MIL to claim it. But when corrected, suddenly it's petty. \n3. If it's a group effort, why is she claiming credit?\n\nOr is it only a group effort when she has to give credit to someone else?\n  - \"It was a group effort, we all pitched it!\" ≠ \"I came up with it and recommended it all by myself, and OOP just agreed, and no-one else was really involved\"\n\n\nI also feel that, if you lie or are genuinely mistaken, being corrected isn't innately unkind, impolite, or anything bad. It's a good thing, because people forget and make mistakes and confusions and miscommunications don't matter when it's just the bank teller asking how your day was but family is more important and deserves meaningful communication, which can't happen if we just say whatever random nonsense to each other and don't care enough to engage with what's said.\n\n\nSomeone asks me a question. I answer. My husband corrects me, and I thank him for looking out for me like that. \"Oh, thanks! I always get the month wrong. Anyway, so it was September, and...\" Similarly, he forgets to close the window, and I close it for him when I notice, and he thanks me. If either of those things stopped happening, if we stopped paying attention to each other and stopped caring about what each other said or did, well, apathy is the death of a relationship.\n\n\nAnd anyway, OOP wasn't rude about it. MIL was clear that the issue is that OOP did it in front of others. You know, the others that MIL is allowed to lie to. MIL is allowed to do as she pleases in front of others, but not OOP, apparently. Shouldn't MIL be equally in the wrong, by her own standards? In fact, she did it in front of others but without OOP present, which is worse, tantamount to gossip.\n4. The correct time to correct a lie is in front of the people who were lied to so they don't continue believing the lie. \n\n\nMIL is weird af for trying to take credit for it. \n5. Come on, this MIL probably doesn’t even know who Hermoine is\n\n*Hermione.  I probably should have sounded it out first.\n  - Right, has anyone ever thought about how young Renesmee is going to feel about this scuffle when she's old enough to understand?\n    - Let’s be kind; little Arya didn’t pick her name.\n    - Katniss is going to be deeply upset at having created a rift in the family.\n      - Take it easy in little Bella, she had no say in her name.\n        - I think Mundungus will grow to like her name when she’s older.\n  - She said she was living up to her name by being \"radiant\" though, so I’m guessing it’s Luna. The \"misspelling\" the MIL was worried about was likely Loona.\n    - That was my immediate thought, Luna has become a very popular name.\n    - Yup, just looked it up. Luna was a top 20 name in 2023.\n  - I thought of Sunny from A Series of Unfortunate Events. That would relate to the \"radiant\" comment and also to the conversation where the MIL said an alternative spelling would cause confusion (Sunny vs Sonny).\n\n## 8. I saw Blue Beetle again in HBO Max and its a great movie! but I feel sad. (from r/DCU_)\n\n**Score:** 102\n**URL:** https://i.redd.it/lmeretn2osmf1.jpeg\n**Body:**  The movie was a financial flop but only because it was released in the middle of the turmoil of DC, just when James Gunn announced the new plans, so a lot of people were confused and upset.\n\n This makes me feel very sad because the movie its accually really good, and it fits very well in the new DCU is colourful and hopefull. You end up with the same feelings of positivity that Superman makes you feel, the feelling is different, Superman is \"be kind\"  whereas Bule beetle is \"love your family\", and also the movie does not have any hard reference to the DCEU, we dont see superman's suit like in Shazam, we dont hear the word \"justice league\" so it doesnt seem to be any canon continuity issue.\n\n  I wish that James Gunn were more clear about whether this movie is canon or not, as far as I understand this movie is kind-of-canon like Peacemaker S1 but unlike this one I think we are not 100% sure which parts are canon and which are not, is the entire movie canon? We know that Xolo will continue as Jamie and little more.\n\nIf you haven't watched it, just do it!\n\n### Top 15 comments and their replies (up to depth 25)\n\n1. It’s probably gonna be mostly canon like PM S1, There’s a LuthorCorp building in the background at one point and it’s LexCorp in the DCU so that obviously isn’t canon but outside of that I’d assume most of it is canon. Xolo did say something about his next appearance being sooner than people think so don’t be shocked if he’s in the last episode of PM S2 or something\n\nEdit: it’s LexCorp in Blue Beetle and LuthorCorp in DCU mixed those up\n  - Other way around. It’s luthorcorp in DCU and there’s a lexcorp building in blue Beatle\n    - shit my bad but u get the deal\n      - Yeah totally. There’s really barely anything that needs to be retconned\n        - Yeah it’ll be way easier to explain Blue Beetle in the DCU than what they had to do with Peacemaker so like i’m just excited to see what they do with him. Sounds like they’re gonna do an animated series with Xolo first but i’m hoping he gets to play bigger and bigger roles in the universe going forward\n2. People should care about continuity less than they do\n  - That's the true secret to my comic collection hobby, I just go in every Wednesday and grab what looks good.  I'm not worrying about what's true canon or what came before, they're all mostly good standalones with any context you need in the beginning\n3. Its a fun movie, and it doesnt really matter how much of it is canon. Just enjoy the movie, and enjoy that this whole family will most likely be back in the future.\n4. This movie is mostly canon and we'll be seeing more of Xolo's BB in the upcoming series\n5. Loved the movie when it came out too. Just said this in another thread on its canon status so just to share it again:\n\n&gt;The film as is fits so well already. The DCU’s going for these recurring themes of superhero legacy, threads of governments and corporations trying to control and create metahumans, and the existence of fictional cities over real ones that Blue Beetle already did on its own with Dan, Ted and Jaime, Kord Industries making OMACs and Palmera City. \nThey really just need to retcon Lexcorp in the background to be Luthorcorp. It can easily take place at any point in time but even as is, Superman would be in his first year, Batman would be well established and the Flash and Central City mention can fit if Barry’s as old as Guy or Hal in Lanterns.\n  - Exactly. Blue Beetle fits perfectly with the themes of Chapter I.\n6. They have an animated BlueBeetle thing on the docks I think.\n7. It's been my 1st Priority on my Watchlist for a long now, Prolly this weekend imma give it a watch. And I'm happy he's in the New DCU. I'm loving the JL Line up that Gunn is setting.\n8. It’s pretty much iron man, but also a fun movie. I agree\n9. I think that’s the general feeling on that one. I think Gunn said there wasn’t a lot about it that would challenge or negate any of his plans for the DCU and I think it’s been treated sort of the same as peacemaker season one as sort of “loose canon” and I imagine we’ll get more clarity on that whenever Xolo Maridueña shows up in the DCU. Whether that be his animated series or sooner.\n\nI think Gunn recently said it’s basically canon apart from maybe some minor casting choices, but tbh I might have dreamed that. I haven’t been sleeping well lol\n10. I saw it in theatres and liked it. I knew that universe was ending but the trailer had me hooked.\n11. Is it a good movie? I haven't watched it yet but I've heard basically nothing about it. Most DC movies have an avalanche of posts saying how dogshit ass garbage they are. Good movies get posts praising them. Blue Beetle had basically no impact (at least that I saw) so I just assumed it was a middle of the road boring movie.\n\nIf it's actually fun I might give it a watch.\n12. My question is: since the consensus is that the movie is generic but really good, how come no one is talking about the actual director of it. Who knows what Gunn has up his sleeve, but how come the fandom isn't clamoring for this dude? Angel Manuel Soto took a played out, unexceptional story and turned it into a very appealing, fun ride. This could've easily been like Black Adam under someone else.\n\nThat would excite me way more than going back to the director who made The Flash.\n13. This shot looks like it’s from a 2009 toy advert\n14. Tbh I was bored. I was excited but besides the suit being cool the story was bad. I hated how they also introduced Ted Kord. I prefer just Jaime as the beetle. \nIt was fun but still not enough to keep my attention sadly.\n\n## 9. Still sad we didn't get a movie date with Piper😔 (from r/blacc_gye)\n\n**Score:** 269\n**URL:** https://v.redd.it/2cipfu7bqqlf1\n\n### Top 13 comments and their replies (up to depth 25)\n\n1. Might be short, but this is one of my favorite edits. I'm pretty proud of this one\n2. STOP NOW I FEEL SAD 😭\n  - It’s working 😈\n\nhttps://preview.redd.it/ssajxc0e5rlf1.jpeg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=d4657aac75bdf9b320c384bbbde59ebe9c506139\n3. NO LITERALLY, WHY DIDN'T WE GET ONE?????\n\nhttps://preview.redd.it/ll1ylh3porlf1.png?width=225&amp;format=png&amp;auto=webp&amp;s=8a1d3fa1a324980ce4f751d8d51183dadb04302e\n  - I made sure to add in the survey for her to get one the next time they ran this event. Lost opportunity.\n\nI just hope they do something funny like have her fall asleep halfway through and she just starts sleep talking or something\n    - There's so many little quirky things they could have her do like cmonnnnn\n\nShe could even yap about trucks if there's a truck in the movie 😭\n4. It’s so beautiful.\n  - We were so close to greatness🥹…\n\nhttps://i.redd.it/gf86y5oj5rlf1.gif\n5. Its goddamn hag propaganda! And i like it!\n\nhttps://preview.redd.it/5efe46s3krlf1.jpeg?width=640&amp;format=pjpg&amp;auto=webp&amp;s=88246d904abfd1a48c50a287d1088ae6196de707\n  - Its not letting me paste but think two blowtorches\n6. sitting at work with my coworkers around trying not to tear up...\n7. I am scrolling in the home page peacefully, and I see your post with your name, and i started to wonder if reddit started to push posts with no subreddit needed...than then I see i was wrong and there is a whole subreddit for the hag lover themselves!? Best jumpscare.\n8. It's a crime that we only get movies date with 6 agents, there must be more agents movies date with each version\n9. https://preview.redd.it/o4lgo91htulf1.jpeg?width=828&amp;format=pjpg&amp;auto=webp&amp;s=5d1b77773602037efee63cd9e1a9f654d8b771f9\n\nMy man, cooking as always. Take notes, devs.\n10. https://preview.redd.it/rfr9nlrfmwlf1.jpeg?width=960&amp;format=pjpg&amp;auto=webp&amp;s=2e1f00be16f50a753dca7a2b484bf3b500829a04\n\nDamn, we were robbed from this\n11. Alright, time to do the age old technique of bullying the devs until they give us what we want.\n  - No no. We won’t go that far. It’ll happen sooner or later.\n12. Awww, please don't cry granny 🥺\n13. Man, I'd usually say I'm not a gooner but piper is the exception.\n\n## 10. Need movie suggestion ( sad movies 🙃) (from r/Ni_Bondha)\n\n**Score:** 15\n**URL:** https://i.redd.it/z4m2nvyzcllf1.png\n**Body:** So guys I think I finally moved on took me 1 year.....\nEhhh mean time lo what helped me the most are movies nen chinapudu ehh ekuva movies.... 10th ala ochaka oka 5 years even in btech very and friends theatre Ani lakelteney chusta..... Anime pichi undedi anukondi btech Apudu..... But it's gone when I started to feel sad chudandi... I liked someone anadaniki kuda kastam ga undi anta innocent op..... Anyways but love stories ala antaga nachav ekeci kadu but I started liking them and i like movies which are more sad emo life ni move chesinatu anipistai..... But 1 year ago something happens and apdu konchem u know guys andar life lo undey story..... Move on avadam kastam ga undedi anukokunda hindi movies watching started tamasha, rajaana, rockstar, fitoor, telugu lo jaanu, saptha sagaralu dathi not like avi move avadaniki help chestai Ani.... One of my friend is Muslim be suggested.... Today I watched premam 🫡..... Both telugu and malayam chusesa anyone similar movie suggestions ivach ga.... Chatgpt bro ni adigitey evevo istunad.....\n\n### Top 11 comments and their replies (up to depth 25)\n\n1. Finding job\n  - Finding Nemo Finding Dory ki 3rd part aww annaw... Eppudochindi, I missed this\n    - Aah shit aadi 'get a job' anukunta annaw\n      - https://i.redd.it/21czdrfdgllf1.gif\n  - Please censor the word dawg 😔\n    - 🌚 award istey chestha\n\n(Ippuduuu Cheppu lanjam lanjam lanjam)\n      - https://i.redd.it/p08a9739illf1.gif\n  - Bro movie peru emo Ani check chesa Eli.....\nParley job jan to july daka internship ayindi.... Full time from september elpota hyderbad unko two days lo 🫡\n2. grave of the fireflies, life is beautiful\n3. Hari Hara Veera Malluuuuu\n4. Bridge to terabithia\n5. Hurdaya kaleyam\n  - https://i.redd.it/mgiml57ygllf1.gif\n\nEnti bhai.... Og movie chala sarlu chusa 🤓\n  - Kobbari matta better\n6. Midhunam, nanna, premikulu, nenu, taj mahal, preyasi raave, aa naluguru, preminchu, amma cheppindi, gamyam, little soldiers, ninne premistha\n\nAdukkodam tappa vreyem pani ledu .. I hate beggars..wahshishfirushmsnsnas\n7. Watch Gorentaku\n8. Andala rakshashi\n9. Color photo \n10. Manchester by the sea , demolition\n\n## 11. I (28M) with fiance (27F) about a month ago overheard her tell a friend her previous Ex was the best lover she ever had (from r/BORUpdates)\n\n**Score:** 981\n**URL:** https://www.reddit.com/r/BORUpdates/comments/1n6kcds/i_28m_with_fiance_27f_about_a_month_ago_overheard/\n**Body:** **I am not the OOP. The OOP is u/AlarmingMonk posting in r/relationship_advice**\n\n**Concluded as per OOP**\n\n**3 updates - Long**\n\n[**Original**](https://www.reddit.com/r/relationship_advice/comments/a492j5/i_28m_with_fiance_27f_about_a_month_ago_overheard/) **- December 8, 2018**\n\n[**Update 1: Recovered**](https://www.rareddit.com/r/relationship_advice/comments/a55jy1/posting_general_response_here_i_28m_with_fiance/) **- December 11, 2018**\n\n[**Update 2**](https://www.reddit.com/r/relationship_advice/comments/a6a8qj/update_i_28m_with_fiance_27f_about_a_month_ago/) **- December 15, 2018**\n\n[**Final Update**](https://www.reddit.com/r/relationship_advice/comments/aom7po/final_update_i_28m_with_fiance_27f_about_a_month/) **- February 9, 2019**\n\n**Editor's Note:** *Comments are not included due to the post's length. Minor modifications have been made for an improved reading experience.*\n\n---\n\n# **Original**\n\n[**I (28M) with fiance (27F) about a month ago overheard her tell a friend her previous Ex was the best lover she ever had**](https://www.reddit.com/r/relationship_advice/comments/a492j5/i_28m_with_fiance_27f_about_a_month_ago_overheard/)\n\nIt was quite by accident that I heard this. We had a group of our friends over and as the night went on we all kind of busted out into little groups. Some of us were in one room playing Texas Holdem and a couple of others were watching a Lord of the Ring marathon. I thought she was watching the movies but she and one of her close friends were actually sitting in the kitchen drinking coffee and talking. \n\nOur group had run out of soda so I got up to go to the kitchen to get drinks and a couple of snacks. As I'm rounding the corner I hear my fiance talking and before I completely come in the room I hear her clearly say \"Jason is great but he will never be the lover that Bill was\" she then followed it up with \"Its not really fair to Jason though, Bill was just really gifted down there\".\n\nAt first I thought about just walking back into the card game and pretending like we didn't have any extra soda or food but I decided to kind of make a noise and go in. Her friend caught eye of me rounding the corner and I could see her make a face to my fiance letting her know I was there. Of course she has no idea I heard her and she just stops talking to her and asks me how I'm doing and if I'm having fun. I was tempted to say something like \"I'm having as much fun as someone who is not gifted down there can\" but I didn't. I just said yes and proceeded to get my stuff and go back and finish the night. I just acted like nothing was wrong the rest of the night and went to bed.\n\nNeedless to say it fucked me up. I mean fucked me up bad. I've never been jealous or what you would call insecure about myself until that moment. I couldn't sleep that night and I went through a myriad of emotions while laying there. At first I was angry. Then I was humiliated. Then I was depressed. Then I was angry again.\n\nLook I realize that the male ego seems stupid to women and even guys who are totally self assured. I would have agreed with most of this prior to that night but once it has been damaged it is a bitch.\n\nI tried to hide any form of emotion about it or ever let her know but as the days went on I just kept getting worse and worse. I was avoiding her at all costs and while she was suspicious she didn't really say anything. That is until she attempted to be intimate with me a few days later and I flat out rejected her. It wasn't by a conscious decision on my part by the way. I had made the decision on my own to just try and get over it and move on. But in the moment instead of being sexually aroused I felt deeply inadequate and ashamed. Nothing was happening no matter how much either of us tried.\n\nShe asked me what was wrong and I just told her I must have been stressed from work but she would not believe that or let it go.\n\nSo much to my humiliation there I laid, naked in bed, unable to get an erection. I came clean and told her what I heard.\n\nWell this did not go over well at all. At first she tried to tell me I did not hear her correctly. But I just repeated to her verbatim what she had told her friend. Well once she couldn't deny it she then tried to apologize and to her credit she tried to listen to my feelings on the matter. Which once again I am sure was more of a big turn off for her because I was a wreck emotionally.\n\nShe tried to tell me how much of a better person I was and how I satisfied her and she wanted nobody else. But all I could hear was Charlie Browns teacher noise.\n\nIt's been almost a month and I have zero desire to be with her sexually. None. She is now getting frustrated about this as well but no matter what I have tried I just can not get past this. It's not like she said we were both good lovers or anything like that. She clearly said he was far superior and my guess is that being gifted down there means he was significantly larger than me as well. Well I know I can do all kinds of things with my hands, tongue and whatever else. But no matter what I do I can't grow in size. Obviously she refuses to talk about that with me saying that no matter what she say's it will only make things worse because even if she say's something positive about me I won't believe her. She's most likely right.\n\nSome back story here. He dumped her. It was not a mutual breakup, he flat out dumped her and broke her heart. I know this because early on in our relationship she told me this. She said she wasn't ready to be serious about anybody because her previous ex left her and emotionally broke her. So this is not a case of me even being able to say \"well she's with me because she wants to be\". If he hadn't dumped her she would never have left him. Now I have no idea if after all of these years she would leave me for him if he would come back but I don't think she would.\n\nI just don't know what to do here. I can feel myself checking out of the relationship. I know this is petty as shit but hearing the person you love tell someone else they prefer to have sex with someone else is just devastating to me. Her telling me all of my other good qualities has only made it worse because she is saying things that I think appeal to her and maybe other women but being told I am a good provider and will make a great husband makes me feel like shit. Like what would happen if I lost my good paying job or better yet what if I were to get injured and couldn't make anything more than state assistance, would she be there to support and help me? Basically what I feel like right now is a really good friend who she just allowed to have sex with. I know in my head that this is not correct but in my heart that is what I feel.\n\nI'm sorry for the length here and I don't even know what I am asking here. I am totally lost and if this continues I just think I am going to break our engagement.\n\ntl;dr: heard fiance tell her friend that previous ex was superior in the sack (presumable due to size among other things), relationship has gone to hell since and I need advice.\n\n**Editor's Note:** *I’ve moved the edits to the main post into a separate section so it’s easier to take a break, check out the linked comments, and come back with more context*\n\n---\n---\n\n# EDITs FROM THE MAIN POST\n\n**EDIT 1:** \n\nHoly God. I made this post last night and answered a couple of questions and then went to bed and got up today and went Christmas shopping hoping to make me forget my troubles and didn't even log in until just now. I have not even started to read the (at this point) 7.7 thousand comments on this post. I don't know what anyone has said yet but thank you all for commenting either way. I am now going to begin the massive undertaking of looking at the comments. Also thank you for the Gold and Silver kind internet strangers.\n\n**EDIT 2:** \n\nDear God. I read all the way down to the bottom of the page thinking I had gotten through most of everything and then at the bottom it said load the 5.5K more posts. I'm stopping for the night (well morning actually). I was going to respond to people individually but there is just no way. I haven't even started reading the direct messages to me yet nor have I opened any of the 20 chat screens. There are issues I want out there because there are a couple of things that are being said that are not accurate.\n\n1. She was to use the Barney Gumble phrase using \"sweet sweet drunk talk\". In other words her and her friend were drunk while talking. Nope, neither of us drink. We don't even have it in the house.\n\n2. That I am upset she told her friend. Well this is an odd thing, before I posted this honestly I wasn't that upset about this part. I was then and am still far more upset that this is how she feels. However now reading a lot of the post I have become somewhat aggravated that she did share this with her friend. I would never say anything about her to anyone that would put her in a lesser light.\n\n3. That I am an insecure man child who should just man up and learn to do better. Well I'm certain the first part is true, being insecure and all. But the last part is just out of my control. No matter what I do I will only ever be 7\" long. We have talked about this btw, when she was trying to build me up. She said that I was already great with everything but the one thing I can't control. (Okay, so I gave myself about a half inch to feel better)\n\n4. No I'm not going to do anything rash. It's already been a month so its not like this happened last week. But yes I have to decide what I am going to do here before long. It's not fair to either of us is I am just coasting through this and no longer committed.\n\n5. She is sorry that I heard it. She said she is sorry she said it but at the end of the day she would not be sorry if I didn't catch her saying it. It is what it is. But yes I do believe she is regretting it because she has basically been a mess since I first told her. Me not wanting to be with her is bothering her a lot according to her. I don't know how much of that I believe but right now I guess I don't know why she would lie. It really has wrecked hell on our Christmas spirit this year I know that.\n\n**EDIT 3:** \n\nEngineer for those who keep asking what I do for a living. She is a paralegal.\n\n**EDIT 4:** \n\nPeople have been asking about the relationship with the ex and how I know she was heartbroken. We met about 9 months after they separated. I know that ultimately he wanted to be with someone else, although she has claimed he never cheated. He just ended things so he could be with another woman. She approached me at a local workshop and we started dating . On our 4th date when things started to get physical she broke down crying about the ex. It was certainly weird to hold someone while they cried about someone else but I did it. \n\nWe sporadically dated for a couple more months in which time I never tried to cross any boundaries physically because it was obvious she wasn't over him so while we just went out of dates I tried to keep myself of the mind that we were just friends because I didn't want to commit either. After close to two months she drags me from my car to her apartment and begins to tell me how much she has appreciated my patience with her and how she felt stupid about dragging me along for so long. Obviously that was our first night together. Within 3 months of that she is telling me that she loves me. So yes, she was still hung up on her ex for fact when we got together. I had thought/hoped she was over him before this happened.\n\n---\n---\n\n# **Update 1: Recovered- 3 days later**\n\n[**Posting general response here. I (28M) with fiance (27F) about a month ago overheard her tell a friend her previous Ex was the best lover she ever had**](https://www.rareddit.com/r/relationship_advice/comments/a55jy1/posting_general_response_here_i_28m_with_fiance/)\n\nThe main thread has over 8.3 k posts and is a couple of day old now but I wanted to try and respond to some general thoughts.\n\nIt is absolutely impossible for me respond to everyone or even most people and at this point putting up edits I think is counter productive because the thread is a few days old now so I doubt people are going back to re-read the OP. I don't want to make an update there yet because I'm not really updating anything (nothing has happened yet, per se) however I have a few things to get off of my chest. So this seems like the best place to do that before I update my OP.\n\nI have had so many people post on the original thread and twice as many people send me PM's telling me to hit the weight room and get in shape and transform myself into some form of weightlifting god. I am sure that these people are all filled with the best of intentions. Well not all of them because I have also had several people call me all forms of names while telling me to hit the weights.\n\nHere is the problem for those people. They are using a stereotype about engineers and think that I fit that stereotype. I was a state finalist in wrestling in high school and got a partial scholarship to a division 2 school for wrestling. I competed both my freshman and sophomore years. However due to throwing a god damn baseball I tore my rotator cuff and while my recovery had me well on my way back my physical therapy prohibited me from being being ready for my junior year. \n\nI did not go back for my senior year as my work load and girlfriend were to much to also dedicate the time for wrestling. Wrestling was very physically demanding and time consuming. Now I freely admit that not training to compete did not leave me in even 1/8th the shape I was in at my prime I have stayed in shape. To this day I still lift and do cardio at my local gym. I've been getting my ass kicked lately by my friend who is doing a Mai Tai work out. I've been trying to keep up with him but freely admit I have a lot of leg work to do.\n\nNow this leads me to want to focus on a couple of other things.\n\nYou will notice I said girlfriend. Contrary to what some of you have said or implied I was not some incel or neckbeard prior to meeting my fiance. I have had several girlfriends and yes even a couple of NSA relationships. So that is why this bothered me more than it probably should have.\n\nIn other words prior to this while I may not have been the worlds most confident guy I never felt like it was an issue. I've never EVER EVER had another woman say something like this in earshot of me about me. I mean did they say it when I couldn't hear? I have no idea but till the moment she said that I never had any self doubt or lack of confidence.\n\nNow does me having this mental breakdown over this make me a \"man child, weak or straight up pussy\" as I've been called? I don't know, maybe. Hell probably. But bluntly speaking I've never had anything like this happen to me before. Every break up I've ever gone through was for the most part mature (I had a very childish breakup in high school but does that even count).\n\nAlso to all of the geniuses that keep telling me to learn a new technique or practice or just plain get better at sex. That's not the issue here guys. She didn't say that I could work on the issue at hand. She straight up told her friend that I would never be able to measure up (so to speak) because of a physical attribute that I can do nothing about. I could become an oriental lick master and at the end of the day I am never going to be able to finish her by jack hammering with what I can only imagine must be a 9\" dong.\n\nShould that matter? Well it fucking doesn't matter if it should matter, it obviously does to her or she would not have said it. I don't know of any single way we can un ring this bell.\n\nWhich then brings me to the biggest thing I want to get off of my chest.\n\nThere are several poster, both men and women and ironically gay males over 30 who have a sub reddit that I guess I am a topic on, who have said \"it's just sex\".\n\nWell, those words do not exist in my vocabulary for someone I love. I admit that I had a couple of NSA partners in grad school but even with them I developed feelings and had to part because I could not just do that. I don't do ONS and since my mid 20's have only participated sex via a relationship. I found out that I am just not capable of having sex and just having sex.\n\nI get it, there are many of you who don't feel that way. Great for you, I don't feel that way and I am not going to fight myself to make myself feel that way.\n\nDo I need to be my fiances best ever? Well, why the hell should I not want that? If you would have asked me before that night I would have thought I was, but now that I know I'm not. Well no I'm not really okay with the fact that I can NEVER measure up. I mean if I could work on something or improve something or take more time or something, sure. But to hear her say I can never be as good? Yea, sorry that is a little more than my ego can take. Call me whatever name you want, but it is what it is.\n\nBut some of the really most disgusting stuff that was said to me is that I should be happy that she is with me and allows me to have sex with her so she must want me.\n\nALLOWS ME TO HAVE SEX WITH HER. I can not describe in enough words how that offends me. Maybe I've lived in a Disney fantasy world for me but I always wanted to be with someone who wanted to be with me. Not someone who allows me out of some form of obligation. So does that make me a sissy (as a few of you have pm'd me)? I don't care if it does. I refuse to be a person who begs for sex, period. If whoever I'm with does not want to be with me as much as I want to be with her then fuck it, I'll just pay an escort and probably save myself money in the long run.\n\nLook I don't know for 100% sure what I'm going to do yet, I have a very strong feeling what I'm going to do but I haven't done anything yet.\n\nIf this is the wrong forum just let me know. Anyway I'll try and do my best to respond to posts here. \n\n---\n---\n\n# **Update 2 - 7 days later (4 days from the last post)**\n\n[**(update) I (28M) with fiance (27F) about a month ago overheard her tell a friend her previous Ex was the best lover she ever had**](https://www.reddit.com/r/relationship_advice/comments/a6a8qj/update_i_28m_with_fiance_27f_about_a_month_ago/) \n\nIt all came to a head last night. She just came out and asked me if I did not love her anymore and all that I could tell her was that a very large part of me still did but that what she said had really made it so that another part of me just didn't anymore.\n\nThis started a larger conversation that I won't bore you with but ultimately it came down to me saying that I would have heard that he was just better at something or more attentive to something or was able to do something that I would have felt like I could have worked on it. I would have listened to anything she wanted worked on any technique or anything else that she would have shared with me. But to know that I was never going to measure up simply because of a physical issue was not something I thought I could get over any time soon or if I ever could for that matter.\n\nI was even honest and said that if it was just a ONS she had or some random guy who was just huge I might be able to get past that. But knowing that it was a guy who she was still madly in love with when I met her and only after time did she ever start to come around then it was just more than I could handle.\n\nShe kept trying to tell me how much better I was at everything else and that I should not throw away a lifetime over one aspect. I told her that that one aspect sadly was just to high for me, not all things are equal and that honestly it is a mental failing on my part that it is but whether it is genetics or a learned trait or whatever that yes I needed to be my spouses best and she has already made it clear that I can never be.\n\nI tried my best to be gentle, I tried to take all of the blame of stating that I knew that my attitude was probably not healthy but it was who I am.\n\nBTW I'm typing this as though this were a clean conversation, it wasn't, there was lots of crying (by both of us).\n\nThis is not a happy ending or even a satisfying one. I am beyond fucked up in the head over the entire situation. Everybody's Christmas is ruined. We had big family gatherings that we both were attending together and now we have to somehow break it to our family's what has happened.\n\nThis alone is causing me massive stress because my parents loved her and what in the hell am I going to say is the reason why we are not together? She didn't cheat and if I say that I felt like she was still hung up on her ex she will obviously deny it and she will tell them the truth. It's fucked up no matter how this goes down.\n\nIn the end I feel like a massive failure. I feel like a failure as a man because of not living up to comparison and I feel like a failure because I wasn't able to just \"man up\" and either get over it.\n\nShe has begged me to go to couples counseling and initially I said no because at the end of the day what does it change? We can talk about every single thing and I can try and look at things from a different way and at the end of the day the woman who I wanted to marry just told one of our friends that no matter what I do I will never be as good as her ex. I just can not see five years from now ever being okay with this.\n\nBut because she legitimately seems heartbroken I agreed to go. But that does not mean I will keep going.\n\nToday I moved out a lot of my stuff and am staying with a co worker for a few days until I can get a place for myself. She has been with her sister all day.\n\nI feel like shit.\n\nThank you to everyone who took the time to type out a response. I honestly have tried to read everything even if I didn't reply to very many.\n\nThe bitch of all of this is that I still love her. There is so much of me right now that wants to pick up the phone and call her and beg her to come back.\n\n**EDIT 1:** \n\nWell once again I posted this and then went away for awhile. I went with my friend to see Mortal Engines and the to dinner and then we've been talking for a long while so I started reading awhile ago. It is going to take me forever to read and once again I don't think responding individually will ever happen because of the large number of posts and private messages. But thank all of you for reading and responding.\n\n**EDIT 2:** \n\nI guess I do want to share one thing I spoke with her about. When we were having our very long conversation I presented her with a scenario for her to compare. I know her well enough to know that comparing body parts or sexual prowess isn't going to impact her the same way it would me. So I put the scenario to her like this. I said what if you walked in and overheard me talking with my friend Tim and you heard this. \"Jill is great but she will never understand me and comfort me the way Tiffany did\" \"But its not Jill's fault Tiffany is just the smartest most compassionate person I've ever known and Jill just isn't as smart\". \n\nThen if she would confront me about saying those things about her that my response to her would have been. \"I love you for all of your other qualities\". \"Nobody makes a sandwich like you do and I think long term you wont gauge me for my money\" At first she tried to say that this was a totally different issue but once we talked more about it she finally agreed it is because of the way we both approach and value sex. She ultimately admitted that this would really hurt her feelings but she would not break up with me over it. I then responded that even in my make believe scenario, which btw I would never say to anyone out loud about anyone I loved, she could improve her level of education and learn to be more compassionate.\n\n\n**EDIT 3:** \n\nIf anyone even reads this I want to add one last thing. People have been telling me what a whiny bitch I am (that's one of the more kind things they've said) because I can't get over someone else in the world having a bigger dick than me. Not going to lie and say I'm thrilled with it but I'm not dumb enough to think I have a giant magic wand or anything. I had grown up believing what I now know to be a lie that women don't care about size. \n\nSome don't but obviously some do and my ex is one of those that obviously did. But even with that ultimately I might have been able to get over it if it was just said as a matter of fact. But hearing that no matter what I did, how much I loved her or any other thing that I was NEVER going to be as good is what has bothered me since. Yes size is obviously a big part of it, but if I hadn't heard that I would never be the lover I think I might have been okay. \n\nWell not okay but at least not relationship killing. Yes I overvalue sex. I get that. Yes it is very important to me and well frankly I want to be wanted as much as I want to want someone, if that makes any sense. Yes I know whoever I date in the future will most likely have had someone who was either bigger, better or whatever. But I would really hope that they would not be still hung up on it a few years later.\n\n---\n---\n\n# **Final Update - 63 days later (56 days from the last post)**\n\n[**(final update) I (28M) with fiance (27F) about a month ago overheard her tell a friend her previous Ex was the best lover she ever had**](https://www.reddit.com/r/relationship_advice/comments/aom7po/final_update_i_28m_with_fiance_27f_about_a_month/) \n\nI wasn't going to post anymore but I am still getting daily direct messages wanting to know how things are going. I do appreciate the kind words and concerns.\n\nBut just so anyone who cares can know. It is over.\n\nI went to counseling with her on three different occasions and honestly I tried to have an open mind about it. But at the end of the day the obstacle was just to much to overcome.\n\nI even gave her an opportunity to walk back her statement or amend it or well do whatever she wanted to with it. But instead she double downed in a way. I think by that time she was very frustrated as well.\n\nNeither of us are really happy about this. It has been an absolute nightmare for me trying to avoid telling people/family why we are no longer together. Of course I tried the old \"its none of your business\" to some of them but that failed spectacularly and since I refused to tell they decided she cheated on me and started spreading that around. I've had to do a lot of damage control over that.\n\nI've decided to continue with therapy on a personal level because honestly this entire thing has really messed with my head and I have no self esteem left at all.\n\nI've only seen her once since we separated and it was the hardest thing I've ever had to do in my life. She is now, justifiably so, in the angry stage. She is furious with me and has called me everything that you can imagine and then even made up some words.\n\ntl;dr: Its over. I tried going to counseling and things only got worse.\n\n&amp;nbsp;\n\n**I am not the OOP. Please do not harass the OOP.**\n\n**Please remember the No Brigading Rule and to be civil in the comments**\n\n### Top 12 comments and their replies (up to depth 25)\n\n1. Reminder: There is a ZERO tolerance policy for brigading or \nencouraging others to brigade. Users caught breaking this rule will be \nbanned immediately. No questions asked.    \n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/BORUpdates) if you have any questions or concerns.*\n2. Maybe don't compare your SO to other people if they're great for you. Or if you do, don't do it where they will probably hear. No one likes to be compared to anyone unless it builds them up. Guess they both learned something kinda.\n  - Yeah I don’t get people who talk about their bedroom life’s with people who are not in the bedroom with them.\n    - I also don't get doing a ranking system of past lovers. I keep picturing people furtively filling our forms on clipboards marking things out of 10 like - foreplay, eye contact, stamina, etc.\n  - I would turn into a self-dignosed amnesiac if someone asked me about the size of previous partners, especially if that person was my partner or someone speaking when my partner was also present. I also just don’t care that much about size and live by that one quote from Trainwreck: “you don’t want the biggest/best you’ve ever had, that guys in jail”. Also, how do people remember penises so well? I’ve been with my partner for 8 years and I probably couldnt pick his out of a lineup of similar schlongs.\n    - Exactly! Like why is that on her mind at all. And I love that as a quote. And right? I couldn't pick mine out either. If he was in an accident and only his dick survived I'd be at a loss.\n  - SO many reddit posts boil down to \"It costs $0.00 to shut the fuck up.\" She really screwed up here.\n3. People are really harsh on this guy. As a woman, if I heard (or just knew) my partner talking about my body or ability and comparing it to someone else’s, I wouldn’t “get over it”, either.\n  - Especially if we were engaged, and the person in question was an ex from years ago.\n    - And not just any ex at that. The one she was still grieving over when she first pursued him. I cannot.\n  - This was my take too. Like, what she said and how she said it damaged him. And she just kept doubling down when she KNEW it hurt him! She needs to either get out of the dating scene or have deep therapy… or both!\n4. OOP's ex-gf is still hung up on her ex-bf that dumped her. There is no coming back from that.\n  - Yeah, you could replace “bigger dick/better in bed” with “smarter,” “funnier,” “more charismatic,” “more artistic and creative,” “more empathetic,” “more passionate,” or any number of positive attributes. Add that with the caveat that the current bf/spouse/whomever could never compare and that they are irreparably less-than in that attribute, and you just detonated that relationship.\n5. \"Comparison is the thief of joy.\" \\~ Theodore Roosevelt\n6. Yikes some of these comments do not pass the vibe check. 😬😬😬\n7. Years later, she's talking about her ex sexually. For her to talk about it, she thinks about it. \n\nUnless she finds a guy rocking a subway car, this will always be in her mind and poison all future relationships.\n\nBullet dodged.\n8. Regardless of the sex.\n\nShe betrayed his trust and effectively ended the relationship because she had fun gossiping at her partners expense. I would exit the relationship too. I would never trust her again to have tact or discretion. She is an idiot and lacks compassion so his example was fitting as hell.\n\nAnd regarding the sex, he was in no way wrong there either. People called him insecure, seems like projection more than anything.\n\nShe is angry and making it about the sex and not the absolute betrayal……that he had to fucking explain to her. She tried to backpedal on the sex thing(which she would of course say what he wants to hear to salvage the relationship, before doubling down……so you know it’s how she really feels. But she has no problem lying to him to for her benefit.\n\nHe dodged a damned immature and selfish bullet on this one.\n9. If you look at OOP's profile, he comments that her comment f'd him up so bad that he developed ED and major esteem issues after the break up. Hope he's doing better. \n10. Well… that was long\n11. I've literally never had a conversation with friends about their partners specific body parts, and find it weird that folks think it's ok. \n\n## 12. A Soviet woman who lost 7 sons in World War 2 (from r/MrInteresting)\n\n**Score:** 4110\n**URL:** https://i.redd.it/5g5gvd9vdrlf1.jpeg\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. Don't tell me she got a loaf of bread for each of them?\n  - No, she made funeral bread for each of them, though here its less fancy because of the war\n    - Russian funeral bread can refer to black bread left with vodka as a parting gift for the deceased at memorial services, or a larger, decorated bread known as Kolach or Kulich, which is blessed in church and served with fruit during the memorial period. The custom of leaving bread is a symbolic gesture, honoring the departed and connecting back to the traditional Russian value of bread as a symbol of life and hospitality.\n\nCopied from AI\n      - Funeral bread like Kolach is braided (similar to Paska Bread) but when everything is scarce its going to be simplified\n      - I never knew about that tradition. That’s interesting.\n  - I believe it’s a tradition where she has to bake a loaf of bread for each son that was lost.\n2. The image is constantly reposted with an incorrect attribution. The men are not her sons, but brothers.\n  - &gt;The image is constantly reposted with an incorrect attribution. The men are not her sons, but brothers.\n\nSo their mom lost her sons.\n3. So heartbreaking, that we, the people, didn't learn anything. We let us divide like gang chimpanzees. Don't go into war for some psychos.\n  - They’re bankers wars for resources. I would never go to war it’s the stupidest shit ever to fight for the rich\n    - Wanna beer at the lake? Got some rods for you.\n      - I need that bad I feel like I’ve only seen concrete and pixels all summer :/\n    - Ehh ww2 was a different situation. The Allies sacrificed a lot to stop the Nazi reich, imperial Japan and fascist Italy\n4. This is the opposite of that picture of the American mother who had all her sons survive.\n  - That's exactly what I was thinking about, someone is full of joy and someone else is experiencing hell\n5. There was a Vietnamese mother who lost 9 sons to two different wars, against the French and against the US. \n\nNguyen Thi Thu\n  - She lost her husband too I think, it's tragic, there's a huge monument for her in her hometown\n    - Yep, and some grandchildren.\n6. The Soviet nightmare version of saving private ryan.\n7. Not enough is talked about the brutal ammount of soviet soldiers and civilians that died in WW2. About 24 - 27 million. More than any other group. I know it's not a competition, but it always set wrong with me how little their sacrifice is acknowledged.\n\n## 13. Is Aragorn the best fantasy male character? (from r/lordoftherings)\n\n**Score:** 1371\n**URL:** https://i.redd.it/qykckw5dntlf1.jpeg\n**Body:** I’d love to ask best male character in general but I’ll just leave it with fantasy as to not compete with other genres. \n\nAnd I may be a bit bias here cuz Lord of the Rings are my favorite movies. The world is full of lore spanning back thousands and thousands of years. The music is top tier, the picture absolutely holds up even more than 20 years later. The story is great and then there’s the cast, truly perfect casting for every character. But we’re here to talk about Aragorn, sorry for getting sidetracked a little lol I love to nerd out about Lotr. \n\nFor those who haven’t read the books and on first watch the audience is meant to think “Strider” is a shady character when we first seen him, maybe a bad guy. Then after Frodo accidentally wears the ring Aragorn takes him away to his room and starts letting us know he knows much more than we’d think and convinces us he’s there to help and saves the hobbits from the ring wraiths. And then he fends off several of them on the watch tower showing us he’s a bad ass dude, just not long ago he said the rings wraiths used to be great men, great kings and he soloed them with ease. He’s shown to be thoughtful and providing the hobbits with food and guiding them to River Run. \n\nHe’s shown to have an inner conflict with himself about his lineage being Isuldur’s descendant but still makes it a point to do the right thing. He’s either the first one to offer his sword in Frodo’s service or the second after Gandalf. Being aware of the rings corruption he keeps a close eye on Frodo as he knows Borromir wants the ring whether for just reasons or selfish. He’s fearless in battle willing to sacrifice his life for others. He’s not afraid to show his softer side when he thinks Frodo is killed and then when Gandalf falls to his death(so he thinks). Outside of Moria he understands the fellowship has lost the greatest ally and knows people are sad beyond grief but has the foresight to know those orcs/goblins will be out chasing them and wants to flee to Loth Lorien for protection. \n\nHe tries to comfort Borromir as he can tell he’s at unease in the elf kingdom reminding him he’s safe and should rest. Fast forward towards the end of the first movie he can see the rings corruption is starting to work its magic and refuses the ring when offered and makes the hard decision to let Frodo go. He then faces down a horde of Uruk Hai by himself and slays their leader who inflicted a mortal wound on Borromir and gets to him just in time to promise him he’ll do whatever he can to save Mina Tirith. Again he lets out a few tears from yet another loss. Even tho he tried taking the ring from Frodo he can see it wasn’t Borromirs will to do that and was corrupted. He can see the honor in his repentance and absolves him of his crimes. Having found out merry and pippin were taken he sets off to free them. \n\nAlright actually this is becoming a very long post and I got in over my head lmfao. I’m assuming you know the rest of his arc so I won’t say much more. \n\nThe last thing I will say and one of my favorite scenes is when he tells the Hobbits they are to bow to no one acknowledging their bravery which has no limits and he bows to them I believe. \n\nAs far as I’m concerned the trilogy is 10 plus hours of convincing me Aragorn is the best character. He’s flawed but overcomes it all to become the king he really was the whom time. \n\nSo do you guys agree with my claim that he’s the best?\n\n\n### Top 11 comments and their replies (up to depth 25)\n\n1. To me, yes. I get the Sam love, but Aragorn has to be a leader and struggle with all the pressures that come with it. Especially feeling responsible for the lives of those who follow you and the inevitable deaths that will accompany your decisions.\n  - I prefer Faramir but only because he is more approachable as a character than Aragorn, not as lofty and kingly\n    - Faramir's my boy, definitely.\n    - It is impossible to argue against Faramir as another incredible challenger for the title. More relatable challenges make for a more relatable character in many ways, I guess.\n    - Book Faramir yes. Book Aragorn is not that likeable. I think they gave movie Aragorn a lot of book Faramirs traits for him to be more approachable.\n2. Growing up without a father in an abusive household, LOTR was one of my favorite escapes. Aragorn is what I wish my father could have been and is one of the good examples I got growing up of what it means to be a man.\n\nHe's kind, compassionate, empathetic, mentally and physically strong, gentle, humorous, and overall a good person. These are things I strive for every day. \n\nYes, for me, Aragorn is hands down the best fantasy male character.\n3. I think he's the best male role model out there. Very masculine and manly, yet at the same time, very gentle and totally in touch with his emotions, not afraid to show that he truly loves his friends and companions to the death. Manliness without toxicity and machismo. He has no use for it. Moreso manliness through kindness and a complete devotion to aid those in need without expecting anything in return. So many people today could learn from his example.\n4. My favorite character is Boromir despite his short time in the story. His actions and death have a major effect on the people of Gondor as well\n5. No, he didn’t have misgivings about his ancestry in the book, because Isildur was not corrupted by the ring unlike in the film, I think you are mixing up the two versions. \n\nBook Aragorn was not in any doubt about his claiming the Kingship. He did have moments of doubt about what to do after Gandalf’s death but never about the Kingship or being Isildur’s heir\n  - True book Isildur was on his way to Elrond in Rivendell to discuss what to do with the One ring. Movie Isildur would most likely never do such a noble thing.\n6. Aragorn is the blueprint of what a man should aspire to.\n  - Wish we have more Aragorns… \n\nInstead we have lots of Grimas\n7. ![gif](giphy|yk5PJiIfFSgUM)\n\nMe as a young woman watching Aragorn open this door\n\nYes\n8. He would be if Sam didn’t exist…\n  - I wanna hear more about Samwise the Brave.\n    - Samwise the eavesdropper, more like it!\n      - He doesn't drop no eaves, he said so himself!\n9. Im as straight as an arrow from Legolas’ bow but I would let Aragorn ruin my life so yes\n10. Wait until you hear about a guy called Faramir\n  - Faramir and Aragorn were made of the same stuff, filling different roles fate gave them. Faramir's charge as Osgiliath was the same bravery as Aragorn at the gate, but with no promise of glory; should he have somehow been victorious, it would be the same thing tomorrow, but he did it anyhow.\n\n## 14. Kantara is a Sad movie in their Perspective.... (from r/ChitraLoka)\n\n**Score:** 194\n**URL:** https://i.redd.it/8qfb2uh5jhmf1.jpeg\n**Body:** I am not complaining this is just my thought,\nTheir husbands disappeared for a greater cause, leaving them to struggle as single mothers.\n\n\n\n\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. Yes both of their husbands got vanished.\n  - They didn't want to pay Child support /s\n    - If kantara was set in black community of USA, this would have been true xD\n    - *Alimony\n\nChild support doesn't exist in india\n      - It does. \n2. ಹೆಂಡತಿಯರು ಕಂಡಂತೆ....\n  - ಡೂಡ್, ಹೆಸಿಟೆಟ್ ಎ ಲಿಟಲ್ \n\nಏನ್ flair ಸ್ವಾಮಿ ಅದು?\n3. Kind of happens in most movies. Not everyone wins.\n4. At this point, I'm only happy they acknowledged this\n5. True that\n6. It’s sad movie in everybody’s perspective.\n7. Idk how its not a sad movie in anybody's perspective. In Kannada, its usually the sad movies that become blockbusters. This was a good one too.\n8. I had this literal same thought 2 days ago.\n\n## 15. What movie that makes you sad? (from r/AskPinay)\n\n**Score:** 4\n**URL:** https://www.reddit.com/r/AskPinay/comments/1n29dam/what_movie_that_makes_you_sad/\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. Grave of the Fireflies — once you’ve seen it, you’ll never forget the heartbreak.\n2. Anything na may aso.\n3. Tinker Bell and the Legend of the NeverBeast :(( my go-to movie if gusto ko maiyak huhu\n4. Yung main character yung pet 😢 Tsaka story na may nagsusuffer na bata\n5. Bridge to terribitha\n6. pursuit of happYness, sikip ng dibdib ko don\n7. A walk to remember\n8. Coco. Iyak malala talaga ako\n9. Strager things\n10. Castaway :(((\n11. Taking Chance, tapos Thank you for  your service\n12. La la land– iba yung hagulgol ko kasi I didn’t expect na it’s a movie that would make you cry. When I watch other sad movies kasi expected ko na iiyak ako eh\n13. Greenbones, Iska\n14. Engkanto that movie I thought na harmless? Scam I bawled my eyes out\n15. Jojo Rabbit\n16. Any movie na may illness na nakakamatay\n17. Movies na mentally challenged ‘yung bida and they have hardships sa life :( e.g. Miracle in cell no 7, I am Sam\n\n---\n\n"}