{"content": "## 1. A South Korean monk performed a Buddhist ritual for Saja Boys. (from r/KpopDemonhunters)\n\n**Score:** 187\n**URL:** https://www.reddit.com/gallery/1n2ta6q\n**Body:** News article source:\n\n[https://www.bbc.com/news/articles/cz0yzxx3x08o](https://www.bbc.com/news/articles/cz0yzxx3x08o)\n\n### Top 10 comments and their replies (up to depth 25)\n\n1. ✨Thank you for posting in /r/KPopDemonHunters! Want to hang out with fellow fans? Join our [**affiliate Discord!**](https://discord.gg/sxx9m65JtC)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/KpopDemonhunters) if you have any questions or concerns.*\n2. \"At least someone thought we all deserved a shot of redemption, *Jinu.*\"\n  - Lmao the salt is real 😭\n3. Rest in peace Saja Boys 🙏\n\nhttps://preview.redd.it/3u2fh58hvulf1.jpeg?width=637&amp;format=pjpg&amp;auto=webp&amp;s=00c856c68726eac787f2c7b38ccc4748f1ba0b8e\n4. ok as a buddhist myself this is funny haha. I love how the saja boys not only captured fangirls but the vatican and now  monks too. Who's next?\n  - Yes, please elaborate on the Vatican’s response? Lol\n  - The Vatican 🇻🇦? Haven't heard about that lol\n    - [Catholic World Youth Day account response to our recent Vatican Saja Boys post ](https://www.reddit.com/r/KpopDemonhunters/comments/1n15tad/catholic_world_youth_day_account_response_to_our/)\n5. &gt; guide the souls of the band to peace and *rebirth*\n\nSaja Boys respawn confirmed! 🔥🔥🔥\n6. https://preview.redd.it/x0owf6jaexlf1.png?width=742&amp;format=png&amp;auto=webp&amp;s=c8be118347d69fcd18e23c44e6a654276fdcef4c\n\nyou guys must check this saja boys altar from article haha  \nthat monk vtuber youtube&amp;X ID is illegalmonk\\_v\n7. It's ironic this ritual for the Saja Boys was attributed by the BBC to a youtuber named *illegalmonk\\_v*\n\nhttps://i.redd.it/ijtutzb7dvlf1.gif\n  - The guy's name is 불법스님, which can mean illegal monk. The punny thing is that 불법 can mean either illegal or buddhist doctrine. Here's the link to the KDPH highlights btw (https://youtu.be/3jIgvzeW-eA).\n\n Likewise, the fictional temple name he uses, 의문사, can mean either a temple named 의문 or death by unknown causes.\n    - Ty for sharing the original link to this interesting story.\n8. Now i want saja boys vs sun wukong\n9. Saja- angel of death\n\nI didn’t know that I assumed it meant lion or something!\n  - Specifically Jeoseung Saja (저승사자) means something akin to grim reaper.  Jeoseung (저승) means afterlife, and saja (사자) means messenger. But saja (사자) also means lion as well.\n    - Wow, I keep learning new things about this movie and Korean culture and folklore\n    - Oooh so that's why their logo is a lion! I never really understood. Basically they are hiding the other meaning of the word with the lion logo\n      - Yes, and if you look closely, the lion's nose and mouth form a shape of a demon! Which becomes even more prominent during Your Idol performance when the logo changes - the nose that looked like a heart becomes demon horns!\n\nIt's a blink-and-you'll-miss-it type of situation ;)\n\nhttps://preview.redd.it/9dnhoppdvylf1.jpeg?width=2880&amp;format=pjpg&amp;auto=webp&amp;s=863d945bbeace63887e81c40beb6b60d467770b9\n        - Wow that is actually so cool! Love the attention to detail\n\n## 2. 18f South Korean looking for friends! (from r/chat)\n\n**Score:** 25\n**URL:** https://www.reddit.com/r/chat/comments/1n32a3k/18f_south_korean_looking_for_friends/\n**Body:** Hi! I’m an 18-year-old high school student from South Korea. I spend a lot of my free time listening to music (I especially love Radiohead), playing games like League of Legends or Minecraft, and watching baseball. I also enjoy talking about movies and books, or just sharing little thoughts from daily life.\n\nI can be a bit shy when I first meet someone, but once I get comfortable, I really enjoy having long and meaningful conversations. I’d love to meet people who are open to sharing hobbies, stories, and just friendly chats.\n\nIf that sounds like you, feel free to DM me! It would be nice if you could introduce yourself first so we can start off on the right foot :)\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. [removed]\n2. [removed]\n3. [removed]\n4. Dm’d you! Going to Korea soon!\n5. Ik after this DMs will be flooded and comments too. Funny 😂😂😂😂😂\n6. [removed]\n7. i can be your friend\n8. [removed]\n9. Dm you\n10. Be ready to counter creeps and be careful who you chatting with goodluck\n11. [removed]\n12. [removed]\n13. Hello\n14. Sure\n15. [removed]\n16. [removed]\n17. [removed]\n\n## 3. Korean movie abous spies (from r/whatsthemoviecalled)\n\n**Score:** 1\n**URL:** https://www.reddit.com/r/whatsthemoviecalled/comments/1n6sth9/korean_movie_abous_spies/\n**Body:** I've tried and haven't been able to find it, perhaps because the only two relevant clues I have aren't related.\n\nIt's a Korean movie. In it—this is the first clue—there are several undercover North Korean agents. Every so often (I think on Mondays), they meet in a library (at this point, I think there are two or three of them, two men and a woman, or a woman and a man who fall in love). They receive instructions on when to meet or information via the radio (I think they play a specific song).\n\nSecond clue, the couple falls in love and wants to escape to the south but due to various conflicts they can't, here it goes, at the end I don't know if the woman dies but only the man is on a road in South America (I think it's Brazil) on the road someone has a flat tire, when he goes to help he is killed by the owner of the other car (here it could be the other way around and they go to help him and when he turns to look they kill him, my memories are mixed up)\n\nMaybe they are two different movies (I strongly believe not, but it could be)\n\n### Top 1 comments and their replies (up to depth 25)\n\n1. Thank you for posting to r/whatsthemoviecalled! Make sure your post follows the rules and is flaired correctly. If someone finds the movie you are looking for, please reflair your post as \"found\". If this post doesn't follow the rules, please downvote this comment and report the post. Thank you and have a nice day.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/whatsthemoviecalled) if you have any questions or concerns.*\n\n## 4. I watched Joined Security Area. I'll never be the same person after that. (from r/Koreanfilm)\n\n**Score:** 310\n**URL:** https://i.redd.it/sxqjh5do44mf1.jpeg\n**Body:** Ever since I watched Squid Game and Beyond Evil, I've become a big fan of Lee Byung-Hun and Shin Hakyun respectively and I've been digging up their filmographies. Imagine my surprise when I saw that not only they played in the same movie but Song Kang-Ho, another actor whom I came to respect after Parasite, was one of the main leads too. And guess what, the film was directed by none other than Park Chan-Wook! \n\nJust to clarify some things: apart from my general knowledge of the conflict between North and South Korea, I am not very educated on this subject. If any parts of my review are worded controversially or do not reflect reality, please inform me. \n\nI went into this movie pretty blindy. The only thing I knew from the blurb was that it was about an on-going investigation about the death of two North Korean soldiers by a South Korean. I initially expected to watch a political crime thriller which would play with my mind, making me guess whether Lee Soo-Hyeok had done the murder or not. But I got much more than that. For this movie was not a simple a political crime thriller. It was about a forbidden friendship and how war ruined it. \n\nWhat initially started as a mystery thriller, quickly changed into a completely different route. The moment the story focused on the flashbacks, my attention shifted immediately. I applaud this choice for the direction of the film. Jumping from the present to the past and then going back to the present not only made me connect with the characters even more but added more salt to the wound once the final conflict took place. \n\nFour soldiers, two nations. Kyeong-Pil and Woo-Jin from North Korea, Soo-Hyeok and Sung-Shik from South Korea. Four men divided by war. Four men divided by borders, politics or something more simple, like a line. And yet, among these soldiers, a friendship managed to bloom. Despite their differences, they helped each other, laughed with each other, joked with each other - and even saved each other. The middle section of the movie was devoted to them and their bond and I am being very serious when I say that they could have added three more hours about their interactions and meet-ups and I still would want more. \n\nWhen the story went back in time and I saw how Kyeong-Pil and Woo-Jin had saved the life of Soo-Hyeok, I felt numb because I realised that what I was going to witness would be the downfall of a doomed friendship. It was so bittersweet for me to watch the friendship among these four men unfold before my eyes. Distrust and pity made way for respect, respect made way for trust and trust made way for fondness. It was so bizarre to watch these adults who had been training to kill and serve their country act like younglings and make immature jokes with people whom they considered as enemies until very recently. I laughed and on the inside I cried. At one point, I was delusional enough to hope that the outcome would be different. But alas, that was never the case. \n\nThis was the first Park Chan-Wook movie I watched and it was a grand introduction to his filmography. The cinematography and direction of the movie elevated the atmosphere and highlighted the bond between the four men. One of the most painful things in the movie was the amount of parallels and foreshadowings. Soo-Hyeok's quote about bravery that he learned from Kyeong-Pil. Woojin's drawings. Kyeong-Pil's last whistle. Park Chan-Wook pulled at my heartstrings and I was unable to do anything else besides watching the beauty and tragedy unfold before my eyes. \n\nIf I had to think of any \"faults\", I would say that the scenes with the investigation team were my least favourites. They didn't add much and they toned down the emotional atmosphere. There was an important historical piece of information that added more context and depth into the conflict between South and North Korea but it was delivered with poor English and the actor did not put the required amount of emotions in his performance to highlight how significant this information was. Thankfully, the movie didn't have many scenes with the investigation team so my overall experience was not affected. \n\nThe last shot is by far one of the most heartbreaking moments I've ever witnessed in a movie. Throughout the last half hour, I had been crying my eyes out but the last shot was my final straw for I became a mess. The ending was powerful, emotional and with it arose a big \" what if\". \n\nJoint Security Area is a desperate plea for unity between North and South Korea. An emotional anti-war film that everyone should watch. A painful reminder that whole borders and politics can seperate us, people can still find form close bonds with each other, defying those differences. Beauty mingled with tragedy and the result was this palpable political thriller that will continue to haunt me for a very long time. I kid you not when I say that I am a different person after watching this movie. I can't stop thinking about it and every time I bring back in my mind the friendship between the characters, tears gather in my eyes. \n\n_\"What's important in battle isn't speed. It's carrying yourself with composure and bravery. That's everything\"_\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. I wanna forget this movie and watch again\n2. If that's the first one you've watched, his new one is coming out soon, but my favorite movie of the last couple years is Decision to Leave. This is my favorite director. One key to this director is you can't really watch the movie one time and expect to understand it fully, e.g. JSA, Lady Vengeance, Oldboy, Handmaiden. There are always subtle cues...\n3. Now it's time to watch Old Boy (2003) for the first time.\n  - It's actually gonna be my next Park Chang-Wook movie!\n  - Need to watch The Vengeance Trilogy.\n4. When I watched JSA for the first time, I was literally awestruck. I was never used to movies like this , if this was to be remade and released  (somehow by a director with enough guts) in my country( which has its own similarities to the Korean Peninsula BTW) it would have been censored left right and centre to the point where it just becomes another ‘military propagandist movie’. \n\nThe meaning of the movie is so profound, that it still gets me thinking about it today. This is example of true freedom of art💯\n5. https://preview.redd.it/03ebruozy5mf1.jpeg?width=4032&amp;format=pjpg&amp;auto=webp&amp;s=651cd5b0f0aed8ace2d845c05963f229ba70edad\n6. Amazing AMAZING AAAAAMMMMAAAAAAZZZIIIING\n\nNow check out Decision to Leave\n7. Where can I find joint security area in Italian and especially the handmaiden?\n8. Love this movie😊\n9. youll have to rinse it with\n\n\nSympathy for Mr Vengeance \n\n\nthen a little sprinkle of\n\n\nOld boy\n\n\nand to cap it off\n\n\nSympathy with Lady Vengeance\n  - Park Chan Wook is the GOAT of Korean Cinema\n10. I watched this movie when I couldn't really understand any Korean, so most of the dialogue was a mystery to me, but one scene stuck in my mind where Lee Byon Hon's character tried to strangle the inspector lady, because she just wouldn't let those poor bastards live and kept into more info from them. Really powerful scene.\n11. Lee Young-ae barely resembles herself in this poster.\n12. My favourite korean movie, very powerful.\n13. Park Chan-wook's first movie is a good place to start.\n14. JSA is one of my all time favorite Korean movie. Beautiful story and beautifully shot.\n\nThe only negative I have about the movie is the English spoken by Lee Young Ae &amp; the foreign actors\n15. If you're a big fan of Lee Byung-Hun, have you seen Masquerade? It's my favorite Korean movie and he is brilliant in it. Masquerade just became available on viki.\n16. I enjoyed it so much.\n17. One of Quentin Tarantinos favorite korean films. Watched it because of him. Good movie!\n\n## 5. Park Chan Wook's 'No Other Choice' - Review Thread (from r/movies)\n\n**Score:** 234\n**URL:** https://www.reddit.com/r/movies/comments/1n47fwf/park_chan_wooks_no_other_choice_review_thread/\n**Body:** *When a man is abruptly laid off by the paper company where he has worked tirelessly for many years, he grows increasingly desperate in his hunt.*\n\nCast: Lee Byung-hun, Son Ye-jin\n\n**Rotten Tomatoes:** [100%](https://www.rottentomatoes.com/m/no_other_choice/reviews)\n\n**Metacritic:** [86/100](https://www.metacritic.com/movie/no-other-choice/)\n\nSome Reviews:\n\n[The Hollywood Reporter - David Rooney](https://www.hollywoodreporter.com/movies/movie-reviews/no-other-choice-review-park-chan-wook-lee-byung-hun-1236357175/)\n\n&gt;Whatever flaws there are in the execution, the fact remains that even a subpar Park Chan-wook film has more going for it than a lot of directors’ best work. The movie remains the work of a master craftsman with his own idiosyncratic storytelling signature, though the pathos and suspense of a hardworking family man driven by desperation to murder get short-changed in favor of wacky humor.\n\n[Time Out - John Bleasdale](https://www.timeout.com/movies/no-other-choice-review-2025) \\- 5 / 5\n\n&gt;With humour blacker than black bean noodles, the film is a masterful work of cinema which might well be Chan-wook’s masterpiece. And given this is the man who directed The Handmaiden that’s saying a lot.\n\n[The Wrap - Steve Pond](https://www.thewrap.com/no-other-choice-review-park-chan-wook-lee-byung-hun/)\n\n&gt;The phrase “no other choice” is repeated many times by many people in many contexts in the film of the same name, so we might as well add another use of the phrase right now: South Korean director Park Chan-wook has no other choice but to make big, bold movies that always flirt with going over the edge, and sometimes do a lot more than flirt. It’s not as virtuoso a blend of social commentary and wacko violence as, say, Park’s countryman and occasional collaborator Bong Joon Ho’s “Parasite,” but it’s a kick nonetheless.\n\n### Top 10 comments and their replies (up to depth 25)\n\n1. Glad to see lots of Lee Byung-hun and Son Ye-jin praise in addition to Park nailing it like usual. Two of Korea's best actors\n  - the time has come for everyone outside of Korea to fall in love with Son Ye-jin too\n    - And for those outside Korea to know that she's got a wider range than just Crash Landing on You\n2. If Neon does a release for this in a theatre close to me I'm going day 1\n  - I feel like they have to. Parasite was a South Korean movie that got a theater run and then won best picture at the Oscars. On top of that Park Chan Wook is one of the best to ever do it. Oldboy is an ICONIC movie.\n3. He doesn't miss, I don't think he has a bad movie.\n\n\nSo looking forward to this.\n  - His first 2 movies were so bad that he spent the next 8 years mastering the craft. Truly a legend.\n    - I've watched Trio (his 2nd film) and I can confidently say it's not bad at all and he should disown Stoker instead\n    - Same thing happened to Villeneuve (9 years between Maelstrom and Polytechnique)\n4. I just watched “The Ax” (2005) in anticipation of this film and it was pretty engaging. Seeing that story I’m sure Park Chan-Wook would make a meal out of it. Really looking forward to this one.\n5. Seeing this in a couple weeks at TIFF, can't fucking wait.\n6. Man never misses\n7. Can’t wait to see this in a couple weeks!\n8. Watched it in Venice. Absolute cinema\n9. when is it releasing?\n10. How can I watch it in India without pirating? Mubi has taken the rights to stream in a few countries which doesn't include India. \nEager to watch another Park-chan Wook peak cinema. 🥺\n  - Which countries can stream?\n\n## 6. Why do Kpop fans call it racism when Kpop songs don’t get international fame? (from r/kpoprants)\n\n**Score:** 4\n**URL:** https://www.reddit.com/r/kpoprants/comments/1n4slhs/why_do_kpop_fans_call_it_racism_when_kpop_songs/\n**Body:** I keep seeing this take: « If Kpop doesn’t become big internationally, especially in the US it must be racism ».\n\nHonestly, I don’t agree with this at all.\n\nI agree that there is ethnocentrism in the music industry and its or the point that explain Why kpop isnt « that much » popular in Occident ect but i dont think its outrageous that it exist and keep existing.\n\n6 Point peoples need to take in count if they think this take is true.\n\nSorry if im a bit offending it wasnt my pain goal but this kind of take miss me off so much.\n\nIf u dont Believe in this take u dont need to be offended by my point i think.\n\nEnglish is not my first language so I used chat to put it in form after writting and I Even modified it after that so its a bit Messy and I will tries to organise it later but please bare with it for now.\n\nTLDR :\n\nExpecting every culture to embrace foreign music at the same level as their own is unrealistic. Music is tied to language, identity, and cultural habits. Honestly, calling this racism feels like main character syndrome. People can love one or two K-pop hits without being obligated to love all 100 of them.\n\nStop making some exception the rules for the music industry.\n\nUpdate :\n\nMy post isn’t about whether K-pop artists deserve or can top US charts, or denying that they sometimes face racist or harsh comments. Any song can top US chart no matter the country they are from. All domestic and foreing artist face the harsh comment from the music industry of a country and some racist comments if their skin color or origins are different from the country they want to make it.\n\nAny song in any language can succeed internationally, thanks to marketing, timing, or luck. K-pop has already broken through in the US with some Little English words likePsy, Blackpink, Twice.\n\nK-pop doesn’t always top charts mainly because it’s a different genre and due to at least ethnocentrism or, at worst, xenophobia. Some groups also miss opportunities, like working on popular Kdramas or movies.\n\nCalling it directly racism is misleading the gap between ethnocentrism, xenophobia, and racism should be used carefully. Most of the time, it’s about market codes and audience expectations, not discrimination for why they arent toping. And also that its the case for every domestic market against foreign artist.\n\nLets start :\n\n1.\t⁠⁠⁠K-pop and any artist from a country can succeed internationally\n\nSome artists in kpop already proved it’s possible and in different ways :\n\nBTS by adopting English lyrics in their songs.\n\nBLACKPINK and TWICE with massive global hits (mostly korean lyrics and a little bit of english).\n\nFifty Fifty with Cupid, which went viral thx to TikTok (joke aside 50-50 korean and english lyrics)\n\nTake Aya Nakamura’s Djadja as an example. It’s French pop/urban music that reached international success (1 billion in YTB) thanks to timing, luck, and the song’s appeal. Not every artist achieves that, and the song isnt necessarily meaningfull and i dont like this song honestly but That’s just how the music industry works : a mix of skill, timing, appeal, and LUCK.\n\nAnd she isnt even the best or most popular singer in all of french music history just so you know.\n\nThey are all exceptions that can occur from time to time because of trend/advertizing or idk LUCK.\n\nSo clearly, Korean music is not blocked from success. But expecting every group or every song to blow up worldwide is just unrealistic.\n\n2. Why do you only focus on the U.S.?\n\nWhy is it suddenly racism if Kpop doesn’t dominate the Billboard charts? Nobody complains that K-pop isn’t #1 in France, Spain, or Italy. By that logic, Europeans are Even more racist than them.\n\nAnd  with this mindset Koreans too are racist because Barbara Pravi or Rosalia (or any european pop singers) don’t chart in top of Korea or just even in korea at least.\n\nThey are obvioulsy not racist. Success abroad depends on culture, taste, luck and exposure not just discrimination like some kpop fans think it is.\n\nUS/English market is kinda the most connectée market in people mind with bilboard grammies etc but its not even the biggest (indian, Chinese and LATAM market are even bigger in terms of how many people can listen to your music).\n\n3. The U.S. isn’t the main objectives of your kpop groups (even if you think it is)\n\nYes, the Grammys are huge, but France, Spain, Korea, Japan, etc. also have their own major music awards. If fans only drool over US. validation, they’re the ones putting the US. at the center of the world of their group who dont care about it as much as you do.\n\nIt’s important to remember that most KOREAN POP groups prioritize winning domestic awards and maintaining popularity in Korea over trying to adapt their music to every international market. They aren’t going to sing all their songs in Spanish just to top charts in South America and win a Latin Grammy, only to return and sing in spanish for their home audience thinking that its okay we won a grammy by singing in spanish so koreans will love it too.\n\nTheir primary market is Korea, and focusing on it makes sense it’s just smart strategy that everyone in the industry follow.\n\nAnd this point apply to every artist.\n\nBUT STILL I wonder Why  AMERICAN artists for some reasons try to top in US market. 🙃\n\nAnd same for french in France.\n\nItalian in Italy.\n\nU see the logic here.\n\nThe only exceptions is when your country has many languages like belgium or many country speak your language like in south america with spanish. But technicaly its kinda the same evrywhere u top mostly where people speak the language u sing.\n\n4. Language and accessibility matter\n\nIn the U.S., the two most dominant languages are English and Spanish. Naturally, songs in those languages dominate the charts. That’s not racism that’s just history, demographics, and accessibility. If you want to know why those languages spread so widely, the answer is literally in history books.\n\nKorean didnt spread like that and wont spread Like that except if they want to rewind time and do remake of 1492.\n\n5. Timing, structure, marketing and Luck matter too// KDH case //Marketing for kpop groups in Korea is bad\n\nTake K-pop Demon Hunters as an example. It succeeded because it dropped at the right time, with no competing films in the same category, on the world’s most popular streaming platform, Netflix, produced by one of the top studios, Sony, and featured songs like Golden designed to appeal to American audiences. The production was handled by professionals who know their job.\n\nIf more K-pop groups featured in movie, anime, or K-drama OSTs, they could reach a much wider audience. I discovered Stray Kids (i dont stanthrough their Tower of God openings and endings. Even in Korea, idols aren’t very present in K-drama OSTs, which are actually the second most popular Korean export after K-pop.\n\nImagine if a kpop group contributed to THE GLORY (this drama is overrated as f and dont deserve his fame thats a 6,5/10 at best but thats another topic) or SQUID GAME OSTs. Internationally, people would likely enjoy it, especially with slight adjustments to please an international public a little bit more.\n\nOf course, the quality of the work matters, but luck plays a huge role. Even well marketed songs don’t always achieve the success they aim for. That doesn’t diminish the skill or effort behind the production it’s just how the music world works.\n\n6. Ethnocentrism in music is normal, not shocking\n\nIn music, the preference for songs from your own culture or language is completely normal. People connect more deeply with songs they understand, or with styles they grew up around. That doesn’t mean they hate other cultures.\n\nIn many Western countries, English is so dominant that English songs are often consumed. But still most songs topping the charts are in the country’s main language. For example, english music rarely charts in France, even though the countries are culturally close. This isn’t racism people naturally gravitate toward music in their own language or what they’re most exposed to. French audiences mostly listen to French artists, Koreans to Korean music, and Latin audiences to Spanish-language hits. That’s just how music consumption works everywhere.\n\nConclusion:\n\nI’ve never seen any other music fandom take this approach. Maybe other fandoms do and I’m wrong, but I’m pretty sure K-pop fans are the ones who complain about this the most, every chance they get.\n\nSo yes, cultural bias exists, but reducing every lack of success to racism oversimplifies reality. Global hits depend on exposure, language, timing, taste, and marketing. Claiming it’s always racism just because your favorites don’t chart in the U.S. makes some K-pop fans seem a bit out of touch.\n\n### Top 13 comments and their replies (up to depth 25)\n\n1. Thank you for posting at r/kpoprants. [OP and commenters are expected to have read our general rules before posting.](https://www.reddit.com/r/kpoprants/wiki/rules/rules/)\n***\n#### &amp;#x1F4CC; This is a discussion forum! Please remember to engage productively and respectfully!\n#####Any singular comment or mention of lines like or similar to:\n\n* It’s not that deep\n* Nobody cares, no one is reading this, etc\n* Why do you care about this?\n* Just ignore it, just unstan, just stop listening to, etc\n* Not this post again, why are you always ranting about, etc\n* This is just a hate/anti post/OP is not a real fan of X, etc\n* User is a snark sub user\n\n#####[Will be removed and subject to a ban.](https://www.reddit.com/r/kpoprants/comments/17v33io/town_hall_9_the_end_of_its_not_that_deep_2/?utm_source=share&amp;utm_medium=web2x&amp;context=3)\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kpoprants) if you have any questions or concerns.*\n2. Another thing, not everyone likes pop! My sibling loves heavy metal and hates American pop, why would she like another countries pop music?\n  - Yes, that’s another point I didn’t cover because I thought it was common sense.\n\nBeyond that, I think K-pop fans are sometimes too devoted to their favs. All fandoms have hard stans, from K-pop to US rap, but in my experience, the average K-pop fan is far more intense than the average US rap fan. I take US Rap but it could be \nC-Rnb fan or  Us Pop fan.\n\nPeople complain that Kpop isn’t counted in the pop category and is sidelined, but when you see how much effort fandoms put into making sure their favorites win, it starts to make sense. Imagine if everyone in China bought tickets online just to push Ne Zha 2 to win an award in a Western ceremony, without even going to the theater.\n\nMany K-pop fans act like K-pop is just US pop, but the singing style, the Korean language, and the cultural codes make it fundamentally different.\n\nAll those point also explain why its not top oing everytime and thats still not racism.\n3. I saw a music critic on a Korean show explaining about BTS 's success in the West. He said that because of xenophobia they don't get play on American radio stations. The show host then said that to be fair, if he was listening to the radio and an English song came on, he'd change the station thinking it was an English language station for expats or something. \n\n\nAnd that's not even a fair comparison because English is a second language in a lot of countries. Ask how much music in German gets played on Korean stations, or any European language. I don't think it's because Koreans are racist but because radio stations play what their public demands. It's not racist or xenophobic that the majority of Korean radio listeners want to hear music in Korean.\n\n\n\nPeople gravitate toward music they can sing along to or whose lyrics they can understand without having to do research on the Internet. There's a market for most things. I listen to a lot of French indie music  My husband is really into some Norwegian artist right now. Those don't play on the radio here either.\n4. I’ll go in a slightly different direction and say that the music itself is not the main reason K-pop isn’t as popular in the U.S. (and in other Western countries), we have seen K-pop songs blowing up. At least, it’s not the *only* reason. We’re talking about the idol industry. The K-pop system has never been particularly popular in the West, even child stars like Disney Channel kids aren’t really a thing anymore. The idol industry has its own very specific way of managing promotions and image, and I personally believe that even after years of trying to break into the U.S. market, K-pop companies still don’t know how to promote effectively in the West. Most idols aren’t prepared for it either; they’re trained for the Korean and Asian market, not Western audiences. And let's not forget that BGs and GGs, but especially BGs, were never really the most respected in the west, even the American and British ones, and even more than one group co-existing peacefully, it's hard AF as well, and K-pop promotes mostly groups. \n\nMainstream radio stations don’t just play songs because they’re good or have fans; they play what the average person already knows and likes. Yes, there are niche stations (rock, metal, indie, jazz, etc.), but mainstream radio has always been about familiarity as well. Even if an artist has a massive fanbase, if they’re unknown to the general public, they won’t get much airplay. I know tons of metal bands that sell out stadiums, sell albums, and have loyal fans for decades, but they’re still invisible to the GP. Their fans don’t demand radio play either, especially not for foreign acts. And while racism is definitely a part, it’s not the *only* one. Most stations promote artists from their own country first anyway.\n\nWhat I find strange is this obsession in K-pop fandom with radio play. Most people only hear the radio in their cars or at the mall. Meanwhile, songs like NewJeans’ tracks, ‘Cupid,’ and groups like BTS, BLACKPINK, SKZ etc, are already everywhere on TikTok, touring worldwide, headlining festivals, and breaking into mainstream pop culture. I cannot understand why some fans don’t seem satisfied unless they get radio validation.\n\nIf you *do* want airplay, you need some name recognition. Even U.S. indie artists don’t get much radio exposure until they’ve built a reputation through gigs, interviews, late-night shows, etc. K-pop groups are trying that route, but K-pop doesn’t fully appeal to the average Westerner. The idol image is hard for people to connect with. There’s a level of censorship and polish that feels unnatural to Western audiences. The language barrier doesn’t help either, you just can’t pass on the same charm and personality when most members don’t speak English as well as Korean. That’s why Western promotions often feel awkward. Even groups like BTS or BLACKPINK, who’ve adapted the best to U.S. media, still come across as stiffer compared to how natural they are in Korea. So, even if they have the name recognition, it doesn't mean that the average person really vibes with them.\n\nRacism definitely plays a role. But if we’re being realistic, it’s not the only issue here.\n  - I agree with you. I didn’t want to write a long post, so I didn’t cover all the points you mentioned, which are true and apply to every domestic music market. I’m not denying that racist behavior exists because every country has it, and K-pop artists can definitely face racist comments at times sadly.\n\nMy post is about something else: why K-pop doesn’t always top the charts. It’s not mainly due to racism, but rather ethnocentrism at least, and xenophobia at worst from foreign music markets. People need to use these three terms ethnocentrism, xenophobia, and racism carefully, because there’s a big difference between them. Racism exists, of course, but it’s not what’s blocking K-pop from topping charts like some fans think. It’s just the codes of the music market that make it hard\n5. I agree with your first point, Korean music isn’t blocked from success, but in the US people are generally less inclined to listen to songs in Asian languages unless they’re trendy (like Megan Thee Stallion with Yuki Chiba). You’ll sometimes see Chinese or Japanese tracks go viral for their “cute” vibes on reels and clips, but expecting *every* K-pop group or song to blow up there is indeed unrealistic.\n\nThe US is such a focus by everyone because it’s the biggest and most influential market. History shows that when something breaks in the US, it often spreads globally. That’s why American artists like Olivia Rodrigo can go in a worldwide tour after one album, and why UK, Canadian, and Australian acts usually aim to make it in the US too (often once they’ve found local success).\n\nThere is also the good point you make about culture. Beyond language, Americans listeners just don’t relate to Korean idols. That’s why JYPE and Hybe are creating “global groups” with mostly American members or members who are deeply familiar with US culture. It makes it easier to connect with audiences, trends, and industry networks (especially in LA, where connections matter a lot).\n\nOf course, the US isn’t the only goal. Some groups are clearly meant for Asia and/or Korea, but when you see heavy promotions, collabs, chart-focused releases, or US activities, it’s obvious they’re aiming for that market too, and it makes sense. So I disagree with you there saying it is just fans, because plenty of idols openly say they want Billboard hits or Grammy-level recognition.\n\nThat said, you are right, their main market will always be Korea, that is where they are based, that’s why it’s K-pop. Groups outside that ecosystem aren’t K-pop.\n  - I really agree with what you Said.\n\nMy point wasnt to said that asian are liked by the US industry. Its more to say that the code to Break trough this industry is the same for everyone who is not singing in english or spanish. I think that some if not most of the kpop fans are a bit to focus on the KPOP industry to actually see the reality of all this situation.\n\nUs Market is the most connected market cause because of the history almost everyone understand english but in real market capacity its not the biggest one if we take the who understand english as a second language.\n\nMy point is not that Kpop shouldnt focus US market. My point is that if Kpop want to go and succed In the US market (not just having a song who made it first on a bet) and be promotised like US Pop songs they need to use the US Pop Code.\nIts not just using some English or spanish words. Thats just the start. They also need to ado at there way of singing,using autotune, Dont focus that much on the visual aspect and more on the live dance \n\nNe Zha 2 is the most viewed movie of all time and its mainly because its adapter to Chinese market and i think use chinese myth codes (I didnt see both  Ne zha movies). In US it isnt that much popular and I dont think its just cause american dont like asian. Its mostly cause they arent sensible to chinese myth or the way They narrate, the way the animation look etc. So many points that make it big in china and mid in Occident in terms of number.\n6. This is a thing?? People actually scream racism when kpop songs don't do well??\n  - Yeah.\n\nI get that some fans think racism is the main reason K-pop groups don’t consistently top in the US. Yes, there are racist trolls and harsh comments, but every artist faces that. US stars get hate too, and still top charts. \n\nWhat really matters in why kpop thons top as much as some kpop fans except it to do, is  that Kpop as a whole industry keeps its own codes (big groups, emphasis on visuals, Kpop sound,some minors in groups) wich don’t fully match with Occident mainstream taste nowadays. Occident do/did some of those things but its quite rare (minor singer we can think of MJ or JB, BoysBand avec One direction etc).\n\nThat doesn’t mean it’s bad, it just means it wont guarantee succes cause it works in korea.\n\nAlso, people forget that luck plays a massive role in the music industry. Many worldwide hits can’t be explained by strategy or talent alone, sometimes it’s just timing and chance. BTS broke through with English singles and collabs, but that’s not something every group can replicate. If others don’t hit the same success, it’s not automatically ‘because of racism,’ it’s also because of market differences and pure luck and wise marketing décision.\n\nIn the music industry some people dont do the difference between ethnocentrism , xenophobia and racism. For Kpop Case in US its at least because of ethnocentrism and at worst xenophobia and also how kpop try to export her music to the US market. Most group dont maximize their marketing. They dont use kdramas soundtrack or animated movie soundtrack to stuck in people heads. Imagine IVE or Aespa singing Golden for KDH. They will be the one toping and with how the song actually sound like many kpop groups could have pulled it I think (i like the actual version but you get what I mean).\n7. Good really good entertainment is popular anywhere, there is no room for second best talking globally\n  - ?\n8. [removed]\n  - Hello, your comment was removed because you do not meet the minimum account age of 2 days or  do not have the required karma. This measure was put in place to reduce troll and spam comments, and for the benefit of the subreddit community.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/kpoprants) if you have any questions or concerns.*\n9. In France, there's a cultural snobism. They think that pop music is commercial shit, that to be talented, you can't be too successful and popular. They do the same to movies.\nThey considered K-pop as a minor genre for teen girls, and lit of countries tend to think the same. They're treated like occidental boysbands who are considered talentless and only have success because of their looks.\n  - I kinda disagree with you.\n\nYes, France has some cultural snobbery, but nowadays it’s more about ethnocentrism than rejecting popularity of foreign sources. French music market is quite open honestly.\n\nSaying French people dislike artists who are too popular/successfull is just wrong. JUL, a French rapper sold out a big football stadium in France in some minutes. Clara Luciani, more on the pop side, has been booking Zéniths and big Arenas for years. Clearly, success itself isn’t the problem like u think it is in the French mentality.\n\nNot liking K-pop doesn’t make people “snobs.” Like Western boybands, K-pop mainly targets teens and young adults. That’s not an insult, thats just the reality of the market. Backstreet Boys and One Direction started the same way, and K-pop does too.\n\nBut K-pop has elements that don’t always fit Western expectations: the oversexualization of minors, the oversized groups, the emphasis on visuals over live vocals. That doesn’t mean there’s no talent, there are plenty of great performers and a few true artists but “talent” isn’t defined the same way everywhere. And yes, aegyo can also feel off-putting and i would dare to say cringe to many.\n\nTo how much kpop is cool in some aspect, you need to accept that the code of Kpop cant be universally accepted just because for you its the peak of the Entertainment and music.\n\nEvery market has its own codes.\n\nAnd about cinema: France is actually one of the most open markets for foreign films, especially independent ones. The “snobism” you mention is aimed more at French movies than international ones and also note that popular comedy is the number 1 type of movie in France wich kinda contradicts the snobbery you're talking about.\n\nSo yeah, elitism still exists but in French music market not really.\n\nSo saying France (or the Occident ) hates K-pop because they think it’s too simplistic or idk is not why explain why they dont top in foreign market and why they are sidelined as kpop and not as pop. Actual K-pop isnt realy meant to adapt well to Western markets. The kpop group like Katseye are meant to work on the US market and its working cause. Kpop groups also tend to miss cross-promotion opportunities: for example, if groups like IVE or Aespa were tied to big K-drama or animated movies like KDH Soundtrack, they could break through internationally more effectively (stray kids participate in Tower of God anime and I personaly know them from there and it made me want to listen to them afterwards).\n10. I think people forget that kpop is still a niche genre in the US. The massive success of some Big 4 groups and Kpop Demon Hunters hasn't changed that. It's also competing with like a dozen other genres of music that are as popular if not more popular in the US. Are there people who won't give kpop a chance because of racism/xenophobia? Of course, but let's not act like it was going to take over the US music industry if that wasn't the case.\n11. That's my point. Jul is popular and has a lot of fans, but medis  mocked  and snob him, treating him like a joke, and the same was true with Aya. Straykids have sold out Stade de France twice, and the media just ignored them. Same at the last gala des piecces jaunes G-dragon and Taeyang  have sold the ticket in 2h, they said it was Katy Perry and John Legend.\n12. I think there are a lot of reasons that k-pop hasn't become mainstream in the US (can't speak to the rest of the international market because I live in the US) and I think racism is definitely part of it. Don't know if I'd say it's the biggest reason, though. I think for one thing, most k-pop acts aren't releasing music that's in the styles that's trending right now. If you look at the biggest acts in the US right now, k-pop artists aren't releasing anything like what they're doing. \n\nI also think a lot of it comes down to most people not vibing with music that's in a language they can't understand. Lots of people like to bring up Spanish music when they conversation about k-pop comes around, but I don't think those people are taking into account how many people in the US speak Spanish compared to Korean, whether as a first or co-first language, or because they were required to take classes in it in school. \n\nI think the third reason is likely racism. I mean, we've never had a mainstream pop act in the US, to my knowledge, that was East Asian, even that sang in English. Right now, there's Olivia Rodrigo, but she's half-Asian and most normies I've talked to assume she's either white, Hispanic, or mixed of those two. I love Psy and I love Gangnam Style, but that song managed to chart in the US because it just went along with a lot of people's stereotypes about Asians being weird. And I think even with groups that are trying to be taken seriously, a lot of people in America still view it as silly, unserious music by silly, unserious people. Which, a lot of pop is. But people talk about Sabrina Carpenter, who makes music that's tongue-in-cheek and goofy differently than they talk about k-pop. I struggle to see the reason for that besides racism.\n\n## 7. So I saw this on Twitter and yes, this is true. K-Pop Demon Hunters is weirdly more Christian than Korean Shamanism (from r/KpopDemonhunters)\n\n**Score:** 0\n**URL:** https://i.redd.it/cl3817c27jlf1.png\n**Body:** Western animation keeps using Asian aesthetics to tell fundamentally Christian stories. This is like Raya and The Last Dragon all over again. I didn’t expect it to take this long for Christian essayists to get their hands on Kpop Demon Hunters.\n\nA few days ago, I [posted a fan theory](https://www.reddit.com/r/KpopDemonhunters/comments/1myt19b/more_theories_related_to_cosmic_symbolism_and/) breaking down the Taoist, I Ching, and Korean Shamanism references in the movie, and I lightly touched on the Western (Christian) elements woven into it. In the comments, I ended up explaining why I think a movie that’s supposedly inspired by Korean Shamanism, set in South Korea, somehow feels more shaped by Western mentality and Christian values than anything else.\n\nI wrote this as a response in one of the comments: \"[None of their actions, beliefs, or spiritual agenda resonates with the Eastern philosophy](https://www.reddit.com/r/KpopDemonhunters/comments/1myt19b/comment/nafxmt0/?utm_source=share&amp;utm_medium=web3x&amp;utm_name=web3xcss&amp;utm_term=1&amp;utm_content=share_button) of balance, harmony, and rebirth--principles central not only to Korean shamanism and Korean Buddhism but also overtly symbolised in the South Korean flag itself.\"\n\n**Spirituality in Children's Stories**\n\nUrsula K. Le Guin, a famous author who wrote 12 children's books, once described herself as an “inconsistent Taoist and a consistent unChristian”--something I resonate with deeply, and probably why I’ve been fascinated with Eastern spirituality and Western esotericism for most of my life. Le Guin wasn’t just a novelist, but also a scholar who translated the *Tao Te Ching* (the second most translated spiritual book after the Bible), and you can feel that Taoist influence in nearly everything she wrote.\n\nAnd honestly, spirituality in children’s stories is way more common than people think. Traditional fairy tales are **suffused with spiritual depth,** about morality, mortality, the soul. That’s why J.R.R. Tolkien had such a “heartfelt loathing” for Disney. Tolkien believed Disney corrupted the mature, spiritual depth of traditional fairy tales, reducing them to shallow, profit-driven entertainment.\n\nAnd, well… 52 years after Tolkien’s death, he’s still kinda right.\n\nTake Raya and the Last Dragon. On paper, it was supposed to be Disney’s big movie influenced by Buddhism and Asian spirituality. But in execution, it appropriated Asian aesthetics while quietly pushing Western Christian values underneath. And now, with K-Pop Demon Hunters, we seem to be circling the same drain.\n\nRaya wasn’t rooted in one culture but a mash-up of Southeast Asian traditions: customs, food, clothes, weapons, landscapes, and mythologies. Even the dragons, the Nāga, were drawn from Hindu-Buddhist lore. Everything looked Asian.\n\nAnd yet… when you dig into its spiritual core, something feels off.\n\nFor a movie supposedly centred on Eastern spirituality, it’s surprisingly hard to find deep Buddhist-centric analyses of Raya’s themes. Beyond a few mentions of the kundalini-inspired dragons that most people seem to describe as Chinese Dragons, most of the think pieces unpacking the movie’s “spiritual” lessons are… Christian. One after another.\n\nThis is only 6 out of 20+ other Christian essays about Raya I've read:\n\n1. [Disney's Raya is one of the best representations of Christian Values I've ever seen](https://www.reddit.com/r/Christianity/comments/lzy5m2/disneys_raya_is_one_of_the_best_representations/)\n2. [\"It resonates profoundly with Jewish and Christian Scriptures\"](https://popularcultureandtheology.com/2021/06/07/reflections-on-raya-and-the-last-dragon-part-2-on-steps-of-faith-and-the-redemptive-power-of-charity/#:~:text=it%20resonates%20profoundly%20with%20the%20Jewish%20and%20Christian%20scriptures)\n3. [https://lovethynerd.com/the-nuance-of-trust-in-raya-and-the-last-dragon/](https://lovethynerd.com/the-nuance-of-trust-in-raya-and-the-last-dragon/) \"Faith gives Christians clarity in recognizing good and evil\"\n4. [Integral Ecology, Wisdom, and Faith: Raya and the Last Dragon on Radical Solidarity](https://popularcultureandtheology.com/2021/03/22/integral-ecology-wisdom-and-faith-raya-and-the-last-dragon-on-radical-solidarity/) (Still in a Christian framing)\n5. \"[beneath the outer coat of magical and dragon-themed paint, are several pertinent metaphors of Christian truth](https://thecollision.org/raya-and-the-last-dragon-movie-review/#:~:text=beneath%20the%20outer%20coat%20of%20magical%20and%20dragon%2Dthemed%20paint%2C%20are%20several%20pertinent%20metaphors%20of%20Christian%20truth)\"\n6. [Raya and the Last Dragon: The Christian themes in Disney’s new blockbuster](https://www.premierchristianity.com/raya-and-the-last-dragon-the-christian-themes-in-disneys-new-blockbuster/3892.article)\n\nThe bottom line is, Western cartoons can't help but C.S. Lewis-ify their stories, which makes sense because Western society is predominantly a Christian culture. I can already see the same patterns (pun intended) in Kpop Demon Hunters. And this is why I live in the tension between loving KDH's symbolisms and sharing J.R.R. Tolkien’s sentiments--after all, there isn’t much difference between Disney and Netflix &amp; Sony.\n\n**Religion in South Korea**\n\nShamanism, also known as **Musok**, is Korea's indigenous and ancient religion. It has no central authority or fixed doctrine, but over the centuries, it’s evolved in a syncretic, complementary and overlapping relationship with Buddhism and Taoism. Korean shamans are called **mudang**, which is the core inspiration for Huntrix in KDH.\n\nAccording to South Korea’s National Statistical Office’s 19th Population and Housing Census (2015):\n\n* **56.9%** identify as **non-religious**\n* **27.6%** are **Christians**\n* **15.5%** are **Buddhists**\n\n\"**Disapproval of mudang, however (who are often regarded as quacks and charlatans), remains widespread in South Korea, especially among Christians.** Prior to Christianity's arrival in the 17th and 18th centuries, many Koreans practiced Buddhism, Taoism, Confucianism, and native folk religions like musok simultaneously. There is special affinity between musok practice and Buddhism. Mudang will often identify as Buddhists and worship Buddhist deities, while some Korean Buddhist temples venerate deities traditionally associated with musok. Musok is polytheistic.\" (Read more here: [https://www.judgementiscome.com/home/ethnic-religions/korean-shamanism](https://www.judgementiscome.com/home/ethnic-religions/korean-shamanism) )\n\n**Christian Elements (and slightly Western Esotericism) in Kpop Demon Hunters:**\n\n* **Gwi-ma** does not exist in actual  Korean myths--they have **no singular satanic figure**\n* **Dies Irae** in \"Your Idol\". Dies Irae is a Latin hymn that describes the **Last Judgment**. It's also a Gregorian chant that is commonly used in Hollywood, such as Star Wars and Frozen II.\n* **The Golden Honmoon** \\- The barrier is maintained by the power of the demon hunters' songs, which emotionally connect to their fans. I’d argue **Honmoon** works like an **egregore(ish)**.\n* If you’re unfamiliar: an **egregore** is a concept in Western esotericism--a non-physical entity or thoughtform that arises from the collective emotions and focus of a group.\n* You know that feeling at a concert where you’re so connected to everyone that you want to cry? Congratulations--you just experienced an egregore.\n* **\"Demon vs Hunters**\" **framing** \\-- this is my main criticism that the movie has **Catholicised/Westernised** Korean shamanism by turning a complex, syncretic spiritual practice into a simplified **“demons vs. exorcists” framework.** As opposed to being actual spiritual healers who act as bridges for the cosmic forces. Or at least recognise the importance of yin and yang balance &amp; harmony, instead of \"hunting or killing\" the dark forces.\n\nRaya did the same thing: it softened Southeast Asian animism, spirits, and ancestor veneration into family-friendly magical metaphors, promoting Christian-coded values more than you'd expect. And I’m afraid KDH might fall into the same trap.\n\n**BUT. BUT. BUT.** I’m an optimist. I have a lot of good faith in the writers because one message I’ve picked up after rewatching KDH multiple times is that it subtly explores lost spiritual wisdom and our disconnection from spiritual roots.\n\nAnd that moment where Rumi’s patterns glow like the demons feels intentional, like a nod to the idea of the **“bad within the good”** and the **“good within the bad”** in Jinu’s character. Yin and Yang.\n\nThat gives me hope that maybe, just maybe, this movie won’t completely erase the essence of Korean Shamanism, Buddhism, and Taoist influences in Korean culture &amp; mythology.\n\nI am aware that Raya and KDH are designed primarily for Western (though they say global) audiences while borrowing Asian aesthetics for novelty and “representation optics.” Their storytelling tropes follow Hollywood formulas: hero’s journey, monster threat, ensemble dynamics, but dressed in Asian-inspired visuals to seem fresh\\*\\*.\\*\\*\n\nSo far, in my opinion, there are only two Asian-focused Western cartoons that have faithfully embodied Eastern philosophy and spirituality:\n\n* **Avatar: The Last Airbender**\n* **Samurai Jack**\n\nSure, they used Western slapstick here and there, but you can feel the care and research behind how they respected their cultural inspirations.\n\nAfter my disappointment with Raya, watching KDH has me caught between admiration and dread. My heart races every time I get excited about this movie:\n\n\"*Could this be it? Are we finally going to get a Western animated film rooted in Eastern spirituality and mythology with a female protagonist? Or is this just another case of using Eastern themes as aesthetic dressing, stripped of real cultural depth?*\"\n\nThe sequel holds the answer. And if I find myself disappointed… I’ll just focus on the K-pop aspects.\n\nSome of you might think: *“Is it really that deep? It’s just a kids’ movie.”* I mean...**it borrows heavily from a belief system and mythology that’s been actively discriminated against by Christians**, yet **portrays more Christian values** while using the **original culture mostly as decoration**. Isn't that just...bad faith?\n\nWhether you’re spiritual or not, **spirituality has always been a core element of children’s stories**. You might not consciously notice it, but it’s why watching a Studio Ghibli film feels different compared to a Disney or Netflix production. Hayao Miyazaki's films are imbued with a personal, non-institutional spirituality rooted in Japanese beliefs like animism, Shinto, and Taoism, emphasising a deep reverence for nature, the presence of spirits (kami), and the spiritual essence within all living and non-living things.\n\nThe key difference between Raya (Disney) and KDH (Netflix/Sony) is that Raya is based on a fictional culture and land, which gives it more leeway. But if a movie uses a real culture’s spirituality as its narrative core, I think it’s only fair not to overwrite it with strong Christian/Catholic themes, especially from a religion that has historically condemned and erased that very culture.\n\n*Note: I am not against Christians. I hope this is not misconstrued. What I am against is using Eastern spirituality and myths as decorations to promote Christian values.*\n\n**Edit:** I hope those who misunderstood this post can re-read it with a calmer, more open mind. I genuinely don’t know how or why some of you thought I was claiming Kpop Demon Hunters is a Christian movie--t**hat completely defeats the entire point of what I wrote.**\n\nSome readers who noticed the Christian/Catholic themes are split: one group thinks it’s a good thing, arguing that it “fits the modern, fast-paced vibe” better than including Eastern spirituality. But that logic doesn’t hold up. **If you’ve been a Kpop fan for a while, you’d know plenty of idols are** **Buddhists**. And if you still think Buddhism doesn’t “fit the modern vibe,” there’s literally a global K-pop superstar who released a **Zen** Buddhism–themed music video and performs it live at concerts.\n\nMeanwhile, a huge portion of readers insist the movie isn’t Christian-coded at all.\n\nSo, okay. Let’s set aside my background in Christian and Catholic studies for a moment. Let’s pretend I’m just an ordinary viewer who’s recently gotten curious about religious themes in literature and media, following a few shamans on social media to learn more about different religions. Since July, I’ve come across **essay after essay** unpacking the **Christian values** embedded in this cartoon, which is supposedly inspired by Korean shamanism and mythology. Yet I haven’t found a single shaman or any practitioner of a syncretic faith overlapping with Korean shamanism who has said, “Yes, this authentically represents us.”.\n\nBut you know who has written about it? The Jesuit Post. They even called it an[ “Ignatian fever dream.”](https://thejesuitpost.org/2025/07/kpop-demon-hunters-is-an-ignatian-fever-dream-and-thats-a-good-thing/) And what does that mean? In their article, they explain how **the movie reflects the** **spiritual terrain originally mapped out by St. Ignatius of Loyola**, the founder of the Jesuits, also known as the **Society of Jesus...** that's the **largest religious order** in the Catholic Church.\n\nSo, to sum it up: Kpop Demon Hunters is currently operating on the **same spiritual frequency as the Jesuits,** not just some random conservative bloggers, but **literally the largest Catholic religious order.** And that’s… interesting, isn’t it? Especially considering I’m used to seeing Catholics write condemnations of “demonic” media, not this. (*No hate to the Jesuits and general Catholics out there, but you get my point.*)\n\nSo... shouldn’t we ask why a story supposedly rooted in Korean spiritual traditions ends up resonating more deeply with the Catholic Christians than with the very traditions it claims to represent? When the largest religious order in the Catholic Church is celebrating a movie inspired by Korean shamanism as aligning with their theology... shouldn’t that at least make you pause?\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. ✨Thank you for posting in /r/KPopDemonHunters! Want to hang out with fellow fans? Join our [**affiliate Discord!**](https://discord.gg/sxx9m65JtC)!\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/KpopDemonhunters) if you have any questions or concerns.*\n2. KPDH its not a Christian-coded movie.\nStarting, there is no God or saviours there, only Gwi-Ma, that has god-like powers, but in the underworld.\n\nAnd if anything, is a strong critique on blind indoctrination, represented by Celine's education on HUNTR/X, based on hiding her \"flaws\", and Gwi-Ma exploiting \"shame\" to manipulate people.\n\nAlso, the battle between light and darkness is present in all religions, and exist almost since the start of History.\n  - Gwi-ma does not exist in Korean myths because there's the Siwang--The Ten Magistrates (or Kings) of the Underworld. The movie replaced the Ten Magistrates with a singular satanic figure that does not exist in Korean myths. \n\nThe concept of \"shame\" and \"demons\" and \"sins\" are very, very Christian themes (I can go on with this). If it's not Christian-coded, then please explain to me why there is an evil overlord in a fiery hell, instead of a highly systematic and bureaucratic underworld run by 10 magistrates?\n\nAnd thank you for pointing out that there is no \"God\" mentioned or alluded to in the movie because it really does not make sense to have spiritual powers without a connection to the divine. The presence of a demonic figure indicates the existence of a divine being. Huntrix uses divine weapons to kill demons. Which means there is/are divine entities. You cannot have an underworld without a heaven. \n\nMaybe if you watch the Korean movie **\"Along with the Gods\",** it will give you more perspective on how the Korean underworld works.  \n  \nOr, read:  \n[https://koreantempleguide.com/siwang-the-ten-kings-of-the-underworld-%EC%8B%9C%EC%99%95/](https://koreantempleguide.com/siwang-the-ten-kings-of-the-underworld-%EC%8B%9C%EC%99%95/)\n    - Gwi-Ma is literally Devil in Korean, but spelled backwards.\n      - The same reason everything else is simplified in film - in the interest of time. Simplicity is not Christian coded. It's definitely movie coded. I wonder why Taoism could be explored more thoroughly in a 61 and 62 episode TV show then in a 90 minute movie. \n\nThe concept of shame is Christian ideology only? Fascinating. Also, there is no fiery hell. Only Gwi-ma is fire.  The rest of the representation is simply an underworld. \n\nChristians would not accept this movie as representing their faith any more than you aren't accepting it representing Taoism. It following a \"Hollywood story structure\" does not make it Christian either. \n\n\"This doesn't conform to Taoist or Korean mythology 1:1! I will cram it into a Christian shaped box whatever it takes!\"\n\nAll right.\n      - You are slowly getting there. It is a made-up Korean name. The root word \"Gwi\" can be found in other Korean spirits/myths like \"**Gwi**sin\", which is the word for spirits or ghosts in Korean, like the dalgyal gwisin (egg ghost) or the kong kong gwisin. \"**Gwi**myeon\" another term for Nathwi means Monster Mask. \"Gwi\" 귀 also means \"ear\" that's why in some automated translations Gwi-ma is translated to \"ear worm\". The \"**Ma**\" is from 악마 \"agma\" demon or devil.\n3. I would make an argument, though, that the reason you have the hopes you do about it, are because how many of the people behind the creation of this movie, the writers/directors/song writers, are korean-american or korean-canadian, for example, and so have a background of both their korean culture AND western christianity/catholicism?  And thats why there is such a blending of both. They arent necessarily trying to appeal to western audiences, so much as theyre trying to balance and, dare i suggest, find a harmony between the two. A common thread, as it were. Because so many religions and belief systems have common threads, even when much is made about how different and utterly incompatible they supposedly are.\n  - Yes, yes. I agree with everything you said. It's sort of like American Gods to some extent, where all the aspects of foreign deities coexist in modern-day USA. I just feel sad that a folk religion, one that has been constantly discriminated against, is being used to tell a story intertwined with the very religion that has been trying to erase it since the 17th century. Plenty of K-pop idols are Buddhists, and many mudang (shamans) also identify as Buddhists, so I really don’t think it would be difficult to integrate that into the movie. If anything, it would make the story feel more authentic.\n4. There is no religion in the movie.\n  - Hello suck-it-elon, the creators have been really open about how Kpop Demon Hunters is based on Korean Shamanism (Musok), which is an actual religion. The Huntr/x weapons are all based on real ceremonial objects used in shamanic rituals. So yes, there is religion in the movie.\n    - Using referenced weapons doesn’t mean there’s religion in the movie tho. And the clickbait that it’s somehow a Christian movie is beyond laughable\n      - Person, dude… the YouTube video essay isn’t mine. I have never, not once, promoted Kpop Demon Hunters as a Christian movie. My point, if it wasn't clear enough for you, is that the idea of **actively killing demons** as the central conflict is more aligned with **Christian and Western traditions** than Korean folk cosmology, where spirits are often appeased, guided, or bargained with--not simply destroyed.   \n  \nAlso, I only brought up the weapons as an example to make it clear that if they’re using tools that real Korean shamans use in the real world, that basically implies Korean shamanism exists within the movie’s universe. That means there IS religion in this movie. Just not represented authentically.\n5. i dont think kpop demon hunters would feel right focusing on eastern spirituality and stuff, mostly cause its set in modern times, and those kinda themes are mostly for slow feeling movies, and KDH is a really punchy kind of movie, and not something that slows down.\n\nand if you simplify the christian part, its just good versus bad, with redemption.\n  - Their weapons and Mudang--the very inspiration for Huntrix--are rooted in Eastern spirituality. Huntr/x is literally based on Korean shamans who still exist today. These shamans face heavy discrimination from Christians in modern Korea, yet their culture, beliefs, and ceremonial objects, things still alive and practised today, are being used in a Western cartoon with strong Christian themes.\n\nThe point I’m making is simple: **don’t erase them. Don't overwrite them. They’re still here. They’re still trying to exist.**\n\nYes, the “good vs. evil” framing is very Christian. A sharp contrast to Eastern philosophies, including Korean Shamanism, Buddhism, and Taoist thought, which emphasise harmony and balance. They teach us to accept that there is bad within the good, and good within the bad.\n\nI highly doubt it *can't* work. If Studio Ghibli can pull it off, I don’t see why Kpop Demon Hunters can’t. If other anime productions based in Japan can pull it off, then why can't they? If cartoons based on Norse mythologies can weave in their spiritual roots, I don’t see why Kpop Demon Hunters can’t.\n\nAlso, I’m not sure why you’d say it “won’t feel right” to focus on Eastern spirituality just because the story is set in modern times. So much of Eastern spirituality still exists today. Better yet, plenty of Kpop idols are Buddhists themselves.\n6. I love your write-ups, and you put into words what I was feeling, too. The Western (American) influence in the film hasn't been lost on a Korean audience—the demons being called \"demons\" or akma (악마; \"Devil,\" as in the Christian/Catholic devil) in Korean because we do not have actual evil demons (therefore, we do not have a name for them); and Korean people pointing out how \"un-Korean\" it was to sing about \"fixing\" the world in the hunters's song. A more appropriate word would be \"healing\" or \"saving,\" going by the mudang's practice of consoling and comforting the departed.\n\n\nWhen I heard the title of this film, I reconciled the fact that aspects of it had to be Westernized (made familiar to a Western audience) in order to appeal to the Anglosphere. I'm not resentful of that; rather, it just made me a bit sad thinking of how Korean people (and non-white people, in general) have to filter our cultures and beliefs in order to make them more \"palatable\" to a Western audience. Of course, this isn't including how the religious backgrounds of both Maggie Kang and EJAE influenced the plot and songwriting (not a bad thing; just pointing it out!).\n\n\nSo, yeah, this is a really interesting discussion to have so thanks for talking about it!\n  - Thank you so much for this. The non-Koreans/Asians have been telling me that this isn’t the case. I’m not resentful, but for some reason, when you point these things out to Westerners, they often get really defensive. They can’t seem to see the perspective from the other side that this movie, though set in South Korea, has been repackaged to fit the taste of a Western audience.\n\nIt’s like trying to explain why some fruits sold in Asian stores in Western countries taste different from the same fruits in their country of origin. It’s still a watermelon, but it doesn’t have that same sun-sweet richness of the earth.\n    - I totally understand how you feel! Judging by recent posts and comments here, I think there's been a bit of a back and forth debating the influence and presence of Christianity in the film so lots of people have been on edge. I hope you don't feel too down or discouraged. I 100% understand what you're saying, and I hope you'll continue to share more facts about Korean musok!\n      - Thank you, I'm glad you enjoyed my other posts &lt;3 And nah, I'm good :) I love that I have this platform to share the Eastern perspective. Resistance and denial are expected when it comes to topics like this, so I understand this sort of thing is not something they usually think about because it doesn't necessarily concern them, especially when it's about an entertaining cartoon movie.\n7. I understand the points you're making, also i'm very sorry about the fact that Korean shamanism is so persecuted by a lot of christians ( seems like those people skipped the part Jesus Christ himself said that God only wanted people willingly and not by force ), but even though we have those christian values in the movie, i think they're just oversimplified\n\nEvil x Good: Although that's a very christian logic, Christianity isn't the only religion with that, and although this goes against what traditional korean beliefs says, i think that was made way more to make the movie easier to comprehend instead of expressively trying to pass a christian message ( because the Korean ideas about spirituality might be confusing to western people ), after all, if that was to follow the whole christian message, Jinu shouldn't be able to be \"redeemable\" or for people to be sympathetic with him, because once in hell there's no hope for change or redemption\n\nThe girls don't draw powers from a higher being: In Christianity's view, you can only fight demons or exorcise them through the power of Jesus, the son of God, and your faith on Jesus aswell, the idea of slaying demons with music or their own powers sounds a little absurd for christians\n\nAnd about other values like friendship, redemption and everything, although Christianity has those values, i think that's just very general, Christianism and Buddhism share an impressive amount of values, even so that Catholic Koreans share a lot of syncretism with Buddhists, so although i can also see where you're coming from, when we narrow down, the good messages of the movie are just standard good moral values\n\nAnyways, i'm not strictly disagreeing with you or saying that you're wrong, is just that i don't really think the movie is Christian just because it has values that Christianity has aswell ( after all that's pretty inevitable when some of the staff movies has christian backgrounds and even Korea itself has a pretty good amount of christians ), is just that this kind of association comes naturally with the creators world view that is shaped by their story, nonetheless, i think that was a good analysis\n\nhttps://preview.redd.it/3wp9skc76klf1.jpeg?width=320&amp;format=pjpg&amp;auto=webp&amp;s=213feae4ca9b514010ddece1de77eaabb944f5cc\n\n## 8. 22F (GA,USA) - Looking for long-term weeb/gamer buddies (from r/GamerPals)\n\n**Score:** 17\n**URL:** https://www.reddit.com/r/GamerPals/comments/1n45hlk/22f_gausa_looking_for_longterm_weebgamer_buddies/\n**Body:** Hi, my name is Alexis and I'm 22 years old. I'm looking for long-term weeb-ish/gamer friends, as the title states. Lol. I've been pretty lonely lately and realized that making more friends would help with that. \n\nI currently stay at home and am unemployed, BUT I'm thinking about getting a job soon to save up and leave my current living situation. Until then, I'm free pretty much anytime and was hoping to find friends with a similar situation or at least is willing to make time to hangout with me.\n\nI like anime, watching movies and tv shows, playing videogames, and doing arts and crafts. I've been trying to get back into drawing recently and was thinking about picking reading back up. \n\nSome animes I've seen: AOT, JJBA (which I have a love-hate relationship after recently finishing part 6), One Punch Man, One Piece, Fairy Tail, Dragon Ball, Dragon Ball Z, and Dragon Ball Super, Tokyo Ghoul, Blue Exorcist, and more. I've been meaning to go back to watching One Piece, but I just haven't felt like it recently (I'm on episode 401). \n\nFor videogames, I play on PC only, although I have a PlayStation that I haven't used in a while. I like to play Marvel Rivals, Fortnite, Rainbow 6 Siege, Chivalry 2, and I might be getting Battlefield 6 when that releases. I have other multiplayer games, but I can't think of them right now.\n\nI just rewatched Kpop Demon Hunters for the 2nd time today and \"Your Idol\" is stuck in my head right now. I'm thinking about teaching myself Korean again and getting back into Kpop and Kdramas just because of that. \nI'm was also watching King of the Hill for the first time and The Amazing World of Gumball before I left home, but I sadly can't watch it in Korea right now. ;_;\n\nWhen it comes to values, I'm apolitical and agnostic (leaning more to atheist), so if that somehow bothers you, please don't message me. I lost a friend because of that months ago. \n\nWhen it comes to the conversation dying, just so we don't waste each other's time at all, if one of us is no longer interested in speaking to the other, please send \"🐔\" when you want to stop talking. No explanation is needed after that is sent. \n\nAlso, I'm currently on vacation in South Korea and will be here for another week, so I'm not free to play anything or voice call until I get home, but I'm free to text until I get home. \n\nOther than that, thank you for reading my post and I hope you have a good day/night! :)\n\n\n### Top 19 comments and their replies (up to depth 25)\n\n1. Reminder - This community is for finding friends to play games with. Please do not comment/DM if you are looking to date, flirt, or have unrelated intentions.\n\nIf someone is displaying any behavior that violates our rules, please use the report button.\n\nIf it occurs offsite, such as in DMs or discord, please report them using [this link.](https://www.reddit.com/message/compose/?to=/r/GamerPals) Include sufficient and explicit evidence of the behavior in your report.\n\nWe review all reports and will take appropriate action.\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamerPals) if you have any questions or concerns.*\n2. I'd be down to play if you have some good cross platform games since I'm on Xbox.\n3. Hey! I’m 23 and love anime and gaming in general!Dm me if you want to add my discord!\n4. id also be down my dc is water765432\n5. I’ll play Fortnite with u\n6. Wasup would be cool to know what other online games u want and would be cool to watch some anime dc:vladiwolfer if u want👍\n7. Im 17M if ur down to play w me. I can play rival fort and r6\n8. I'm from AL and play siege a bit.  I've been wanting more people to play that game with if you're down\n9. Hi there, Alexis. I know what you mean, I have a lot of good friends, but pretty much none of them are gamers or that big into anime. I’ve been in the market for someone with more aligned hobbies to play with. \n\nI’m Austin, a 24M from OH, USA, a former Blitz main from way back, I play a exclusively on PC, and I’m told I have a good sense of humor. If you want to connect, you can feel free to add me on Discord: .stinkus.\n10. Same here.I can play Fortnite/CS2/League of Legends/Minecraft with anyone LMAO. You can add me on discord - mom07398.\n11. 25m what was your favorite part of jojo's?\n12. 25M would love to game together sometime!\n13. hey! i'm 24m also from ga and i was also in korea for a bit visiting family! :D sent you a dm!\n14. down with BF 6 , run in squads if you like\n15. Pm me\n16. i sent a dm :3\n17. I’d love to play!\n18. I would be open to playing games if you’re chill, dm or reply if you feel like\n\n## 9. [30/M] - Scottish Highlander seeks friends (from r/penpals)\n\n**Score:** 22\n**URL:** https://www.reddit.com/r/penpals/comments/1n19hmi/30m_scottish_highlander_seeks_friends/\n**Body:** Hi, I'm James, from the North East of Scotland, I have a pretty decent postcard collection, but I also have a big interest in **languages**, Ideally I'm looking for some people toVC/IM but I am also open to **emails** and **Snail Mail**, although there isn't an option here for Voice Calling\n\nabout me :\n\nCooking random stuff: anything from pasta to curry to whatever TikTok convinced me to try.  \nFixing up the house or doing DIY: shelves that might fall off or painting a room just because.  \nWatching weird foreign movies: Japanese thrillers, French dramas, South Korean action films.  \nPlaying games: indie gems, RPGs, or whatever’s trending on Steam.  \nLearning languages: got a few random phrases in Japanese, French, and Spanish.  \nWandering: finding coffee shops with overpriced lattes, strolling art galleries pretending I know what I’m looking at.  \nMeeting weirdos: If you’ve got quirks, I’m interested.\n\n### Top 4 comments and their replies (up to depth 25)\n\n1. I’m downn\n2. 23M just dm you\n3. Hey, I am an international student at Aberdeen University\n4. Hey! I'm Anna 22 from Latvia! I would like to get to know you :) \nDo you want to do snail mail?\nP.s. as quirky as it gets\n\n## 10. Divided by race united by racism fanfic (AKA \"the year with no end\" chapter 2.5) (from r/ongezellig)\n\n**Score:** 7\n**URL:** https://www.reddit.com/r/ongezellig/comments/1n631xm/divided_by_race_united_by_racism_fanfic_aka_the/\n**Body:** &gt;!I already long ago have made a rough script for the Year with no end next part, but I feel like there needs to be something in between them, so here we go. Also, the name is mostly cause of shock value and cause it sounds cool, not a lot of racism here. Although as the name suggests, Maya and Mymy unite against a common enemy!&lt;\n\n\n                     #############\n\nMaya(writing through a chat with Yfke in WhatsApp): Yfke, I honestly feel stupid around your elaborate essays about Star Wars deserving of Oscar (or whatever the highest prize for essays is) and you got me hyped up for watching this franchise, but y r u not talking about other parts? You mentioned only like three movies, I thought they had at least a ten or so.\n\n\"Yfke started writing her a response sending one letter at a time. With each letter Maya's became more and more ***horrified*** from what she had done\"\n\nYfke:\n\n\n\nN\n\nE\n\nV\n\nE\n\nR\n\n\n\nT\n\nA\n\nL\n\nK\n\n\n\nT\n\nO\n\n\n\nM\n\nE\n\n\n\nE\n\nV\n\nE\n\nR\n\n\n\n\nA\n\nG\n\nA\n\nI\n\nN\n\n(Inner thoughts: ***Why did everything I do ends up so horrible? The second I thought I could relax and catch a break everything ruins on my own eyes....***)\n\n\"Eventually Yfke forgiven Maya, but that day their large text exchange has stopped\"\n\n\n                   ################# \n\n\n&gt;!(The \"###\" part was cause it's unrelated to what happens next, in previous part Maya established exchange of contacts with Yfke and she started infodumping Maya about star wars lore. Who would've thought die hard fan hates parts aside from main trilogy? Not Maya apparently)!&lt;\n\nMymy: Bert, so, if I understand you correctly, you said, I quote : \"VOC has bankrupted because inefficiency of slavery. By diversifing investment and paying locals livable wages VOC could've not just avoided rebellion, but increase shareholders profits due to increase in productivity\"? Silly Bert, why'd you think it'd work?\n\nBert (defensive): well, it worked with Ford company...\n\nMymy: poor Bert, America is a country of contradictions: they're a country of immigrants that hates immigrants, their biggest job provider has most of it's workers on welfare programs, anything that works in America would never work outside of it! Well, maybe it could work in Canada, if we're being really generous.... Regardless, this Henry Ford, this .... I wanted to say Yank, but then remembered Yankees are New Amsterdam descendants name stolen by americans, so he doesn't deserve such an honour. Basically, he's an arrogant fraud.\n\nBert: last trick up my sleeve: slaves don't pay taxes\n\nMymy: aye, good point. Well, maybe we can compromise, give the locals wages, but make VOC own the land and have a monopoly on all the goods sold to them so that we can squeeze the most from them\n\nBert: isn't that wage slavery?\n\nMymy: your point being?\n\nBert: but-\n\n\"It was too late, Mymy already switched her attention to Coco who was returning from her music repetition\"\n\nMymy: so, how did it go? Did your group liked a song I composed?\n\nCoco: well, the only person who didn't say anything about it was Yfke and she didn't had pen and paper to write her opinion...\n\nMymy: so, they loved it?\n\nCoco: sure... Let's switch away from colonial policies glorification next time you write something tho\n\n\"The next day\"\n\nVera: class, we're welcoming a new exchange student from South Korea, Jiho\n\n\"Maya felt completely unbothered by that until she realized that the only seat left empty is the one near her\"\n\n Maya (inner monologue): ***FUCK*** , and I thought my life couldn't get worse since I angered my homework writing back-up plan (Yfke)\n\nJiho (faked anxious tone): H-hallo?\n\nMaya (inner monologue): ok, at least he's anxious too so he wouldn't be bothering me too much\n\n\"Jiho gets the copybook to write what Vera says. Vera's history lesson is just Massa's recent video about \"rightful dutch claim\" (which is just the Netherlands itself lol), but in her voice and without historical persons tomfoolery\"\n\nMaya: wait, is that THE DEATH NOTE? THEY'RE SELLING THOSE IN KOREA?\n\nJiho: I guess, you watched it too? Cool\n\nMaya: of course I watched it, it's my favorite since I was like 10!\n\nVera: what's so interesting that y'all are talking about?\n\nJiho and Maya: n-nothing....\n\n\"After the bell rung Maya started yapping about her hyperfixations to Jiho. Jiho just nods and pretends to care\"\n\n&gt;!(Now I need to establish something, those who heard Massa's plans for episodes he never did know about Eiko. Jiho is Korean fake persona of Eiko and this character is supposed to be just saying \"yeah\" until it's convenient to ask Maya about Mymy. If you ever heard of class of 09, Jiho's behavior towards Maya is kinda like Crispin except with a purpose slightly different than getting into somebody else's pants)!&lt;\n\nJiho (running out of patience): So... What about Mymy? She's your sister, right?\n\nMaya (inner monologue): I KNEW IT! I DIDN'T WANT TO BELIEVE BUT DEEP DOWN I KNEW IT! WHY CAN'T I HAVE ONE GOOD DAY IN LIFE AND KILL MYSELF AFTER? WHY I ALWAYS MUST SUFFER?! Of course he wasn't interested in Death Note! Of course he wasn't interested IN ME! HE WAS IN LOVE WITH THAT ORANGE FUCKER! WHY THEY MUST ALWAYS TAKE AWAY EVERYTHING FROM ME?!\n\n\"Maya's blood boils and she sincerely wants to activate her stand to get her emotions switched with Jiho\"\n\nMaya: wait, no, I'm so angry right now, he'd kille if it happens! Even he doesn't, the last time I used it dude has thrown himself into a river... I think I have a better plan for revenge... He's in love with that pretentious bitch? I'm gonna pippi hate him! Who she hates the most? Japanese, spies... Yes! Japanese Jiho is!\n\n\"Later at Schoppenboer house\"\n\nMaya: Mymy, is it racist to think that new exchange student might be a japanese spy?\n\nMymy: No, but asking yourself that question for sure is. For all I care juho or whatever he's called could be a terrorist, he doesn't seem to bother anybody much and Soei said if I get thrown out of school for bullying into suicide Asian boy ***again*** I'll be disowned. So despite everything I have to tolerate him at least until graduation \n\nMaya: wowie... What the fuck I missed in your life? Anyways, I'm pretty sure Jiho wanted to kidnap you.\n\nMymy: even if it's true, you have to have a proof Maya, at least enough to convince Soei that it's serious\n\n\"Next happens a montage where Maya, trying to fabricate evidence, finds surprisingly a lot of proof. The last straw being a japanese passport\"\n\nMaya, showing photo of passport to Mymy: see? Apparently Jiho is a Japanese woman, and she's too old to be in this school! Also her name is ... Ai-ko?\n\nMymy choking on stroopwaffle: WHAT?! Maya, THIS IS SERIOUS!\n\nMaya: what, is she like a japanese AIVD or something?\n\nMymy: no, she's my... My sister, Maya!\n\nMaya: please say it's a joke\n\nMymy: you know I don't joke when talking about japanese, right?\n\nMaya: you never talk about japanese \n\nMymy: which is why I'm serious so rarely \n\nMaya: anyways... I apparently had a crush on your sister, but when Jiho started talking about you I thought he's in love with you, so I thought if I confront you against him I'll get my revenge, but now we know that it is indeed a japanese spy so I hope you won't kill me\n\nMymy: Maya, we don't have time for your awkward degeneracy, we need to do something! And quickly! Those lenses and fake freckles and hair dye can only hide so much of my heritage!\n\nMaya: wait, it was cause you were expected to be spied upon?\n\nMymy: yes, why else?\n\nMaya: integration?\n\nMymy: I spoke Dutch better than you since I was like 10\n\nMaya: anyways... Do we tell Coco?\n\nMymy: .... She won't believe us and if she does, I'm pretty sure parents would disown her for killing an exchange student \n\nMaya: I'm in!\n\nMymy: what?\n\nMaya: What?\n\n\"Next there is a montage where an uneasy alliance goes to Vera convincing her that Jiho committed identity fraud\"\n\nVera: sorry guys, this was the only exchange student in years, I'd rather keep that reputation loss outside of my portfolio in case I get fired\n\n\"Maya sees Coco biking home from repetition but Mymy carries Maya on hands away from Coco cause she doesn't want her involved\"\n\nMaya: ...why are you carrying me on hands ?\n\nMymy: don't make it more awkward than it already is, you know why.\n\n\"As it was the last day at school until end of winter holidays, Mymy decides to walk with Maya to Amsterdam court cause Coco gets her information only from rumours and local newspaper, so she won't know if they bring case to the capital. The day they return home is the last day of winter holidays\"\n\nMymy: the case is solved, Coco isn't disowned, what could possibly be better than that?\n\nMaya, crunching on kruidnoten: this, nom, thing, is the only reason I didn't escape on like 9 different occasions I had a chance to. By the way, how Coco didn't care when we were absent for a week or so?\n\nMymy: oh, I said her I send you to reeducation camp\n\nMaya: you WHAT?!\n\nMymy: well, you lasted a week without phone so I could call that a success regardless of whether you went there or not\n\nMaya: so THAT'S WHY THE WHOLE AMSTERDAM PROVINCE HAD A MAJOR BLACKOUT WHEN WE WERE HERE YOU BI-\n\n***to be (hopefully, not in the next year) continued***\n\n### Top 3 comments and their replies (up to depth 25)\n\n1. Btw it's like 2 a.m. where I live so sorry for some typos and inconsistencies if there are any\n2. Where are the first two parts\n  - Here: https://www.reddit.com/r/ongezellig/s/oHMTqISWtY\n3. Also, Jiho isn't name by Massa, it's just a four letter Korean name I thought fits, considering it means \"smart tiger\" or something like that\n\n## 11. Bong Joon Ho to Preside Over Marrakech Film Festival Jury (from r/Koreanfilm)\n\n**Score:** 36\n**URL:** https://i.redd.it/77y2w3xg40mf1.jpeg\n**Body:** South Korean director Bong Joon Ho, who won three Oscars with “Parasite,” will be the chair of the jury of the 22nd Marrakech Intl. Film Festival, which runs Nov. 28 to Dec. 6.\n\nThe jury awards the Étoile d’Or to one of the 14 first and second feature-length films in the international competition.\n\nBong said: “For many years, Marrakech has been a champion of fresh, beautiful films. I’m delighted and honored to be part of that tradition. I look forward to sharing a powerful cinematic experience with the festival audience and reflecting on the true value of ‘cinema.’ Our anticipation and excitement will be palpable in front of the big screens of Marrakech.”\n\n&gt;“Parasite” won Cannes’ Palme d’Or, two BAFTAs and Oscars for best motion picture, best achievement in directing and best original screenplay. Bong made history becoming the first non-English-speaking filmmaker to win best picture.\n\n  \nBong’s most recent film was “Mickey 17,” starring Robert Pattinson, which premiered at this year’s Berlin Film Festival. His other films are “Barking Dogs Never Bite” (2000), “Memories of Murder” (2003), “The Host” (2006), “Mother” (2009), “Snowpiercer” (2013), and “Okja” (2017).\n\n&gt;In a statement, the festival said: “His work, which combines narrative virtuosity with a keen understanding of the social and political divisions of our time, stands as a rare example of cinema that appeals to both critics and the general public. Having gone from cult films to true cultural phenomena in just a few years, Bong’s films demonstrate the director’s ability to deconstruct genres and speak to audiences of all generations and cultures.”\n\nThe Marrakech Film Festival, whose festival director is French producer Melita Toscan du Plantier, has become a major cultural event within the Arab world, luring the starriest juries and equally impressive masterclasses year after year. Bong succeeds Luca Guadagnino who headed last year’s jury which comprised of Jacob Elordi and Andrew Garfield, among others.\n\nThe festival has also been applauded for fostering a new generation of filmmakers from the Arab world, especially from Morocco, through its selection, as well as its industry program, the Atlas Workshops. Ultimately, the festival has been shining a spotlight on movies that go on to win critical laurels, notably Asmae El Moudir’s “The Mother of All Lies,” which won the festival’s top prize in 2023.\n\nSource: [https://variety.com/2025/film/global/bong-joon-ho-preside-marrakech-film-festival-jury-1236501806/](https://variety.com/2025/film/global/bong-joon-ho-preside-marrakech-film-festival-jury-1236501806/) \n\n### Top 0 comments and their replies (up to depth 25)\n\n\n## 12. Movie of the Day: The Slug (2020) by Choi Jin-young (from r/Koreanfilm)\n\n**Score:** 37\n**URL:** https://www.reddit.com/gallery/1n193wo\n**Body:** [https://asianmoviepulse.com/2022/07/film-review-the-slug-2020-by-choi-jin-young](https://asianmoviepulse.com/2022/07/film-review-the-slug-2020-by-choi-jin-young)\n\nMovies centred around the repercussions of childhood trauma are a dime a dozen, but with “[The Slug](https://asianmoviepulse.com/tag/the-slug/)”, writer-director [Choi Jin-young](https://asianmoviepulse.com/tag/choi-jin-young/) offers up a more nuanced take on this tired premise. The South Korean filmmaker has enjoyed relative success with her numerous short films and jumps straight into challenging themes with this, her feature debut. The result is a profoundly touching work that benefits from treating its subject matter with realism and maturity.\n\nCheck the review in the link in the comments and let us know your thoughts on the film\n\n### Top 0 comments and their replies (up to depth 25)\n\n\n## 13. Movie of the Day: The Slug (2020) by Choi Jin-young (from r/AsianMoviePulse)\n\n**Score:** 38\n**URL:** https://www.reddit.com/gallery/1n1938n\n**Body:** [https://asianmoviepulse.com/2022/07/film-review-the-slug-2020-by-choi-jin-young](https://asianmoviepulse.com/2022/07/film-review-the-slug-2020-by-choi-jin-young) \n\nMovies centred around the repercussions of childhood trauma are a dime a dozen, but with “[The Slug](https://asianmoviepulse.com/tag/the-slug/)”, writer-director [Choi Jin-young](https://asianmoviepulse.com/tag/choi-jin-young/) offers up a more nuanced take on this tired premise. The South Korean filmmaker has enjoyed relative success with her numerous short films and jumps straight into challenging themes with this, her feature debut. The result is a profoundly touching work that benefits from treating its subject matter with realism and maturity.\n\nCheck the review in the link in the comments and let us know your thoughts on the film \n\n\n\n### Top 0 comments and their replies (up to depth 25)\n\n\n## 14. 22F (GA,USA) - Looking for long-term weeb/gamer friends (from r/Needafriend)\n\n**Score:** 3\n**URL:** https://www.reddit.com/r/Needafriend/comments/1n45516/22f_gausa_looking_for_longterm_weebgamer_friends/\n**Body:** Hi, my name is Alexis and I'm 22 years old. I'm looking for long-term weeb-ish/gamer friends, as the title states. Lol. I've been pretty lonely lately and realized that making more friends would help with that. \n\nI currently stay at home and am unemployed, BUT I'm thinking about getting a job soon to save up and leave my current living situation. Until then, I'm free pretty much anytime and was hoping to find friends with a similar situation or at least is willing to make time to hangout with me.\n\nI like anime, watching movies and tv shows, playing videogames, and doing arts and crafts. I've been trying to get back into drawing recently and was thinking about picking reading back up. \n\nSome animes I've seen: AOT, JJBA (which I have a love-hate relationship after recently finishing part 6), One Punch Man, One Piece, Fairy Tail, Dragon Ball, Dragon Ball Z, and Dragon Ball Super, Tokyo Ghoul, Blue Exorcist, and more. I've been meaning to go back to watching One Piece, but I just haven't felt like it recently (I'm on episode 401). \n\nFor videogames, I play on PC only, although I have a PlayStation that I haven't used in a while. I like to play Marvel Rivals, Fortnite, Rainbow 6 Siege, Chivalry 2, and I might be getting Battlefield 6 when that releases. I have other multiplayer games, but I can't think of them right now.\n\nI just rewatched Kpop Demon Hunters for the 2nd time today and \"Your Idol\" is stuck in my head right now. I'm thinking about teaching myself Korean again and getting back into Kpop and Kdramas just because of that. \nI'm was also watching King of the Hill for the first time and The Amazing World of Gumball before I left home, but I sadly can't watch it in Korea right now. ;_;\n\nWhen it comes to values, I'm apolitical and agnostic (leaning more to atheist), so if that somehow bothers you, please don't message me. I lost a friend because of that months ago. \n\nWhen it comes to the conversation dying, just so we don't waste each other's time at all, if one of us is no longer interested in speaking to the other, please send \"🐔\" when you want to stop talking. No explanation is needed after that is sent. \n\nAlso, I'm currently on vacation in South Korea and will be here for another week, so I'm not free to play anything or voice call until I get home, but I'm free to text until I get home. \n\nOther than that, thank you for reading my post and I hope you have a good day/night! :)\n\n\n### Top 2 comments and their replies (up to depth 25)\n\n1. REMINDERS TO ALL PARTICIPANTS:\n\n- **USE CAUTION: there are con artists, scammers and sexual predators on reddit.  This is NOT a controlled environment.**\n- As such, **WE STRONGLY ENCOURAGE POSTERS TO DISABLE THEIR CHAT AND PMs WHILE THEIR POST IS UP**  \n- This is a strictly SFW subreddit for platonic (non-sexual) friendships.\n- No soapboxing, catfishing, advertising, soliciting or venting.\n- No asking for upvotes, donations, favors or professional therapy.\n- No discord groups outside the weekly group thread.\n- No posts complaining about lack of replies or ghosting outside the weekly casual discussion/meta thread. \n- Users with high NSFW content will be temp-banned (&gt;80%) after mod-review.\n- Users who contact minors (&lt;18 y/o) with ANY NSFW content in their profile will be permabanned after mod-review.\n\nPlease review our rules here: https://www.reddit.com/r/Needafriend/about/rules/\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/Needafriend) if you have any questions or concerns.*\n2. Ps gamer here, we can make a party while playing GTA online for example , M28\n\n## 15. 30 [M4F] #northafrica #asia - Hoping to find a marraige partner to build a life with—centered on trust and respect (from r/FindLoveWorldwide)\n\n**Score:** 2\n**URL:** https://www.reddit.com/r/FindLoveWorldwide/comments/1n4dq0z/30_m4f_northafrica_asia_hoping_to_find_a_marraige/\n**Body:** Hi, just updating this  Reddit post as some things have changed. Just to give a quick introduction, I am 30, will be 31 in a few months and I am looking for a marriage partner who wants to live a child-free life.\n\n\n\nWhat I value the most in a relationship is;\n\n1) Trust where we do not divulge anything that is said or done privately to anyone else. Unless its something that is positive and can in no way be used against us in the future.\n\nWhen people get to know about our flaws and weaknesses, they can use it againt us. Information is power.\n\nAlso, I want someone where I don't have to be cautious, where I do not have to think twice before I speak.\n\n\n2) Respect for each other, where we do not argue or scold each other in front of anyone. \n\nIf their is an issue it can be dealt with privately and sorted out. \n\nPersonally, when I was in a relationship and I got scolded I never argued back but would think about my actions and slowly approach the person I was in a relationship with and sincerely apologise.\n\nIf it's the other way around, I will tell you what your mistake was but I will never yell nor insult you.\n\n\nAbout me: \n\n1) Black hair \n\n2) Tanned skin\n\n3) Height:  172cm tall\n\n4) Eat's quietly with my mouth shut\n\n5) Weight: was 72kg but after going through a painful breakup, I started overeating and my weight jumped to 80kg. However, I am working on cutting down my weight through exercise, OMAD (One Meal A Day) and 24 to 48 hour fasting.\n\n6) Location: from an Asian country, but live and work in another country.\n\n7) Clean shaven most of the time unless I don't shave for a day or two.\n\n8) I have not been sick in years as I listen to my body and take precautions before something happens. \n\n9) Smoking or vaping: none, never have and never will.\n\n10) Work Attire: Black suit, waistcoat and tie with a Black Fedora Hat\n\n11) Personality: Kind, polite, yet, cautious (this is how I have never gotten into any trouble in any of the countries I have lived in). I am also an ambivert.\n\n12) Hobbies: Nothing concrete, all depends on where I am living and what is available. Indoor or outdoor hobbies, does not really matter. But just to list a few hobbies I have been or am currently engaged in.\n\n- Riding a Jet Ski in the Ocean or on a lake\n- Mudding in an ATV \n- Nature and long exposure photography\n- Climbing Volcanoes and mountains\n- Camping out in the Desert under the stars\n- Monopoly, Chess, Checkers, Carom and other board games \n- Videogames \n- Card games \n- Cooking\n- Travelling to new places \n- Trying out now food and \n- Listening to music, watching movies \n- Horse Riding etc. The list can go on and on\n\n13) Social Media: I have never been interested in social media However, two months ago I have made a work account where reels are created and my follow count is  increasing. I am also filmed for advertisements and photographed at high end events where celebrities perform and gourmet food is served.  Even if I leave this Job, re-entry into this market is easy due to my experience and portfolio.\n\n14) Weather tolerance : Minus 10°C cold weather or searing 50°C heat or rainstorms I have gotten used to it .\n\n15) Child-free life: When I was 17, I made a firm decision that I never want to have kids and despite so many people trying their best to convince me otherwise, I have never changed my mind and never will. \n\n16) Music preferences: English music, European, Arabic, Chinese and Korean Music.\n\n17) Food preferences: Thai (anything without Rice), European and Middle Eastern food. \n\n18) I don't go partying or raving. \n\n19) Siblings: none, I am the only child\n\n\n\n\nMy Strengths \n\n1) Independent and self-reliant where I always have a plan B just in case things go south.\n\n2) Flexible and adaptable in terms of a new country, environment, weather or situation. \n\n3) Focuses on continuous self-improvement and growth. \n\n4) Mission Oriented mindset - when I set a goal, I try my best to archieve it.\n\nMy Weaknesses \n\n1) Struggles with self-worth where I feel like I don't matter to anyone and no cares cares whether I am dead or alive. I believe that if I was married, I would no longer feel this way because, I would finally have someone to trust and someone to live for. \n\n\nIdeal Partner \n\nSomeone who values loyalty, commitment, trust and respect in a relationship.\n\nIf you would like to get to know each other better, send me a message and let's chat and later try to schedule a call when it is convenient for both of us.\n\n\n\n\n\n\n\n\n\n\n\n\n### Top 2 comments and their replies (up to depth 25)\n\n1. Hi!\n\nWelcome to /r/FindLoveWorldwide! I’m happy you posted! Consider this community your gateway to discovering love, no matter where it is in the world.\n\nAnd hey, if you're curious about connecting with someone directly through professional matchmaking, you can find more information by [clicking here](https://asian-women.com/?utm_source=reddit&amp;utm_placement=automodmail-submission&amp;utm_medium=subreddit&amp;utm_campaign=homepage&amp;utm_term=asian-womenmail&amp;utm_content=r_mail_sub-reddit)!\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/FindLoveWorldwide) if you have any questions or concerns.*\n2. You sound like a dream.\n\n---\n\n"}