{
    "ranked_movies": [
        {
            "rank": 1,
            "title": "Joint Security Area",
            "reason": "Highly discussed and praised in multiple comments for its emotional depth, powerful storytelling, and anti-war themes. Users called it a masterpiece and one of their favorite Korean films."
        },
        {
            "rank": 2,
            "title": "Oldboy",
            "reason": "Frequently recommended as a must-watch Park Chan-wook film, often mentioned alongside Joint Security Area and other classics."
        },
        {
            "rank": 3,
            "title": "Parasite",
            "reason": "Widely acclaimed and referenced multiple times due to its Oscar wins and Bong Joon Ho's direction. Mentioned as a cultural phenomenon."
        },
        {
            "rank": 4,
            "title": "The Handmaiden",
            "reason": "Recommended as part of Park Chan-wook's filmography, praised for its narrative complexity and visual style."
        },
        {
            "rank": 5,
            "title": "Memories of Murder",
            "reason": "Noted as another classic by Bong Joon Ho, often discussed alongside Parasite and his other works."
        },
        {
            "rank": 6,
            "title": "Sympathy for Mr. Vengeance",
            "reason": "Part of Park Chan-wook's Vengeance Trilogy, recommended for fans of his work."
        },
        {
            "rank": 7,
            "title": "Lady Vengeance",
            "reason": "The third film in the Vengeance Trilogy, frequently suggested to complete the series."
        },
        {
            "rank": 8,
            "title": "Decision to Leave",
            "reason": "Highlighted as a recent Park Chan-wook film that is highly praised and worth watching."
        },
        {
            "rank": 9,
            "title": "The Host",
            "reason": "Mentioned as a notable Bong Joon Ho film, known for its mix of horror and social commentary."
        },
        {
            "rank": 10,
            "title": "Snowpiercer",
            "reason": "Discussed as one of Bong Joon Ho's works, noted for its dystopian themes and international cast."
        },
        {
            "rank": 11,
            "title": "Mother",
            "reason": "Recommended as another impactful Bong Joon Ho film, often cited for its emotional storytelling."
        },
        {
            "rank": 12,
            "title": "No Other Choice",
            "reason": "Park Chan-wook's latest film, reviewed positively and anticipated by fans, though not yet widely seen."
        },
        {
            "rank": 13,
            "title": "Masquerade",
            "reason": "Recommended specifically for Lee Byung-hun's performance, noted as a favorite Korean movie."
        },
        {
            "rank": 14,
            "title": "Along with the Gods",
            "reason": "Mentioned in a discussion about Korean underworld mythology, providing cultural context."
        },
        {
            "rank": 15,
            "title": "The Slug",
            "reason": "Featured as a movie of the day, noted for its take on childhood trauma and critical acclaim."
        },
        {
            "rank": 16,
            "title": "Barking Dogs Never Bite",
            "reason": "Bong Joon Ho's debut film, mentioned in lists of his works."
        },
        {
            "rank": 17,
            "title": "Okja",
            "reason": "Another Bong Joon Ho film, discussed for its themes and international appeal."
        },
        {
            "rank": 18,
            "title": "Mickey 17",
            "reason": "Bong Joon Ho's most recent film, noted for its premiere at Berlin Film Festival."
        },
        {
            "rank": 19,
            "title": "The Ax",
            "reason": "Mentioned as a film similar to Park Chan-wook's No Other Choice, providing context for the latter."
        },
        {
            "rank": 20,
            "title": "Kpop Demon Hunters",
            "reason": "Discussed extensively in multiple threads for its themes, cultural representation, and popularity, though it is an animated film."
        }
    ]
}