{"content": "## 1. What movies use science so inaccurately it’s distracting? (from r/movies)\n\n**Score:** 1139\n**URL:** https://www.reddit.com/r/movies/comments/1n2j1a4/what_movies_use_science_so_inaccurately_its/\n**Body:** San Andreas is probably the biggest offender for me. There are so many creative ways to make a thriller about a devastating earthquake but they had to make an unrealistically massive Tsunami (would never happen) and have California go underwater(again, would never happen). \n\nThis movie probably spread so much misinformation about earthquakes just for a shitty B tier action movie.\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. You've never seen Moonfall then.\n  - \"the moon is helping us!\" as gravity selectively works on some stuff but not others\n  - I got hurt and had to sit on a couch for 3 months. That movie was my favorite when it came on TV. It’s almost like it was a genius student getting nearly everything wrong on purpose.\n2. Lucy   \n\"She's now able to use 100% of her brain!\"\n  - And it unlocked sorcery, apparently\n    - I can probably overlook all the inaccurate biology, but then she produces a USB memory out of her own body, and I was like GTFO\n      - She just converted the microplastics that were in her body.\n        - USB is stored in the balls\n  - “We only use 10% of our brains” just like we only use 33% of a stop light. You really dont want the whole thing to light up at once\n3. Roland Emmerich appreciation post\n  - I think it was a “cracked.com” article which described his filmography as “the world goes kablooey with a date in the title” and I found that really funny\n  - I took a class in college that was just called Weather. The professor was a chill young meteorologist who knew most of us were in it for the easy A. At the end of the semester, we watched The Day After Tomorrow while he did commentary on everything wrong with the science. I’ve loved that movie ever since.\n  - It may be a tad underrated, but still love the scene where the characters ‘run away from the cold’ in Day After Tomorrow- Jake Gyllenhaal surviving by creating a massive fuckoff fire\n4. The X-Files movie hinges on bees picking up alien DNA from cornfields as they pollinate them.\n\nExcept bees don’t pollinate corn at all.  Corn is wind pollinated.\n\nThe director just wanted a chase through a cornfield.\n5. The Meg 2. Just exhale and you can walk around in at the bottom of the mariana trench in your gym shorts no problem.\n  - Was looking for this. “You don’t see any of the fish out there swimming around in special suits.” \n\nAh of course, of course, it’s all so obvious.\n  - Wait what the hell. I have to watch this movie, that is impressively stupid.\n6. The Happening, where people attempt to run away from the wind.\n7. 2012\n\n\"The neutrinos are mutating!\"\n  - Dara O’Brien ended one of his standup specials talking about that line. He even brought on the actor who says that line in the movie to perform an alternate version of the scene. “The Latinos are mutating…And they are heating up the planet!” And flamenco music starts playing and they take off their jackets to reveal brightly colored ruffles on their sleeves 🤣\n\n## 2. Darker Thriller/mystery movies that really make you think, or a great twist (from r/MovieSuggestions)\n\n**Score:** 10\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n2se3e/darker_thrillermystery_movies_that_really_make/\n**Body:** I have become so obsessed with movies that really lock me in to figure out what is happening, but would never be able to guess. Even just well directed thrillers with a great story. \n\nSome good examples have been Shutter Island, Memento, The Prestige, Identity, Coherence, Prisoners, The Game, Zodiac, Seven, Interstellar, etc. \n\nBeen having a hard time finding new movies/shows  to enjoy that give me the feeling that I have gotten from these movies. Any help would be greatly appreciated!\n\n### Top 15 comments and their replies (up to depth 25)\n\n1. The Vanishing (1988) - Dutch film with a typically European ending. When it was remade in 1993 with Kiefer Sutherland, they ruined it with a happy ending. The original is, iirc, terrifying.\n2. Parasite (2019)\n\n Usual Suspects\n\n Sixth Sense\n3. Nightmare Alley - Guillermo del Toro\n\n\n12 Monkeys\n  - 12 monkeys is so underrated! Don’t watch previews just jump in!\n  - The ending of nightmare alley is so good.\n4. Incendies\n5. \"Suicide Kings\"\n  - Fish boots!!\n    - Gimme the fuckin' buskit...\n  - Forgot about that awesomeness.  Ira, you are the man!\n    - I can hear it in his voice hahaha\n6. Prisoners\n7. Malice \n8. The Machinist\n9. - In The Cut\n- Promising Young Woman \n- Nocturnal Animals \n- Donnie Darko \n- Under the Silver Lake \n- The Substance\n10. - Blue Ruin (2013)\n\n- The Clovehitch Killer (2018)\n\n- Hidden (2015)\n11. Frailty\n12. Dead Again\n13. Secret Window\n14. Hard Candy\n\nSleep Tight\n\nThe Treatment, 2014\n\n## 3. Local theater is doing a 'forgotten films' marathon: what's a movie you always recommend but nobody's heard of? (from r/movies)\n\n**Score:** 715\n**URL:** https://www.reddit.com/r/movies/comments/1n5plod/local_theater_is_doing_a_forgotten_films_marathon/\n**Body:** My local theater is doing a 'forgotten films' marathon and I want to suggest some truly underrated movies from the late 90s to early 2000s. Looking for films that deserved way more attention but got overshadowed by blockbusters. I'm thinking quality dramas or thrillers that critics loved but audiences missed. What's a movie you always recommend but nobody's heard of?\n\n### Top 18 comments and their replies (up to depth 25)\n\n1. A SHOCK TO THE SYSTEM (1990) with Michael Caine, Peter Riegert, Elizabeth McGovern, and Will Patton.\n\nJust a really fun, dark little comedy with Caine having an absolute blast as a man who discovers a great way to get that promotion he deserved.\n2. The Zero Effect\n\nBill Pullman stars as a modern day Sherlock Holmes called Daryl Zero, the smoothest of operators when working, an absolute ass when not. Ben Stiller is Arlo, his PA and whipping boy. It has a smart script, a great cast and an excellent story involving murder, blackmail, and a radiant water heater. Endlessly quotable, too. Directed by Jake 'son of Larwence' Kasdan, and it's just an excellent movie.\n3. The Dish. Excellent Australian film about the moon landing.\n  - We all watched that at work. But we work on radio telescopes.\n4. [Arlington Road.](https://www.imdb.com/title/tt0137363/?ref_=ext_shr) Stars Jeff Bridges, Tim Robbins, and Joan Cusak. Story about US domestic terrorists. Wicked twist and it stands the test of time.\n5. Noises Off!\n6. Strictly Ballroom\n7. The Frighteners.\n  - I love The Frighteners. I wish the CGI tech was better at the time it was made. It was made during a transitional tech period when the CGI was just bad in a way that makes the look of the movie age pretty poorly in my opinion. But everything else about that movie is so fantastic. Script, direction, and cast are all top notch. I’d love to see this movie with remastered effects. I don’t need a remake because those performances, especially Michael J Fox, can never be duplicated or improved on.\n8. Strange Days\n9. Breakdown, the Kurt Russel movie\n10. Sneakers, featuring Robert Redford and a great ensemble cast. The kind of movie that you just have on whenever it comes on TV.\n11. 'Frailty' directed by Bill Paxton, an excellent film.\n  - My buddy and I snuck into this movie when it was in theaters and so went in completely blind to what the movie was and about. One of the best movie experiences I’ve ever had.\n12. \"The Legend of 1900\" with Tim Roth and Clarence Williams111 from 1998.  I am a Piano music fan.\n13. Ravenous. To this day I am still unsure if it’s supposed to be serious or if it’s the darkest comedy ever made. Very entertaining either way.\n14. **Once Were Warriors** (1994, dir. Lee Tamahori). It's about a Māori family living in New Zealand and their everyday struggles with poverty, gangs, domestic violence, alcoholism and sexual violence. It can be a hard watch at times but the acting, especially from Lena Owen &amp; Temuera Morrison, is phenomenal.\n15. Until the End of the World\n16. 3 O’clock High\n17. Go (1999) A poorer man’s Pulp Fiction that I would argue is even more entertaining.  Massive cast that includes Timothy Olyphant, Katie Holmes, William Fichtner, Taye Diggs, Jay Mohr and some very early Melissa McCarthy.  \n\nThe movie didn’t make much in theaters, but was well-received by critics and has attracted a cult following since its release some 25 years ago.\n\n## 4. I'm convinced that I've watched all the good thriller/mystery or horror movies (from r/MovieSuggestions)\n\n**Score:** 7\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n13md0/im_convinced_that_ive_watched_all_the_good/\n**Body:** What can you suggest to someone who believes he's watched all the good mystery/thriller or horror movies? (Basically looking for lesser known/underrated ones)\n\n### Top 19 comments and their replies (up to depth 25)\n\n1. Italian Giallo films \n\nPure Cinema Podcast has done a few thriller episodes they always highlight deep cuts.\n2. Are you looking for \"Seen the best, where's the rest\"?\nHere are some I don't see suggested often:\n\n**Horror**\n\n- The Guardian (1990)\n\n- Cobweb (2023)\n\n- The Entity (1982)\n\n- The Children (2008)\n\n- Dead &amp; Breakfast (2004) . . . . a personal cult favorite of mine.\n\n**Thriller**\n\n- Duel (1971)\n\n- Malice (1993)\n\n- Pacific Heights (1990)\n\n- The River Wild (194)\n\n- Unthinkable (2010)\n\n- The China Syndrome (1979)\n\n- What Lies Beneath (2000)\n\n- Extreme Measures (1996)\n3. \n\n- Holy Spider (2022)\n- Just Another Love Story (2007)\n- Super Dark Times (2017)\n- The Stranger (2022)\n- Red Rooms (2023)\n4. 'Arlington Road' (1999).\n5. Night of the hunter\n\nCape fear (the original)\n\nAnd then there were none\n\nHouse on haunted hill\n\nFall of the house of usher with Vincent price\n\nLured\n\nThe game\n6. The Gift (2015)\n\nA Simple Plan (1998)\n\nLake Mungo (2008)\n  - Watched these 🙃 but thanks!\n7. The Prestige \n\nThe Machinist\n8. Doctor Sleep\n\nPandorum\n\nSleepy Hollow\n9. M\n\n39 steps\n\nThe lady vanishes\n\nAngels with dirty faces\n\nThe man who knew too much\n\nMaltese falcon\n\nThe big sleep\n\nFury\n\nGaslight\n\nRope\n\nRebecca\n\nLaura\n\nShadow of a doubt\n\nAnd then there  were none\n\nDouble indemnity\n\nThe third man\n\nThe postman always rungs twice\n\nThe spiral staircase\n\nAresenic and old lace\n\nKey largo\n\nCitizen kane\n\nRear window\n\n12 angry men\n\nVertigo\n\nNorth by northwest\n\nThe killing\n\nThe night of the hunter\n\nOn the waterfront\n\nBullitt \n\nCharade\n\nIn the heat of the night\n\nMurder at the gallop\n\nThe spy who came in from the cold\n\nRosemary's baby\n\nThomas crown affair \n\nHow to steal a million \n\nDay of the jackal \n\nDirty harry \n\nTaxi driver\n\nA clockwork orange \n\nSoylent green\n\nEscape from Alcatraz \n\nChinatown \n\nMurder by death\n\nThe long goodbye\n\nFrench connection \n\nAll the presidents men\n10. Fire Walk With Me\n11. Mute Witness (1995)\n\nThe Appointment (1981)\n\nRun (1991)\n\nTigers Are Not Afraid (2017)\n12. Tinker Tailor Soldier Spy - The 1979 BBC adaptation which is far superior to the later movie.  Sir Alec Guinness stars!\n\nThe Spy Who Came In From The Cold - 1965, stars Richard Burton.\n\nKlute - 1971, stars Jane Fonda and Donald Sutherland\n\nDon't Look Now - Julie Christie and Donald Sutherland\n\nAll of the Hitchcock movies\n\nAll of the Sherlock Holmes movies starring Basil Rathbone and Nigel Bruce\n\nColor of Night - 1994, stars Jane March and Bruce Willis\n13. I was blown away by Bring Her Back (2025).\n14. Delicatessen (1991)\n\nParasyte Part 1 &amp; 2 (2014 &amp; 2015)\n\nThe Last Man on Earth (I1964)\n\nI Am a Hero (2015)\n\nRare Exports (2010)\n\nNightbreed (1990)\n\nSlay (2024)\n\nThe Serpent and the Rainbow (1988)\n\nScreamers (1995)\n\nDreamscape (1984)\n\nDemon Seed (1977)\n\nThe Fury  (1978)\n\nExtremities (1986)\n\nLove Object (2003)\n\nHe Never Died (2015)\n\nRammbock: Berlin Undead (2010)\n\nFrontier(s) (2007)\n\nAfflicted (2013)\n\nSurviving the Game (1994)\n\nThe Untamed (2016)\n\nWillard (2003)\n\nNight of the Wolf (2014)\n\nThe Signal (2007)\n\nAnatomy (2000)\n\nSole Survivor (1984)\n\nInfection (2004)\n15. Have you explored the Italian gialli?  They're like slasher murder mysteries.  The best ones to get you started are:\n\n'The Bird with the Crystal Plummage' (1970)\n\nThe Strange Vice of Mrs Wardh (1971)\n\nDeep Red (1975)\n\nAll the Collours of the Dark (1972)\n\nLizard in a Woman's Skin (1971)\n16. Arlington Road\n\n8MM\n\nEden Lake\n\nGreen Room\n\nWind River\n\nHunter Hunter\n\nStrange Darling\n\nThe Skeleton Key\n\nStir of Echoes\n\nThe Chaser\n\nMemoir of a Murderer (2017)\n\nBedevilled\n\nBlack House (2007)\n\nBring Me Home\n\nSlice (2009)\n\n13 Beloved\n\nAlone (2007)\n\nThe World of Kanako\n\nDream Home (2010)\n\nMetro Manila\n\nMarshland\n\nSleep Tight\n\nKidnapped (2010)\n\nNight Call (2024)\n\nThe Vanishing (1988)\n17. Predestination (2014)  \nThe Gift (2000) the one with Cate Blanchett and Keanu Reeves  \nThe Mist (2007)  \nMemento (2000)  \nThe Game (1997)\n18. The stranger (2022)\n  - Great movie!\n\n## 5. Hey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything! (from r/movies)\n\n**Score:** 58\n**URL:** https://i.redd.it/szcyjxphnklf1.png\n**Body:** Hey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything!\n\n**Here's our trailer:**\n\n[https://www.youtube.com/watch?v=947I6zKNVfI](https://www.youtube.com/watch?v=947I6zKNVfI)\n\n**Synopsis:**\n\nAfter arguing with her parents a distraught teen opens an email promising acceptance, but what the message delivers infects the whole family.\n\nAsk us anything! We'll be back tomorrow Thursday 8/28 at 5 PM ET to answer any questions.\n\n\n\n### Top 16 comments and their replies (up to depth 25)\n\n1. This AMA has been verified by the mods. Brian and Noelle will be back to answer questions tomorrow Thursday 8/28 at 5 PM ET. Feel free to ask away in the meantime :)\n\nInformation from our guests:\n\n------------------------------------\nHey r/movies, I’m Brian, filmmaker of Do Not Open, with Noëlle in her 1st role. We made a self-financed tech psychological-thriller in Sweden during the pandemic. Not horror, a psychological trap where technology pulls the strings. Mixed reactions, big conversations. We stand by it, ask us anything!\n\nHere's our trailer:\n\nhttps://www.youtube.com/watch?v=947I6zKNVfI\n\nSynopsis:\n\nAfter arguing with her parents a distraught teen opens an email promising acceptance, but what the message delivers infects the whole family.\n\nAsk us anything! We'll be back tomorrow Thursday 8/28 at 5 PM ET to answer any questions.\n2. I hope this doesn't come across as rude, but since you mentioned mixed reactions and said you stand by your work, I thought I'd throw it out there.\n\nI haven't seen your movie, but I read a review of it that says: \"What they've done wrong is try to give four characters equal 'drama space', which I suppose looks good on the actors' showreels, but in terms of engaging audiences it does the opposite. Who is the protagonist, and who are their friends and enemies? Basic story question isn't addressed.\"\n\nI think this is an easy trap for new filmmakers to fall into, and from the trailer, I can see how that might be the case for Do Not Open. Do you think this is a fair criticism of your movie? Why or why not?\n\nSecond question is, do you have any plans to make more movies? If so, what would you say are the biggest things you've learned now that you have finished your first movie?\n3. I apologize, I have not seen your movie but I appreciate that you’re willing to acknowledge any “mixed reactions,” do you think your film will be re-evaluated in the future, like as things maybe become even more relevant from your plot?\n4. Can you list 3 things you learned to do, or not to do, on your next film?\n  - 1. Don't wear too many hats, find a way to get the right support so you can focus on the story  \n2. Spend more time at the very beginning building relationships with festivals, distributors and audiences before filming frame 1. Know where you want the project to go and network along the way to build brand ambassadors.  \n3. Really find the right creative partners for the long-haul.\n5. Is this the 1st movie made by you guys ? What was it like making a movie and how did you get your movie released? Any advice you would have for other people who would like to make movies ?\n6. Which filmmakers do you draw the most inspiration from?\n  - Lynch, Fincher, Nolan, Scorsese are great and there are a ton of new-ish directors and projects that have been inspiring: Peele, Kwan &amp; Scheinert, and Bong Joon Ho for example.\n7. Hi Brian and Noelle, thanks for joining us!\n\nIf you could only bring 3 movies with you on a deserted island to watch for the rest of your life, what would they be? Bonus question: Best and worst pizza topping?\n  - Hi, I would bring The Lion King because it’s a classic I’ve loved since I was a kid, Forrest Gump because it’s such a great story, and Just Go With It because it always makes me laugh.  \nWhat would you bring?\n8. Noelle, what made you choose this film as your first role? Was it written for you or you joined later on? \n\nAnd are you looking to do more acting? If so, will you stay in the thriller/horror genre or are you looking for different types of roles?\n  - I was brought into the project after the script was already written, so it wasn’t written specifically for me. But as soon as I read it, I felt a strong connection to the character and the story. I wanted something that would push me out of my comfort zone, and this film definitely did that.\n\nAbsolutely, I’d love to keep acting. I’m definitely open to different genres. I want to keep exploring and challenging myself with roles whatever the genre.\n9. Hey all it's Brian! I and Noëlle are here and going to answer some questions so feel free to hit us with whatcha got. Thanks so much to r/movies for having us, I'm a long-time listener and first-time caller.\n\nHere we go!\n10. Hey guys,\n\nSuper interesting and enjoyable movie, what a rollercoaster of emotions!\n\nNoelle are you planning on continuing your acting career? If so, what kind of roles would you be looking for?\n\nAlso, if you could choose any movie / series - old or upcoming to be casted for, what would it be?\n\nAnd what's your all time favourite dish?\n11. What was the inspiration behind the film?\n12. What is the next step for the movie? \n13. Thanks so much to everyone here at r/movies. It was a pleasure to pop in and answer some questions. If you have a chance check out Do Not Open, I hope you enjoy the ride!\n14. Where do you get your ideas from?\n  - This is always the tricky question as there really isn't an answer that will either capture the truth or not sound like an outright lie. But, I can answer where the idea for this project came from.\n\nI had written two other scripts before this one with the intention of finally making a movie. Since I was 14 I wanted to make a feature and I started the long process of figuring out how to get it done. The first two scripts I wrote I really loved but they were too expensive and expansive so I had to give myself some rules to make the script accessible. I would use my apartment because I had it and could use it for free. I would use cameras I owned. It would be a small cast. Essentially, I made a bottle episode of a movie.\n\nSo, with those rules in mind I started to play with concepts and ideas. Using different cameras and different feels of the cameras drove me to start thinking about all the cameras on our phones, computers, houses and such. Then over about a year the ideas started building, the family came together, the themes of each character started developing and then I started finding a narrative that began a journey of its own.\n15. Hey! Any advice you can give to other indie filmmakers?\n\n## 6. Crime thriller/detective movies. (from r/MovieSuggestions)\n\n**Score:** 9\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n5p794/crime_thrillerdetective_movies/\n**Body:** Any good suggestions? Doesn’t have to be any underrated gems but even any classics would do as I haven’t watched much from this genre. \n\n### Top 20 comments and their replies (up to depth 25)\n\n1. The Usual Suspects\n\nPrisoners\n\nZodiac\n2. Chinatown.\n3. Manhunter (1986), The Silence Of The Lambs, Seven, most of Dario Argento's movies and some of Lucio Fulci's movies,\n4. Gone baby gone \n\nWind river\n\nAmerican gangster\n\nHeat\n  - Wind River is a great movie\n5. LA Confidential! Real good flick\n6. Experiment in Terror (1962)\n\nThe French Connection (1971)\n\nKiss Me Deadly (1955)\n\nKlute (1971)\n\nVertigo (1958)\n7. The Long Goodbye\n8. Thief (1981) \n\nManhunter (1986)\n9. The Cell\n\nMemento\n\nNaked Gun\n\n21 Bridges\n\nThe Residence (series)\n10. Murder by numbers \n\nCopycat\n11. Gingerbread Man\n\nDressed to Kill\n\nBody Double\n\nMortal Thoughts\n\nMost of Hitchcock\n12. Angel Heart.\n\nZero Effect.\n13. - Fallen (1998)\n- The Factory (2012)\n- The Dry (2020)\n14. The Thrid Man\n15. Not a movie but has to be mentioned. True detective\n16. The Frozen Ground (2013)\n\nThe Dry (2020)\n17. the kid detective \n\nthe girl with the dragon tattoo.\n18. Hate me if you want, but Red Dragon is my absolute favorite movie in the Silence of the Lamb's franchise.\n19. Series on Roku? Spencer for hire. Adapted from the book series. It’s done really well.\n\n## 7. Horror/Thriller movies that are actually scary (from r/MovieSuggestions)\n\n**Score:** 5\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n1ufad/horrorthriller_movies_that_are_actually_scary/\n**Body:** I want to watch something that is genuinely horrifying, not just nonstop gore and bad acting. For all I care the film doesn't even need to have gore. \nI want it to be unsettling/creepy and I want jumpscares (I love jumpscares).\nMore than anything, I would like to watch a movie that I can't guess what will happen next, (surrealism is okay) and will surprise me.\nDon't care when it came out or who directed it! Don't spoil anything in the replies.\n\nMovies I've watched like this for reference:\n\nMidsommar (2019)\n\nGet Out (2017) \n\nParasite (2019)\n\nCabin in the Woods (2011)\n\n### Top 19 comments and their replies (up to depth 25)\n\n1. Oddity\n2. Barbarian\n3. the wailing(2016) sounds prefect for you…. \n\nit’s got that unpredictable creepy vibe without relying on gore\n4. Us\n\nThe shining \n\nCandy man (90s release)\n\nBlair Witch Project (original one)\n5. Lake Mungo (2008)\n\nIt Follows (2014)\n\nThe Autopsy of Jane Doe (2016)\n6. I watched Bring Her Back recently and LOVED it. First time I've been scared and unsettled from a movie in a long time!\n  - My husband is big into the genre and came home from the theatre delighted by how creeped out he was by Sally Hawkins' work.\n7. Alien, the Exorcist, Jaws,\n8. Event Horizon\n9. lights out is pretty good jumpscare horror\n  - I watched the trailer a few weeks ago and then I COULD NOT find it, thank you!\n10. In The Mouth of Madness\n\nThe Ring\n11. I watched \"Outside\" today. It has been a long time since zombies creeped me out, but the zombies in this movie did the trick.\n12. Agreed with others on Blair Witch Project! When I watched it as a kid and it first came out I thought it was a real documentary. If you watch it from that perspective its sooooo unsettling!\n13. Green Room is the only movie I’ve seen in recent memory that’s actually made my palms sweat \n\nHonorable mentions include\n\nThe Descent\n\nTalk to me\n\nThe hitcher \n\nCandyman \n\nDon’t Breathe \n\nFrailty \n\nPet Semetary\n14. I find [this site to be helpful!](https://scarymeter.com/)\n15. Gonjiam Haunted Asylum.  \nThe taking of Deborah Logan    \nTerrified\n16. It’s like real hard to actually spook me (huge Stephen king fan so yenno) but tbh **the autopsy of Jane doe** was one that did me in most recently\n17. The first 3/4 of Barbarian was pretty tense and scary\n18. Psycho (original)\n\n## 8. Any Thriller/Romance Movie recommendations?? (from r/MovieRecommendations)\n\n**Score:** 9\n**URL:** https://www.reddit.com/r/MovieRecommendations/comments/1n5s7hm/any_thrillerromance_movie_recommendations/\n**Body:** Hiii so I just watched Strange Darling; I thought it was good, had some cliche dialogues but overall I enjoyed it.\n\nThe thing is I so desperately was rooting for it to be a love story between the two protagonists. A weird crazy kind of love story line I guess.\n\nSo can anyone recommend any thriller, romance or just romance or just thriller idk but similar to the protagonist in SD but they actually fall in love\n\nAm I making sense?\n\n### Top 12 comments and their replies (up to depth 25)\n\n1. Natural Born Killers\n\nTrue Romance\n\nKalifornia\n  - Three solid choices.\n  - Thank youuuuu \n  - True Romance is a goated movie. Young Brad Pitt, James Gandolfini, and an all time Gary Oldman performance. “I eat the pussy, I eat the butt. I eat every motherfuckin thang”\n    - It’s just one of the best. The epitome of cool.\n2. I'm not sure if it's what your looking for but have you seen The Voyeurs?\n  - I haven’t! Thanks I’ll check it out! \n3. Solaris (2002)\n4. Vanilla Sky\n\nThe Lobster\n\nThe Illusionist\n\nSide Effects\n5. Safe Haven\n\nPerfect Sense\n\nThe Handmaiden\n\nLabor Day\n  - Safe haven is so underrated. The twist 😭\n    - Exactly 💯\n6. Greasy strangler\n7. Mr. &amp; Mrs. Smith\n\nBrad Pitt and Angelina Jolie's chemistry is fantastic in that film.\n\nRomancing the Stone \n\nMichael Douglas, Kathleen Turner, Danny DeVito\n8. Gone Girl \n\nThe Crush \n\nFatal Attraction \n\nThe Boy Next Door \n\nObsessed \n\nSleeping with the Enemy \n\nNatural Born Killers \n\nWild at Heart\n\nBasic Instinct \n\nOriginal Sin \n\nChloe\n\nUnfaithful\n\nThe Loft\n\nAddicted\n\nBound\n9. Mr and Mrs Smith\n10. Shattered is a great thriller romance flik\n11. If you want that intense, “crazy love” vibe like *Strange Darling*, check out *True Romance*, *Mr. &amp; Mrs. Smith*, *Cruel Intentions*, or *Sea of Love*  \nThey mix thriller tension with a dark, passionate romance that actually develops between the characters\n12. Gone girl.. old but really good\nThe girl on the train\n\n## 9. Best thriller movies on tubi to watch (from r/TubiTV)\n\n**Score:** 15\n**URL:** https://www.reddit.com/r/TubiTV/comments/1n4wup5/best_thriller_movies_on_tubi_to_watch/\n**Body:** Hi all, i was looking for a good movie watch thriller on tubi for this sunday.  Please let me know thank yout\n\n### Top 12 comments and their replies (up to depth 25)\n\n1. You got a go De Palma\n\n- Body Double\n- Dressed to Kill\n- Blow Out\n- Passion\n- Murder ala Mod\n\n\nAlso\n- North By Northwest \n- Hardcore\n- Body of Evidence\n- Peeping Tom\n- Sudden Fear\n- Angel\n\nAnd probably my favorite thriller of all time is on here The Night of the Hunter\n  - Solid list\n    - Why thank you.\n2. The coffee table.\n  - Not sure that is a thriller, some people say it is a terror movie, for others, a very very very dark comedy. May be all of this.\n3. If you’re based in the US - I’d recommend Blow Out, Nightcrawler, Memories of Murder or Deep Cover.\n4. The Hunter\n5. Ronin.\n  - Love this movie, but would never consider it a thriller\n6. Medusa Touch\n7. Eye of the Needle\n8. Rift\n\nhttps://preview.redd.it/mdnawsnmhemf1.png?width=568&amp;format=png&amp;auto=webp&amp;s=76f91c2fb1ff04326532802914b09ac172717405\n9. Deathdream\n10. Dark City\n11. Memento, Deliver Us From Evil (2020), The Stanford Prison Experiment, Revenge (2017)\n12. Hush\n\n## 10. Movies where the victim turns out to be the real danger (from r/horror)\n\n**Score:** 512\n**URL:** https://www.reddit.com/r/horror/comments/1n5pzdt/movies_where_the_victim_turns_out_to_be_the_real/\n**Body:** I recently watched No One Lives and absolutely loved the way it flipped the script. What really hooked me was how the story set up a character to look like the one in danger, only for things to completely turn around. That twist of power, where the victim isn’t what they seem, made the whole movie so much more intense and exciting to watch. It gave the usual horror-thriller formula a fresh and brutal edge that stuck with me even after it ended.\n\nNow I’m looking for more films with that same kind of hidden danger vibe—where someone you think is weak, trapped, or in trouble turns out to be the real threat. Any recommendations for movies that deliver that kind of shocking reversal?\n\n### Top 17 comments and their replies (up to depth 25)\n\n1. Unfortunately, listing the films are probably a spoiler for anyone who hasn’t seen them…\nBut the first one I saw with that kind of twist was &gt;! Triangle (2009) !&lt;\n2. Don’t Breathe\n  - Loved this movie. Dude was a menace. The second installment wasn't that great imo\n3. High Tension (Haute Tension) - 2003\n  - Sure, the twist was bullshit and made no sense, but the rest of the movie before it was fucking *fire.*\n4. &gt;! Strange Darling 2024 !&lt;\n  - this was a fucking rollercoaster, my jaw dropped.\n\nfantastic movie (if you haven’t seen it, go in blind)\n5. One of the segments in *Trick ‘r Treat* (2007) certainly has this.\n6. Hard Candy\n7. You're Next (2011) and The Hunt (2020) are two good examples of that.\n  - The Hunt and Ready or Not will forever be my go to double feature in this niche. Don't know which one i love more.\n8. Better watch out\n9. Becky and Wrath of Becky, probably falls into this trope even though it's pretty obvious from the beginning. I enjoyed both of those.\n10. Abigail\n11. It’s not a horror movie but I highly recommend A Perfect Getaway\n12. You’re Next.\n13. Tucker and Dale vs Evil\n14. Pet(2016)\n15. Case 39.  I had it playing in the background this morning and it does fit your description.\n\nI do love \"No One Lives\".  I've always found Luke Evans kind of dangerous in most of his roles and this one really leans hard into that vibe!\n16. Strange darling\n\n## 11. Need a horror/thriller movie that has no nudity (from r/MovieSuggestions)\n\n**Score:** 1\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n6ysw2/need_a_horrorthriller_movie_that_has_no_nudity/\n**Body:** i would prefer if it was somewhat new (2020-now) but i dont mind older ones if they are good. i dont want nudity bc it makes it weird watching it with family members lmaoo. Also, i would prefer if it was in english tooooo.\nthank youuuuuu\n\n### Top 16 comments and their replies (up to depth 25)\n\n1. If no nudity, is it okay if the movies have beheadings and disembowelments?\n  - lol!  my dad always let me watch the most violent films growing up, but would get so upset about sex scenes.  disembowlings ok, butt cheeks damaging to morals\n2. Ready or Not \n\nThe Babysitter (both on Netflix)\n\nFear Street series (Netflix) \n\nBecky &amp; Wrath of Becky\n3. I really enjoyed Heretic!  First half in particular was great and crazy suspenseful\n4. Smile could be an option.  I’m not huge into horror but did watch that and it was alright.  Might make your skin crawl a bit but, from what I recall, there was no nudity.\n5. The descent\n6. It Lives Inside\n\n Shaun of the dead\n\n Stir of echoes\n\n Sixth Sense\n7. Savageland (2015) The Conspiracy (2012) Gags The Clown (2018) Howards Mill (2021)\n8. Abigail 2024\n9. Nope\n\nCertainly not Shining\n10. These are old (but, then, so am I)\n\nThe Haunting\n\nThe Omen\n11. Gremlins\n12. Pretty much any new horror that has a PG13 rating\n13. Lost Boys\n14. Aliens\n15. Evil Dead Rise\n16. Saw films\n\n## 12. Movies or shows that have atmospheric horror/thriller like Donnie Darko, The Craft, etc. (from r/horror)\n\n**Score:** 10\n**URL:** https://www.reddit.com/r/horror/comments/1n4f96a/movies_or_shows_that_have_atmospheric/\n**Body:** I’m not a huge fan of jump scares but I do love horror or halloween-vibes in movies. I’m definitely more of a Thriller genre viewer and don’t mind gore as long as it’s not over-the-top. Looking for movies that are kind of more atmospheric or eye candy. To give you an idea of what kind of movies I like:\n\n\nDonnie Darko\n\nThe Craft\n\nNope\n\nGet Out (I like all of JPs movies tbh) \n\nEdward Scissorhands\n\nThe Shining\n\nOthers\n\nSinners\n\nThe Butterfly Effect\n\n\n\nTV:\n\nArchive 81\n\nAHS\n\nHaunting of Hill House\n\nFrom\n\nX-Files \n\nStranger Things\n\nFringe\n\n\nI think Hill House is honestly pretty scary though and I hated the jump scares lol. I’m not big on monster / ghosts so Donnie Darko is the perfect example I can think of, it’s more psychological to me than pure horror. AHS is one of my favorite tv shows \nand also has the perfect mix of campy horror that I can stomach. So if anyone has recommendations based on my examples, Id really appreciate it.\n\n\n\n\n### Top 14 comments and their replies (up to depth 25)\n\n1. Check out The Mothman Prophecies.\n2. I just watched The Vourdalak and really enjoyed it\n3. Weapons\n4. Talk to me was very good and in the not really relying on jump, scares version of creepy\n  - wasn’t this an extremely scary / disturbing movie or are my friends just hyping it up too much lol\n    - There are scary moments but it's not super scary, no. Just very well-made and effective at telling its story. Very creepy in parts.\n\n\n*Bring Her Back*, by the same directors, is scarier for most viewers by a good margain. Also a great, creepy film. Sally Hawkins is a dangerously good actor.\n5. Now im wracking my brain on what to reccomend to you..i love movies/shows like this ..ooooohhh!!!\nThe cell!!!!\n6. Try these \n\nPulse 2001\n\nCure 1997 \n\nButterfly Kisses 2018 \n\nGhostWatch 1992\n\nThe Harbinger 2022 by Andy Mitton\n7. The Blackcoats Daughter \n\n\nThe Lighthouse\n8. The people underneath the stairs\n9. I've heard this was atmospheric but was too dark for some TV screens-- Poltergeist: The Legacy. It was on Showtime, and no it has nothing to do with the movie trilogy.\n10. Before I Wake\n\nThe Night House\n\nLate Night With The Devil\n11. Sleep 2021 (German)\n12. The Invasion (2007) I suspect you will like given that list.  Great list btw.  Its PG but man it scares the hell out of everyone I show it to.\n\nFor TV shows try the first season of Wayward Pines!  X-Files vibes but full contained horror story.  Go in blind.\n13. How have you not seen Super Dark Times(2017) ... Definitely full of Donnie Darko/Craft vibes... Its really one of my top favorites\n14. These aren't just great movies, but lots of atmospheric eye candy with Halloween vibes in some of them:\n\nDead Silence 2007\n\nEvil Dead 2013\n\nHell Fest 2018\n\nThe Woman in Black 2012\n\nThe Company of Wolves 1984\n\nFright Night 1985\n\nFright Night Part 2 1988\n\nTrick r Treat 2007\n\nMidsommar 2019\n\n## 13. Yorgos Lanthimos' 'Bugonia' Review Thread (from r/movies)\n\n**Score:** 863\n**URL:** https://www.reddit.com/r/movies/comments/1n2hw54/yorgos_lanthimos_bugonia_review_thread/\n**Body:** [Rotten Tomatoes](https://www.rottentomatoes.com/m/bugonia): 100% (22 reviews) with 7.70 in average rating\n\n[Metacritic](https://www.metacritic.com/movie/bugonia/): 79/100 (11 critics)\n\nAs with other movies, the scores are set to change as time passes. Meanwhile, I'll post some short reviews on the movie. It's structured like this: **quote first, source second.** Beware, some contain spoilers.\n\n&gt; Bugonia is by no means Lanthimos’ best work, but it looks spectacular thanks to the sheer richness, the stinging clarity and the eye-searing colors of Ryan’s VistaVision images. Besides, what’s not to love about extinction-level anxiety accompanied by the aching tenderness of Marlene Dietrich singing Pete Seeger’s anti-war folk song, “Where Have All the Flowers Gone?”\n\n-[David Rooney, The Hollywood Reporter](https://www.hollywoodreporter.com/movies/movie-reviews/bugonia-review-emma-stone-jesse-plemons-yorgos-lanthimos-1236355544/)\n\n&gt; The timely urgency of “Bugonia” could be identified from outer space unless you’ve been living under a celestial object these days, as rogue vigilantes taking down corporate bigwigs have, in a post-2020 world, turned into the folk heroes dominating headlines and activating internet warriors. That’s not to say “Bugonia” carries an empowering message: If anything, it’s distrusting in humanity’s ability to rise above our own failures, arguing that while it’s not too late to turn things around, we probably won’t anyway.\n\n-[Ryan Lattanzio, IndieWire](https://www.indiewire.com/criticism/movies/bugonia-review-emma-stone-yorgos-lanthimos-1235147826/): B\n\n&gt; Yorgos Lanthimos, the director of “Poor Things,” “The Favourite,” and “Kinds of Kindness,” has become a squirmy master of this brand of violent-outsider filmmaking; let’s call it enlightened misanthropy. He’s working in the tradition of directors like Stanley Kubrick and the Oliver Stone of “Natural Born Killers,” but Lanthimos operates with his own dark playfulness. His new movie, “Bugonia,” is a heady and gripping experience, in no small part because it takes the form of a duel — tactical, philosophical, brutal — between two characters who might almost be locked in a contest entitled “Who’s the More Outrageously Spectacular Anti-Social Offender?”\n\n-[Owen Gleiberman, Variety](https://variety.com/2025/film/reviews/bugonia-review-emma-stone-jesse-plemons-yorgos-lanthimos-1236499397/)\n\n&gt; On one level, which punchline the film eventually plumps for doesn’t matter: it’s in the twisty agonies of the telling that the buzz of Bugonia lies. But it has to end somewhere, and perhaps some viewers will find the payoff maddening – though others (like your critic) will just bark at the sheer virtuoso mischief on show. Either way, what a joke.\n\n-[Robbie Collin, The Telegraph](https://www.telegraph.co.uk/films/2025/08/28/bugonia-venice-review/): 5/5\n\n&gt; Bugonia is a very well made film, and while it is not true to say it is less than the sum of its parts, it is less than that final and very powerful part. Like Ari Aster’s recent film Eddington, it also shows how difficult it is to make internet conspiracy obsession interesting. For me, Bugonia doesn’t have the ingenuity and elegance of Lanthimos’s previous film Kinds of Kindness, nor the emotional generosity and audacity of his steampunk fantasia Poor Things. It’s a spiny, prickly, hothouse flower.\n\n-[Peter Bradshaw, The Guardian](https://www.theguardian.com/film/2025/aug/28/bugonia-review-emma-stone-might-be-an-alien-in-yorgos-lanthimoss-macabre-conspiracy-theory-comedy): 3/5\n\n&gt; It’s “Misery” meets “Mars Attacks” meets all kinds of other stuff, with the excesses being quite entertaining, if not as satisfying as, say, “Poor Things” or “The Lobster” or “Dogtooth” or “The Favourite.” Coming only a year after the sampler pack that was “Kinds of Kindness,” this feels in a way like Lanthimos on automatic and in overdrive, churning out fun transgressions one after another because he and his leading lady have so much fun doing them. Then again, too much Lanthimos is still kind of a blast.\n\n-[Steve Pond, TheWrap](https://www.thewrap.com/bugonia-review-emma-stone-jesse-plemons-yorgos-lanthimos/)\n\n&gt; The power of Lanthimos’s work has always come from his ability to provide surreal but dead-on metaphors that take on lives of their own: a futuristic resort where one must debase oneself to find a mate, in The Lobster; or a family where the parents have trained their kids to accept absurdities as reality, in Dogtooth. With Bugonia, it feels like he’s entered our world at last, at least for a while. Which also makes it maybe the saddest film he’s ever made.\n\n-[Bilge Ebiri, Vulture](https://www.vulture.com/article/bugonia-review-yorgos-lanthimos-enters-the-real-world.html)\n\n&gt; “Humans can’t help themselves,” Michelle pointedly observes in the film. Lanthimos offers little evidence to refute her case … but ample evidence to love and care for their well-being even still.\n\n-[Marshall Shaffer](https://theplaylist.net/bugonia-review-yorgos-lanthimos-paranoid-thriller-starring-emma-stone-movie-built-for-our-times-venice-20250828/): A–\n\n&gt; Lanthimos allows us the grace of that ending only after he’s put us through the wringer, maybe even boring us a little along the way. The world isn’t pretty, and Lanthimos is sounding the alarm. If only he would tell us something we don’t already know.\n\n-[Stephanie Zacharek, Time](https://time.com/7313036/bugonia-movie-review/)\n\n____________________________________________________________________________________________\n\n**PLOT**\n\nTwo conspiracy-obsessed young men kidnap the high-powered CEO of a major company, convinced that she is an alien intent on destroying planet Earth.\n\n**DIRECTOR** \n\nYorgos Lanthimos\n\n**WRITER**\n\nWill Tracy (based on the film *Save the Green Planet!* by Jang Joon-hwan)\n\n**MUSIC**\n\nJerskin Fendrix\n\n**CINEMATOGRAPHY**\n\nRobbie Ryan\n\n**EDITOR**\n\nYorgos Mavropsaridis\n\n**RELEASE DATE** \n\n- August 28, 2025 (Venice Film Festival)\n\n- October 24, 2025 (worldwide)\n\n**RUNTIME**\n\n117 minutes\n\n**STARRING**\n\n- Jesse Plemons as Teddy\n\n- Emma Stone as Michelle Fuller\n\n- Aidan Delbis as Don\n\n- Stavros Halkias as Casey\n\n- Alicia Silverstone as Sandy\n\n### Top 8 comments and their replies (up to depth 25)\n\n1. Is this guy the most efficient worker ever? Feels like he puts out a movie a year recently\n  - Kinds of Kindness felt like a very small production, plus it was kind of split into three. Wouldn’t be surprised if the turnaround time on that was only 3-4 months.\n    - It looks like it was about 9 weeks of production, then a year and a half until it released. \n      - Felt like something that was shelved and then rushed to release after the buzz from poor things.\n        - Well, Poor Things itself was filmed back in 2021.\n          - What happened was that Poor Things was a fairly VFX-heavy movie, so it had a long post-production period, and a lot of it was just waiting on VFX. So in that time since Yorgos didn’t have that much to do himself, he decided to quickly shoot Kinds of Kindness since it was a small movie and he felt the script was ready. Then they went back to finish and release Poor Things before finishing and releasing Kinds of Kindness, which is why it also took a while to come out.\n  - He and Luca Guadagnino have been on a roll lately, defying all mildly-racist stereotypes about Greek and Italian work ethic\n2. It's a Yorgos movie. You're either going to love it or loathe it.\n  - Sometimes both at the same time.\n    - I don't feel like I'm getting my money's worth if I walk out of a Yorgos movie feeling clean and normal.\n  - My pet peeve is when ppl say \"you either love it or hate it, there is no in-between!\" about a piece of media because invariably it's said about something I myself was left cold by.\n\nSame here. I've been following Lanthimos since Dogtooth and my opinions are all over the spectrum. I adored Dogtooth and Alps, enjoyed Poor Things and Kinds, merely liked Favorite, hated Kinetta etc.\n    - Yorgos is one of my favorite filmmakers, and yet he has films I really don’t care for. But I’ll go support him every time. Strange phenomenon!\n\nLOVED: Dogtooth, The Lobster, Killing of a Sacred Deer, The Favourite\n\nEnjoyed: Poor Things\n\nDidn’t Like: Kinetta, Alps, Kinds of Kindness \n\nI basically think his mid-career run of 4 films is one of the best runs of movies of all time (or at least my favorite)\n3. Misery meets Mars Attacks? I'm in.\n4. How are reviews comparing it to ‘Save The Green Planet’?\n  - &gt;!Apparently it follows the same beats pretty closely!&lt;\n  - This is what im here for. StGP is wild.\n5. Hell yeah brother. Stavvy going to the oscars🙌🏾\n6. I literally just heard about it when I saw the poster on here yesterday and now the reviews are out. Yorgos is pumping out movies like he’s got places to be.\n7. Wild that Stav is in this. I'm sure hell be a big screen presence\n  - Apparently he gives a great all-round performance\n\n## 14. [TOMT] [MOVIE] Man answers ad for an experimental trial - Thriller (from r/tipofmytongue)\n\n**Score:** 1\n**URL:** https://www.reddit.com/r/tipofmytongue/comments/1n3lw5e/tomt_movie_man_answers_ad_for_an_experimental/\n**Body:** I've been trying to remember what this movie was for years, please help me! What I can recall is that this guy needs money so he answers an ad for an experimental trial and drives way out to this mansion? And ends up getting trapped there I believe. And maybe even gets his brain fried? Not sure if I'm mixing that part up with another movie \n\n### Top 7 comments and their replies (up to depth 25)\n\n1. Participants on this thread will automatically be notified when it is solved. [Click here](https://www.reddit.com/message/compose/?to=TipOfTheirTongue&amp;subject=1n3lw5e%20Notify&amp;message=Click%20%27Send%27%20to%20be%20notified%20when%20this%20post%20is%20solved.%20%28You%20will%20not%20receive%20a%20confirmation%20message.%29) if you're not leaving a suggestion but would like to be notified.\n2. It was really good and I want to watch it again\n3. tusk?\n  - No it came out before Tusk, but that was a great film\n4. The Experiment (2010, US) / Das Experiment (2001, Germany) ????\n  - Thats a great movie but not the one I'm thinking of\n5. O Lucky Man has that story element. Here's the horrific scene when Roddy McDowell realizes that the trial isn't worth the risk no matter how much they pay: https://www.youtube.com/watch?v=SqGehlUI2Ck\n\nIMDb link: https://www.imdb.com/title/tt0070464/\n  - That looks very interesting, this movie was more in the 2010s I believe \n6. it’s not a movie, but maybe you’re thinking of the Black Mirror episode titled [Playtest](https://en.m.wikipedia.org/wiki/Playtest_(Black_Mirror))?\n  - Im pretty sure this is the ending I was mixing up in my head, and has some similar elements but the imagery is not what I'm picturing. \n7. [The Haunting (1999)](https://www.imdb.com/title/tt0171363/?ref_=ext_shr_lnk)\n  - I don't think that is it but looks good\n\n## 15. Movies similar to Heretic (slow burn psychological thrillers) (from r/MovieSuggestions)\n\n**Score:** 5\n**URL:** https://www.reddit.com/r/MovieSuggestions/comments/1n2opmn/movies_similar_to_heretic_slow_burn_psychological/\n**Body:** Hello! ive just watched Heretic and found it a perfect reference for a short film im writing!\n\nIf anyone can suggest similar films with slow tension rising and a phycological thriller aspect to it ( without jump scares and cliches) \n\nIf you can suggest any short films too like Laura can't sleep (prequel of SMILE) , that would be amazing!  \n\nThank yoU!\n\n### Top 11 comments and their replies (up to depth 25)\n\n1. It Follows\n\n\nGet Out\n2. Burning (2018)\n3. The VVitch\n\nThe Lighthouse\n\nMidsommar\n\nHereditary \n\nIt Follows\n\nRingu\n\nSaint Maud\n\nThe Lodge\n\nI Saw the TV Glow\n\nImmaculate\n\nThe Rule of Jenny Pen\n\nGet Out\n\nMen\n\nPi\n\nBlack Swan\n\nThe Woman in the Yard\n\nThe Others\n\nAfter.Life\n\nWhat Lies Beneath \n\nCompanion\n4. Ma (2019)\n5. The Invitation (2015)\n6. Pi\n7. Arlington Road\n8. Nefarious\n9. Birth\n10. The taking of Deborah logan.\n11. Delirium, Cuckoo or MaXXXine\n\n---\n\n"}